{"reviews": {"185411514": {"recommendationid": "185411514", "author": {"steamid": "76561198038332369", "num_games_owned": 183, "num_reviews": 70, "playtime_forever": 1608, "playtime_last_two_weeks": 391, "playtime_at_review": 1608, "last_played": 1736657199}, "language": "english", "review": "I really wanted to like this game. The writing is fun and lighthearted, and the silliness and \"randomness,\" reminded me a lot of the Paper Mario games.\n\nUnfortunately, the gameplay just isn't there (at least not the single-player campaign). The game has a bad habit of spiking the difficulty out of the blue, and when this game gets hard, it gets [b]HARD.[/b] Hard levels are often an absolute clusterf*** of enemies where you can't even tell which direction your ship is aiming until you die, enemies that can repeatedly and completely stunlock your ship, enemies that regen health faster than you can shoot them, or and bosses that can completely steamroll you in seconds. None of this is helped at all by the controls which are meant to feel realistic by taking ship momentum and turning speed into account, but end up just feeling sluggish. If this game was more of a standard twin-stick shooter I think it would have worked much better with the overall tone of the game.\n\nThe ship customization is also extremely over designed, where half the upgrades feel like they do nothing, and I feel like the game would have been much better if there were just 5 or 6 prebuilt ship types to choose from, and the game was balanced specifically for those. Instead, we get a virtually infinite amount of options to chose from, but only 1% of those will let you clear some of the levels (the game sure isn't going to tell you which though).\n\nLike I said, the story was fun and lighthearted and the main thing that kept me playing, but it was also the killing blow. At some point I just realized that the story hadn't established anything really [i]interesting[/i] that I was looking forward to seeing the end to, and was just kind of meandering while throwing around a bunch of made-up sci-fi words that didn't mean anything to me. Most of the game's environments look exactly the same, and excluding a very small handful of (barely) unique missions sprinkled throughout, it really just started to feel like I was playing the same level again and again. I might have just powered through for the heck of it, but this game is LONG, and especially if you're like me and end up having to repeat some of the boss fights dozens of times, the game is even longer.\n\nIt's a shame really. This is one of those games where it constantly feels like they were right on track, but kept missing the mark. Do I regret my time with this game? Not all of it. Outside of the few really frustrating bits, I had a fun and enjoyed myself. Would I recommend this to anyone? Solid no. Anything this game does \"well,\" others do better, and they're going to be more satisfying overall without the seriously frustrating bits that this game has.", "timestamp_created": 1736658900, "timestamp_updated": 1737143272, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183531931": {"recommendationid": "183531931", "author": {"steamid": "76561198303891633", "num_games_owned": 0, "num_reviews": 134, "playtime_forever": 1478, "playtime_last_two_weeks": 0, "playtime_at_review": 242, "last_played": 1735349951}, "language": "russian", "review": "Получить ачивку в гонке примерно как пройти оригинальный гоночный уровень в первой \"Мафии\"", "timestamp_created": 1735007912, "timestamp_updated": 1735007912, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 671, "total_negative": 137, "total_reviews": 808}, "cursors": {"AoJ4yZy78N4CerGXhwE=": "Mon Jan 20 17:17:43 2025"}}
