{"reviews": {"184963229": {"recommendationid": "184963229", "author": {"steamid": "76561198132647159", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 8146, "playtime_last_two_weeks": 1130, "playtime_at_review": 8046, "last_played": 1736958714}, "language": "russian", "review": "Игра детства, наверное как и большинство, была заброшена в том далеком детстве на невозможности пройти минное поле на разрушенных вратах. Прошел всю компанию за 126 ч онлайна вместе с ночными СУВ для заработка денег. 36 станций и 90 транспортников. Проходил последние битвы с хааками на М3 Немезида с PSG. До М2 так и не дошел, накопил только 30кк. Игра 10 из 10.", "timestamp_created": 1736196689, "timestamp_updated": 1736196689, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184678893": {"recommendationid": "184678893", "author": {"steamid": "76561198027670832", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 51385, "playtime_last_two_weeks": 0, "playtime_at_review": 51385, "last_played": 1735938124}, "language": "english", "review": "Love the X series of games. Fell in love with #3 forever ago and in the past year or so i have gotten around to playing them all from the first to the last. Was having a lot of fun in X2 the threat (as can be seen by my nearly 900 hours), but i just came across a game breaking bug half way through the main story line. Must be something unique to my save as i cant find anything about it. But its a real soul crusher that after nearly 900 hours i have to abandon the game.\n\nAnother issue i had with my nearly 900 hours is the game was clearly never meant to handle a large scale trade empire with the technology of 2003. It got to the point where i was spending more time replacing cargo ships that ran into each other and blew up then i was anything else when it came to my trade empire. And i feel like my empire was small and still the cargo ships had terrible path finding.\n\nDo your self a favor and just watch a lets play or read the plot behind this game and then just jump right into #3 as things are crazy better in every way.", "timestamp_created": 1735938966, "timestamp_updated": 1735938966, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184576711": {"recommendationid": "184576711", "author": {"steamid": "76561199072020095", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 7249, "playtime_last_two_weeks": 0, "playtime_at_review": 7249, "last_played": 1735857997}, "language": "russian", "review": "Игра достойный наследник первой части. Сюжет поставлен неплохими кат-сценами и простенькой диалоговой системой (которая ни на что правда не влияет). Присутствует даже какая-никакая драма, чего от экономического космосимулятора вообще не ждешь. Геймплейно - карта большая (настолько большая, что сюжет задействует максимум от неё максимум 10%), кораблей и пушек - много, добавили систему спутников связи, нормальную карту сектора и галактики. Когда понимаешь чем торговать выгоднее всего - процесс значительно ускоряется. Но надо сесть и разобраться... Обучение здесь не просто обязательно - но крайне необходимо, чтобы разобраться что к чему и как этим всем управлять. Но даже оно не гарантирует, что вы не застрянете. Хардкорненько. Новичкам рекомендую исключительно легкий уровень сложности, если вы не хотите перезагружаться и переигрывать одно и то же по 50 раз. Для своего времени игра - офигенная. Кому зайдет - играйте во все части и читайте книги (я это и делаю)\r\n\r\nНо совру если не упомяну минусы:\r\n- невозможно сложный интерфейс (все завязано на сложные комбинации клавишь и огромное количество меню/подменю)\r\n- невозможно пройти игру без возведения бизнеса, игра будет требовать с тебя кучу денег и прокачанный на максимум корабль, поэтому готовтесь торговать и возводить станции часов 30 а только потом беритесь за сюжет.\r\n- местами кривой перевод в критически важных местах, где обозначаются названия секторов и станций. (В квесте где написано прилететь на верфь к Сае Хо ЛЕТИТЕ НЕ НА ВЕРФЬ а во второй сектор бОронов на станцию квантовых трубок - ОНА ТАМ.)\r\n- даже с прокачанной на максимум кораблем NOVA - хааки будут очень сложными в сюжетных заданиях, умирать будете только так.\r\n\r\nВообще игра подойдет тем кто играл первую часть и выжил и кому интересно что там дальше. Если вы тут впервые - не знаю зачем вам это... будет больно и сложно и ...  больно.\r\n\r\nНо я фанат серии. Прохожу сейчас все игры подряд. И читаю книги. Лично мне очень зашло. 7/10. Но первая часть мне показалась гораздо легче и дружелюбнее да и ламповее.", "timestamp_created": 1735858885, "timestamp_updated": 1735858885, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184378297": {"recommendationid": "184378297", "author": {"steamid": "76561198990063658", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2058, "playtime_last_two_weeks": 0, "playtime_at_review": 384, "last_played": 1735943421}, "language": "russian", "review": "Любопытная игра, жаль к ней не было доп контента. Хорошее сочетание сюжета и большой свободы действия.", "timestamp_created": 1735689580, "timestamp_updated": 1735689580, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183646127": {"recommendationid": "183646127", "author": {"steamid": "76561198031800286", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 9430, "playtime_last_two_weeks": 1122, "playtime_at_review": 7523, "last_played": 1736986173}, "language": "german", "review": "das spiel an sich selbst ist gut nur das sie etwas Anbieten wo man andere Programme braucht um reibungslos\r\nspielen zu können finde ich nicht gut.\r\ndie hohe FPS im spiel sorgt dafür das bei einem video das spiel abstütz. und daher ein ein Programm baraucht die es Niedrig hält", "timestamp_created": 1735129114, "timestamp_updated": 1735129114, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 399, "total_negative": 86, "total_reviews": 485}, "cursors": {"AoJwipTDrPECc9SO/wE=": "Mon Jan 20 15:13:17 2025"}}
