{"reviews": {"185612090": {"recommendationid": "185612090", "author": {"steamid": "76561199066531883", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 118861, "playtime_last_two_weeks": 0, "playtime_at_review": 118861, "last_played": 1686182908}, "language": "english", "review": "I've had such a history with this fucking game.\n\nWhen I was a young middle school Woot, I discovered Spellstone while I was surfing Kongregate for the latest Flash games, which should tell you right away that I'm old. Anyways. I was ADDICTED. I played this game religiously in 2015, and then I lost my account when the first major new area, Duskwillow, opened up... I was so distraught. Months of time and card game experience I'd never get back. I never picked it up again.\n\nFast-forward to COVID. I have a Steam account now. I'm searching for actually good games to buy, and there it is. \n\"Hey!\" I say to myself. \"Isn't that the shitty card game I played when I was 14? I remember everyone saying the game was dead. It's free! I might as well start from scratch.\" 4 years, well over 2000 hours, and a freakin' DEV CREDIT later... Good God it's not worth it. Don't do this to yourself.\n\nOh, you're still here?\n\nYou actually want me to tell you about this piece of shit?\n\nStrap in. I warned you.\n\nSpellstone tells you it is a card-collecting game where you make a deck of 15 fantasy monster cards - all with \"beautiful hand-drawn art\" and \"rich lore\" - and pit them against various enemies to \"unravel the mystery of the Void\". Makes you think you're in for a story-rich, lovingly world-built card battle RPG with some cosmic horror elements. Anyone who knows me knows I'm obsessed with story-rich cosmic horror games. I'm a Kirby maniac! So why am I giving Spellstone such a scathing review?\n\nTwo words: \"false promises\".\n\nGameplay is fairly simple: you just drag one of your three cards onto the battlefield when it's your turn. Every four weeks (in real time), there is a new disgustingly overpowered \"Champion\" card (the ones with the 10 point stars), and there are also daily challenges and weekly events. Your progress on the world map is limited by an energy bar. Anyone savvy enough to smell a scam probably knows what they're up against by now: Spellstone is not an RPG, or even a CCG. It is a glorified mobile game intent on sucking away your money harder than Mortagan the Grave General siphons health when Undead cards have all the power. (Granted, this was a lot worse years and years ago, but you're still going to be very weak for the first year or so if you don't buy thousands of Shards.)\n\nEach card has up to three skills. There are more conventional ones. \"Bolt all 5\" will hit all the enemies with a bolt that does 5 damage. \"Armor 7\" reduces attack damage taken by 7 points. And then there are confusing ones. \"Ward 12\" is a passive shield that blocks up to 12 points of \"skill damage\" every turn. \"Backlash 6\" deals 6 damage to any enemy that targets the card with a skill. Not only that, each card also has a \"delay\" rating of 0 to 4. 0-delay cards (0d) are weak and frail but move instantly, while 4-delay (4d) cards have boatloads of health but have to sit there twiddling their thumbs for 4 turns before they activate. There are a lot of weird interactions that the game doesn't always tell you, so you'll have to ask your guildmates for help unless you're a veteran who's in too deep to quit.\n\nThere was a \"dark age\" in Spellstone history where the story campaign (which most people probably clicked through) ended, and they outsourced development to some, shall we say, less than gifted B-team devs. It was obvious the heart was gone. I've seen the development team change hands a bunch of times. After the original Synapticon group wrapped up, there was NewForcystus, who liked to make up sillier filler plots but ran things well. Then there was Kamakiri, who messed up the code sometimes but was always punctual and professional. Then there was Valfali, who introduced so many game-breaking bugs that his glitches, are now recurring memes in the Spellstone fan base. (And they're still with us to this day. Ooops!)\n\nNow, this game is in its sunset years, and Kongregate no longer cares enough to hire people AT ALL. Instead of a development team, it's got something called \"Comdev\" - short for \"community development\". Basically, a bunch of big spenders (\"whales\") who wanted to protect their investment (and myself, even though I was a broke college student). We have a Discord server and everything. There's one \"whale\" who appointed himself leader, and the way he treats the rest of the Comdevs, you'd think he was actually being paid for this. \"We've gotta get the story done by MONDAY, Woot!\" \n\nThat sort of relentless grind is exactly what you'll feel, wearing down your soul like an army of soldiers' spears as they pierce the hide of the mighty Cyclops, if you try interacting with this game for prolonged periods.\n\nI rate Spellstone an \"Error Code 11\" out of 10.", "timestamp_created": 1736897658, "timestamp_updated": 1736897658, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185463515": {"recommendationid": "185463515", "author": {"steamid": "76561199134095780", "num_games_owned": 580, "num_reviews": 1200, "playtime_forever": 337, "playtime_last_two_weeks": 6, "playtime_at_review": 331, "last_played": 1736710943}, "language": "russian", "review": "<3", "timestamp_created": 1736710579, "timestamp_updated": 1736710579, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185140905": {"recommendationid": "185140905", "author": {"steamid": "76561199163590643", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 3692, "playtime_last_two_weeks": 69, "playtime_at_review": 3692, "last_played": 1736354999}, "language": "english", "review": "fun", "timestamp_created": 1736374230, "timestamp_updated": 1736374230, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 286, "total_negative": 162, "total_reviews": 448}, "cursors": {"AoJ4hMSLj94CedPOgwE=": "Mon Jan 20 19:08:19 2025"}}
