{"reviews": {"184263213": {"recommendationid": "184263213", "author": {"steamid": "76561198380147058", "num_games_owned": 59, "num_reviews": 3, "playtime_forever": 37, "playtime_last_two_weeks": 0, "playtime_at_review": 37, "last_played": 1735598178}, "language": "polish", "review": "Absolute Cinema", "timestamp_created": 1735598260, "timestamp_updated": 1735598260, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184255476": {"recommendationid": "184255476", "author": {"steamid": "76561199072976839", "num_games_owned": 26, "num_reviews": 6, "playtime_forever": 266, "playtime_last_two_weeks": 0, "playtime_at_review": 266, "last_played": 1735592314}, "language": "english", "review": "This game is an absolute masterpiece, so I'm just going to talk about the best parts of this game.\r\n\r\nFirst off, lets talk about the title. This title is not misleading at all, but you do only see the lake at chapter 3, and it is in a hallucination.\r\n\r\nSecond, we got the horror. Amazingly put together. Lets go chapter by chapter.\r\nIn chapter 1, you start off with 2 scares that set you up for the game. There is also a very loud noise which makes you jump from the noise. There is also the giant head in the sewers\r\nIn chapter 2, you have the spheres. They make you have to think about where you are walking because of how fast you are. There are also crystal cats, which aren't that scary anyways.\r\nIn chapter 3, you are in a hallucination, already a recipe for fear. You also get a whole boss fight that brings lots of particles\r\nIn chapter 4, you have a scary green elephant, those birds (I hate them), bigfoot, and worst of all, a bunch of particles chasing you at the end.\r\nIn chapter 5, you get jumped by 3000 crystal cats at the end of night 2 (yes I am mad about that). Quite terrifying\r\nIn chapter 6, there is an entire chase sequence, masterfully made.\r\n\r\nLets talk about the gun mechanics now. First, you have the slow shooting, which makes you have to aim and only go for a few enemies at once. Second, you have running while aiming, which lets say, gives the funniest bug in the game. Third, there is very low range, making you have to get close to the enemies to kill them, making the suspense better.\r\n\r\nNow, lets go to the story. It takes place in russia, already a good start. Then you also have a blood lake making monsters, making it even better. Sound like an SCP I know, which is SCP-354\r\n\r\nThere are also the enemies.\r\nFirst, there is the dog, takes 5 bullets and is very loud.\r\nSecond, there is the sphere, which insta kills you when they see you.\r\nThird, there is the crystal cats, which are also pretty loud.\r\nFourth, we have the lake that chases you in the cave. It is just red, amazing right there\r\nFifth, we have the giant zombie. Great boss music, so already on top\r\nSixth, we have the birds, which are just annoying, also pretty loud.\r\nSeventh, we have bigfoot, best enemy\r\nEighth, we have the black particles. They have great boss music so they are already high on the list\r\nNinth, we have the blue shock wave, which noclips. Already good\r\n\r\nThe looks are also amazing, not much to say here", "timestamp_created": 1735592331, "timestamp_updated": 1735592331, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 421, "total_negative": 514, "total_reviews": 935}, "cursors": {"AoJ4jbGz+fMCfp/SmwI=": "Mon Jan 20 18:07:11 2025"}}
