{"reviews": {"185981663": {"recommendationid": "185981663", "author": {"steamid": "76561197984239069", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 6906, "playtime_last_two_weeks": 981, "playtime_at_review": 6179, "last_played": 1737410633}, "language": "french", "review": "MORDHEIM 2 PLS !!!", "timestamp_created": 1737331483, "timestamp_updated": 1737331483, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185904132": {"recommendationid": "185904132", "author": {"steamid": "76561198089435706", "num_games_owned": 320, "num_reviews": 8, "playtime_forever": 4678, "playtime_last_two_weeks": 2702, "playtime_at_review": 3657, "deck_playtime_at_review": 35, "last_played": 1737408869}, "language": "english", "review": "Great game! Grueling and absolutely brutal.", "timestamp_created": 1737249442, "timestamp_updated": 1737249442, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185841574": {"recommendationid": "185841574", "author": {"steamid": "76561198067787605", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 11683, "playtime_last_two_weeks": 4673, "playtime_at_review": 11176, "last_played": 1737392853}, "language": "german", "review": "Das Spiel an sich Mega kann man gut Stunden mit Tot schlagen, ABER kann das Game einen auch Ultra schnell in den Wahnsinn  treiben. Für Neulinge kann es abschrecken weil man am Anfang nicht so ganz durchblickt, am besten vielleicht Tutorial am Anfang schauen um rein zu kommen. Und lasst euch nicht von der RNG abschrecken in diesem Spiel sie ist manchmal echt hart Lächerlich aber macht dann trotzdem Laune, auch wenn man das verlangen hat in den Bildschirm zu boxen xD", "timestamp_created": 1737188675, "timestamp_updated": 1737188675, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185812511": {"recommendationid": "185812511", "author": {"steamid": "76561198056731370", "num_games_owned": 78, "num_reviews": 52, "playtime_forever": 1164, "playtime_last_two_weeks": 1005, "playtime_at_review": 754, "last_played": 1737383785}, "language": "portuguese", "review": "Eita joguinho mais filh0 da put@ viu. Faz uns 15 anos que só jogo qualquer jogo que eu inicio nos níveis mais altos de dificuldade, mas isso daqui é brincadeira.\r\n\r\nFaz Darkest Dungeon parecer absolutamente justo o tanto que esse jogo simplesmente escala a dificuldade e te arregaça do nada enquanto você tá evoluindo seus personagens. \r\n\r\nApesar da história base legal e mundo de Warhammer, acredito que o que fizeram com esse jogo é simplesmente abusar da punição para falar que o jogo é hardcore, enquanto muitas mecânicas são só esquisitas e um conjunto de sistemas para nerfar seus bonecos enquanto a tela toda tenta te matar, e na maioria das vezes um boneco só da warband adversária vai rasgar teu herói e mais 2, só por que sim.", "timestamp_created": 1737151119, "timestamp_updated": 1737151119, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185797949": {"recommendationid": "185797949", "author": {"steamid": "76561198304303568", "num_games_owned": 368, "num_reviews": 1, "playtime_forever": 2716, "playtime_last_two_weeks": 1657, "playtime_at_review": 2196, "last_played": 1737362555}, "language": "english", "review": "This game goes on sale for $2 six months of the year (can check “steam db price history”) and it is more than worth it. If you’re reading reviews, just pull the trigger and buy it. \n\nMordheim City of the Damned is an unappreciated diamond in the rough. I just discovered it a month ago after all these years, and it more than stands the test of time in both gameplay and visuals. The people that left bad reviews for this game either don’t understand probability (complaining about AI “cheating” cause they missed missing 2 80% chance to hit attacks in a row) or weren’t in the right mind space to play the game thinking every unit is an unkillable god and getting upset when units die or become crippled. I believe a good approach to this game for a new player is to treat it like Darkest Dungeon; understand that characters are going to die, you’ll get attached and lose units you care about for reasons mostly out of your control, and while the game is hard initially yes, that’s part of the enjoyment. The whole game’s system is built off of you overcoming disadvantageous odds, which makes victory more sweet and giving units the opportunity to carve their own path and make clutch plays/stories defending off 3 units etc. \n\nIf you want to see gameplay for Mordheim or informational content on it, I recommended checking out MercyTheMad on YT and/or Twitch. He doesn’t make videos on the game but he still streams this game on and off and is very informative, yet fun to watch. Also highly recommend lordramon2019 on Twitch as he has almost 8000 hours in mordheim, has hosted almost every PvP tournament for the game, and streams Mordheim a couple times a week. \n\nI never write reviews for games but seeing this one had mixed reviews, I had to say something.", "timestamp_created": 1737136780, "timestamp_updated": 1737136780, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.540069699287414551", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185763637": {"recommendationid": "185763637", "author": {"steamid": "76561199174487792", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 398, "playtime_last_two_weeks": 269, "playtime_at_review": 398, "last_played": 1736737298}, "language": "english", "review": "quite fun", "timestamp_created": 1737095005, "timestamp_updated": 1737095005, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185690045": {"recommendationid": "185690045", "author": {"steamid": "76561198066375615", "num_games_owned": 0, "num_reviews": 27, "playtime_forever": 3361, "playtime_last_two_weeks": 2880, "playtime_at_review": 2144, "last_played": 1737410930}, "language": "english", "review": "Give a man a fish, and you feed him for a day. Give a man a rat, and you satisfy his rat desire. And this game gives you PLENTY of rats. No complaints, easily top 3 Skaven experiences of all time.", "timestamp_created": 1737002486, "timestamp_updated": 1737002486, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185670207": {"recommendationid": "185670207", "author": {"steamid": "76561198059532313", "num_games_owned": 353, "num_reviews": 395, "playtime_forever": 635, "playtime_last_two_weeks": 635, "playtime_at_review": 509, "last_played": 1737132425}, "language": "english", "review": "I'm Sean Prime and I approve of this game!", "timestamp_created": 1736975034, "timestamp_updated": 1737062101, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185648357": {"recommendationid": "185648357", "author": {"steamid": "76561198108816849", "num_games_owned": 95, "num_reviews": 3, "playtime_forever": 13505, "playtime_last_two_weeks": 6097, "playtime_at_review": 11308, "last_played": 1737410908}, "language": "english", "review": "As this is the only PC representation of the famous TT game, you aren't spoilt for choice, and therefore need to accept the flaws if you wish to enjoy Mordheim on PC. \n\nThe graphics are more than adequate for a game of this vintage, and as an adaptation of the TT rules, whilst not perfect, it does allow quite a representative experience for the PC gamer. The flaws, however, render it incredibly frustrating and virtually unplayable without a signifcant amount of good luck, or endless re-examinations of tactical choices on a per-turn basis.\n\nIt's damn hard at early levels. \n\nThe main flaw is that the AI is utterly brutal. You can't even choose to opt for a low to moderately intelligent AI as you become acclimatised to the setting or familiar with the tactics......the AI is also uncannily lucky in crunch situations that skew results very much in itsfavour. With all the hours I have wasted in the game, I have one warband that has actually survived to rank 10, and every single other one has been deleted due to crippling loses and injuries - no matter the Warband, or how conservatively I play them. A secondary, but notable flaw is that the economy is very much either feast or famine.....you either have enough GC to render any purchase or skill training inconsequential, or you're perpetually struggling for gear and training, which puts your warband even further on the back foot. \n\nThis leads us to the other flaw - the Undead are, by far, the most powerful Warband at early levels. Never mind their propensity to peak after rank 8 or so, they allow you to consistently accomplish misisons without the loses other WBs experience, so my the time they do peak, you're in a position to bolster their strengths to the point that they remain S-tier.  Terror and Fear are incredibly powerful traits for your warband to deal with and aside from the units that are immune to psychology, you'll be lucky to survive to higher levels when the training of skills and spells makes a difference. \n\nIf you buy the base game, Globadiers (probably the most powerful Heroes in that they can add healing and crippling debuffs) and the Undead DLC you'll probably have fun. Otherwise, no matter what the various guides might opine, it's a frustrating and ultimately unenjoyable experience until you survive a to moderate ranks, at which point the difficulty curve diminishes. ", "timestamp_created": 1736951778, "timestamp_updated": 1737101978, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185568975": {"recommendationid": "185568975", "author": {"steamid": "76561198144911345", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 28138, "playtime_last_two_weeks": 1156, "playtime_at_review": 27915, "last_played": 1737022854}, "language": "english", "review": "I wholeheartedly recommend this game!\n\nThe negatives of this game are the minor bugs it has (at least for me), a low player count, repetitive gameplay, and what looks to be no updates and support. There is also sometimes genuine heartbreak when losing a character or having them injured to the point where their main strengths are negated. There is one story mission for the Chaos cult faction that is nearly impossible but that's just one mission for one faction.\n\nThe positives are that the gameplay is addictive, challenging, and well thought out. The atmosphere created by the music and visuals are on point. The factions are fun and unique (still wish there were more). You can play the game very simply and do okay or you can min/max and strategize to your hearts content. You have a lot of choices both in a match and out of one. The developers also made the most of the maps that exist so it rarely feels like it's the same experience over and over again.\n\nI love turn-based strategy games and this one allows for so much customization, gameplay options, and ultimately playability. Don't get me wrong, the game can be punishing, especially in the early game when your warband is weak and you don't know what you are doing. But it is so rewarding leveling up your own little squad as they venture into the hellscape that is Mordheim! I do recommend all of the DLC (extra factions and characters) to give yourself as many options to play the game as possible. I got it for quite cheap on sale so would recommend doing the same.", "timestamp_created": 1736851622, "timestamp_updated": 1736851622, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.54314720630645752", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185511256": {"recommendationid": "185511256", "author": {"steamid": "76561198112017383", "num_games_owned": 164, "num_reviews": 12, "playtime_forever": 78, "playtime_last_two_weeks": 78, "playtime_at_review": 78, "last_played": 1736775140}, "language": "russian", "review": "Интересная задумка, прикольный визуальный стиль, но вот все остальное оставляет желать лучшего. Вот прям совсем убого. Теряешь ходы не потому, что рукожоп, а потому, что карта максимально всратая, архитектура уровней убогая, зато противник абсолютно всегда, даже на первых уровнях, знает твое местоположение. К сожалению, не стоит и покупать, даже по скидке. Не тратьте время на это убожество.\nТактикой здесь не пахнет. Помните рандом 95% в упор в голову в X-COM? Ребят, я после ВОТ ЭТОГО я реально поверил, что в коме были 95%. Механика боев убита вусмерть. Нет, не так. Она даже не успела зачаться, когда её убили, абортировали, сделали из нее монстра Франкенштейна, засунули в мать, случайно убили снова, родили и снова сделали монстра, но даже тогда все, что она могла - истошно верещать и конвульсивно дергаться в потугах. \nПопытки поиграть в это убожество сравнимы разве что с попытками засунуть себе в очко кактус с пустынь Америки. Бессмысленно, больно и неприятно. Игра ставит тебя раком не потому, что она сложная (привет, Darkest Dungeon, ты все еще в сердечке, когда-нибудь мое очко перестанет полыхать и я к тебе вернусь), а потому, что это убожество пытается быть игрой, но кривое как мой пипидастр (а сейчас привет кривой порт на ПК первой Dark Souls). Здесь мобы сильнее тебя заведомо. И не потому, что ты рукожоп, а потому, что ты ФИЗИЧЕСКИ не мог оказаться сильнее них. Не тратьте нервы на эту срань, пусть я потрачу свое время вместо вас. Поиграйте во все тот же X-COM или, на худой конец, Wartales, там пошаговость выполнена куда лучше.", "timestamp_created": 1736775280, "timestamp_updated": 1736775832, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185490094": {"recommendationid": "185490094", "author": {"steamid": "76561198832331470", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 602, "playtime_last_two_weeks": 602, "playtime_at_review": 273, "last_played": 1736899094}, "language": "english", "review": "Even the tutorials are fun!", "timestamp_created": 1736741881, "timestamp_updated": 1736741881, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478723406791687012", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185338436": {"recommendationid": "185338436", "author": {"steamid": "76561198179439371", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 30677, "playtime_last_two_weeks": 1987, "playtime_at_review": 28860, "last_played": 1737393851}, "language": "french", "review": "Un jeu très dur et très sévère mais quelle satisfaction quand on gère !... Il aurait fallut encore plus de mode histoire.", "timestamp_created": 1736592487, "timestamp_updated": 1736592487, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185313589": {"recommendationid": "185313589", "author": {"steamid": "76561198007900266", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 9779, "playtime_last_two_weeks": 82, "playtime_at_review": 9779, "last_played": 1736498935}, "language": "english", "review": "Turn based strategy game with a pretty harsh experience.  Despite that, the atmosphere is pretty good, the factions all feel unique, and the gameplay is  fun, but it can be a bit of a frustrating experience with some of the mechanics.  Dodge chances can get 60%+, so you have rounds of misses.  Also the DLC factions, specifically the undead, feel way overpowered compared to the base factions.  It's a good game for the price and I got a lot of fun out of it.", "timestamp_created": 1736565587, "timestamp_updated": 1736565587, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185194965": {"recommendationid": "185194965", "author": {"steamid": "76561197992294844", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2262, "playtime_last_two_weeks": 1580, "playtime_at_review": 1169, "last_played": 1737410255}, "language": "swedish", "review": "Bullshit RNG for hit chance, just like XCOM.", "timestamp_created": 1736442779, "timestamp_updated": 1736442779, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184520790": {"recommendationid": "184520790", "author": {"steamid": "76561199211671413", "num_games_owned": 0, "num_reviews": 16, "playtime_forever": 5111, "playtime_last_two_weeks": 0, "playtime_at_review": 4721, "last_played": 1735867365}, "language": "english", "review": "I LIKE THE GAME I PLAY ON ANS OFF FOR A LONG TIME BUT OMFG IT TAKES SOOOOOOOOOOOOOO LONG TO WIN AND IF U RUSH U CAN EASY KILL YOUR GUYS OFF THAT U BIN WORKING ON FOR A LONG TIME,U FEEL LIKE U R KILLING TIME .I STILL SAY TO PLAY IT BUT MAN ITS HARD SOME TIMES IF U WANT TO PLAY U R GOING TO BURNTIME", "timestamp_created": 1735816472, "timestamp_updated": 1735816472, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478723406791687012", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184298788": {"recommendationid": "184298788", "author": {"steamid": "76561199480742021", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 214, "playtime_last_two_weeks": 0, "playtime_at_review": 45, "last_played": 1735638524}, "language": "english", "review": "I've played this game for a long time before purchasing this on steam. however it seems that a lot of the negative reviews are from people that apparently just immediately jumped into a match without looking at what the game is about. yes, there is rng, but its entirely manageable if you actually read what stats do, and how different units/ factions play. read what skills do by hovering over them. you'd be surprised at how often the units come equipped with a weapon that will straight up not be good for them. its up to you to properly equip your dudes.\nas for those complaining about the difficulty. the whole point of the game is that its a hardcore simulation of sending your dudes into fantasy chernobyl to collect uranium. your going to have casualties. and its going to suck when your beloved henchman that was with you from day 1 gets his legs ripped off by a chaos spawn and dies. but baby thats just mordhiem\n\ntldr: those complaining about the game didnt prepare for a hard game, and need to gitgud. 10/10 infinitely better than necromunda", "timestamp_created": 1735627935, "timestamp_updated": 1735627935, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.662593424320220947", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184152890": {"recommendationid": "184152890", "author": {"steamid": "76561198864343952", "num_games_owned": 369, "num_reviews": 24, "playtime_forever": 6861, "playtime_last_two_weeks": 0, "playtime_at_review": 4438, "last_played": 1736166611}, "language": "english", "review": "Clunky, buggy, unbalance, but addictive hell. Shame there was no part two for this game.", "timestamp_created": 1735505807, "timestamp_updated": 1735505807, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478723406791687012", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184073692": {"recommendationid": "184073692", "author": {"steamid": "76561198073147525", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 4468, "playtime_last_two_weeks": 0, "playtime_at_review": 3588, "last_played": 1735869286}, "language": "english", "review": "DO NOT WASTE A SINGLE DOLLAR ON THIS PIECE OF TRASH!!!!!!!!!!!!\n\nEver wish you played a game that made you want to bang your head against a brick wall until your ears bled, or have you wondering why you even thought to purchase within the first five minutes of play time? Welcome Mordheim, the game that's literally coded to fuck the player over. This game is so fucking bad it should be removed and banned from not only the steam marketplace, but any marketplace. \n\nThere are so many core mechanics that this game does such a shit job of explaining you'll be left with multiple playthroughs doomed for failure. Just bought a new hero and equipped him with gear for a better chance of survival? why the actual fuck would you do that in a game like this. In the very next mission he'll spawn in all alone completely surrounded by the enemy warband. only to be immediately slain within the first two rounds and completely stripped of that gear and even better the game will force you to watch practically mocking you. \n\nWhile the spawns being absolute dogshit might be frustrating, that's nothing compared to the story missions. You'll be forced to either watch guide vidoes beforehand, or you'll just have to play them several times before you can actually beat them. Why you ask? Are they truly that difficult? That's not it at all. Remember those so called \"mechanics\" I mentioned earlier? There are access points which can be blocked by a character being too close to them which is one of the easiest ways to cheese the ai. However, in some mission certain npc's are spawned within an ambush range of these access points as though they were meant to block it to keep the player from sending back up when needed. Any player will feel more ripped off at each an every loss than actually feel as though they were strategically challenged. \n\nIt's clear within the first few hours of playings this piece of dogshit that the morbid fuckheads of a dev team spent more time making the atmosphere grotesque and obscene to look at then they did fleshing out the core mechanics of the game. I've literally seen less intentionally developed exploits in games designed by a single person(kenshi) than this piece of shit. \n\nDon't even get me started on the RNG. Quite literally every aspect of the game is RNG. Want decent gear from the store? RNG. Want a chance to survive and hoping for decent spawns? don't fucking kid yourself. I've had my units hit more with a \"lower chance\" than with 80%+. I understand the dev team was trying to simulate a boardgame, but holy shit at least make the in game percentages somewhat accurate. Even a 12 year old has a better concept of accurate percentages than the braindead idiots who shat this out. \n\nI couldn't even recommend downloading this trash if it was free. Don't even waste a single mb of memory on this shit, because you'll surely regret it. \n\nThe saddest part is the fact that this was produced by warhammer, a AAA gaming studio. It's even been out for years. Did they release any patches fo fix the controls on pc, the dogshit RNG, or characters clipping on a 2 inch change in elevation, surely not. Do the world a favor and take this pathetic shit off the market. One of the worst games I've ever wasted my time on. Absolutely pathetic attempt at a video game.\n\nThis game is so poorly done a single person couldn't compile all of it's flaws into a single review. One of the worst aspects of the game is how the dev's essentially coddled their broken ai. The npc's don't even appear to have the simplest of path finding. The get caught on terrain, lose units in buildings, and half the time can't even access access points such as jumping areas or portals. Because of this they're given an unfair advantage over the player. You can play a game perfectly and still lose because of this. Missing attacks over and over again all while the npc's uncannily land all of theirs. It's an absolute joke. And Apparently the dev team didn't think it should be possible for players to win the majority of their missions. Win a few in succession and the missions available become harder. I've gone from running a few normal difficulty missions successfully to only being able to find brutal or deadly missions even when scouting for more. Playing this game is like trying to play monopoly with a tyrannical toddler. There's truly no point to any of it. Either way the player is losing.\n\nThis is coming from someone who just tried to enjoy the damn thing. I've played on both console and pc and have walked away from both after just a couple playthroughs not even making it past the fourth or fifth campaign mission. Also those who say the controls are better for controllers have clearly never played with one. The menu system is an absolute cluster cuck to navigate with a controller and no matter what there's apparently no fixing the clunky af combat option system. The game will go from defaulting an attack option only to immediately jump to flea after the player exhausts their offence points time and time again. It will always present the worst defense stance first and the best feature of this is that if you misclick and select the wrong option there's no going back. The damn piece of shit immediately autosaves your decision or really mistake. Be ready to read every option very carefully and take your time to make a selection or it could mean that you just lost your warband. This game is more a test of patience than a battle of wits.\n\nI've personally lost multiple missions in row not because I played horribly, but because of the pathetic attempt at RNG. This piece of shit of a game is so fucking bad it has to be the worst game I have ever played. Steam take this pathetic piece of shit of your market. It's worse than most early access games even with all their bugs and glitches.", "timestamp_created": 1735457644, "timestamp_updated": 1735731060, "voted_up": false, "votes_up": 4, "votes_funny": 10, "weighted_vote_score": "0.276079058647155762", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184073615": {"recommendationid": "184073615", "author": {"steamid": "76561198092225878", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 921, "playtime_last_two_weeks": 0, "playtime_at_review": 828, "last_played": 1735463011}, "language": "english", "review": "Good value for money", "timestamp_created": 1735457559, "timestamp_updated": 1735457559, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.478723406791687012", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184014768": {"recommendationid": "184014768", "author": {"steamid": "76561198413172089", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2253, "playtime_last_two_weeks": 0, "playtime_at_review": 517, "last_played": 1736111193}, "language": "english", "review": "Excellent Warhammer game. Authentic atmosphere and and threat. Its also a faithful representation of the tabletop game of the the same name which was discontinued ages ago but is more popular now than when it was released! If you love Warhammer Fantasy you will love this!", "timestamp_created": 1735410280, "timestamp_updated": 1735410280, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.54314720630645752", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183875775": {"recommendationid": "183875775", "author": {"steamid": "76561198074498369", "num_games_owned": 216, "num_reviews": 85, "playtime_forever": 3887, "playtime_last_two_weeks": 0, "playtime_at_review": 3354, "last_played": 1735566998}, "language": "english", "review": "It shows its age but still really fun. Suffers from the \"controls made for consoles\" curse and as such has terrible controls. :P", "timestamp_created": 1735305871, "timestamp_updated": 1735305871, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.493278175592422485", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183858888": {"recommendationid": "183858888", "author": {"steamid": "76561198164102974", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 6061, "playtime_last_two_weeks": 2895, "playtime_at_review": 1236, "last_played": 1737409821}, "language": "spanish", "review": "Es estrategia por turnos, permite customizacion de personajes y lo mejor, la derrota se siente, da gusto tomar decisiones asi.", "timestamp_created": 1735290126, "timestamp_updated": 1735290126, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183721137": {"recommendationid": "183721137", "author": {"steamid": "76561198025314047", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3783, "playtime_last_two_weeks": 0, "playtime_at_review": 2644, "last_played": 1736133997}, "language": "english", "review": "If it crashes on opening, it may be because you are using a wireless mouse or keyboard. I used a plugin mouse instead, and it hasn't crashed since.", "timestamp_created": 1735190887, "timestamp_updated": 1735190887, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 5576, "total_negative": 2358, "total_reviews": 7934}, "cursors": {"AoJ4p+WIypADcPuHhgU=": "Mon Jan 20 17:24:08 2025"}}
