{"reviews": {"185877904": {"recommendationid": "185877904", "author": {"steamid": "76561198334767829", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 4993, "playtime_last_two_weeks": 1, "playtime_at_review": 4993, "last_played": 1737219919}, "language": "english", "review": "Playing Toukiden 2, i felt like i was finally home, a place where i belonged, if only there was a continuation to such an amazing game and franchise.", "timestamp_created": 1737223874, "timestamp_updated": 1737223874, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185014051": {"recommendationid": "185014051", "author": {"steamid": "76561197992589486", "num_games_owned": 0, "num_reviews": 72, "playtime_forever": 5883, "playtime_last_two_weeks": 1650, "playtime_at_review": 5882, "last_played": 1737348175}, "language": "english", "review": "Toukiden (TKD) 2 is a decent monster hunting game that has a good story, fast paced action, less tedium and just as grindy. In this game, you hunt Onis, rip their parts off (and gloat), only to realize that they've suddenly become even more dangerous!\n\nTKD2 has a compelling story and its storytelling is well executed. This is supported by a cast of likeable characters and great voice acting (Jap dub only) that kept me wanting to see more of it - imo, the biggest strength of the game. The story can feel short if you focus on main quests, so it's better to mix in with side quests. TKD2 uses an open world which features a day/night cycle (mostly immersion, though some side quests require to be in nighttime) and is littered with inscriptions (textual story fragments) and crests (collectables) to encourage exploration. Also, the home hub is an impressively big village which is unfortunately only really relevant during story progression. You can explore the open world with up to 3 additional AI companions and they are very competent. In fact, perhaps too much so because they will most likely carry you throughout your early-to-late single player experience; they will even pick loot for you! One annoyance I have is that there are a few translation errors and there are no subtitles for the things your companions say (when out in the open world), making it impossible to understand if you don't know Japanese. It's also a shame that the open world aspect of the game only applies to single player and not multiplayer. For the latter, it's still the traditional lobby system like most other games. The character creator is decent and looks to be the same as those used in other musou games like Samurai Warriors, but with more options.\n\nCompared to other games in the same genre like Monster Hunter (MH) or God Eater (GE), the game takes away a lot of the tedium of hunt preparation as there are no consumables to prepare. Instead, their effects are implemented as skills in 11 collections, referred to as \"playstyles\" (known as \"ATK\", \"PLN\", etc in-game). Each playstyle consists of 4 skills (mapped to the face buttons of the gamepad) with one of them always being a self-heal. As such, the playstyle defines what skills you can use and each skill has limited use (and cooldown) which can only be restocked at designated points on the map. Playstyles loosely define what you bring to your party, for e.g., better at destroying parts, able to taunt or able to AoE heal. The main attraction of this game compared to its competition is the ability to tear off Oni parts and boy is it gratifying to do so! What's interesting is that destroying different Oni parts will alter its move sets, making it more interesting and challenging to learn its moves. There's (most of the time) clear wind up before big attacks and it's still important to recognize them as your own big attacks have commitment and you also have limited healing. That said, I find that many monsters have really OP bullsh*t moves that I don't really enjoy fighting.\n\nTKD2 uses the Mitama (\"honourable spirit\") system to make builds and it's interesting. In a nutshell, you can have 3 mitamas and every mitama has its own list of passive abilities known as \"boosts\" where you can pick 3 (from each mitama) for a total of 9 boosts per build. Some of these boosts are weapon-specific, working like traits, while others improve stats or improve playstyle-specific skills. Mitamas are unlocked by playing the story mode, side quests and hunting specific Onis; they also need to be \"levelled up\" in order to unlock their boosts. In total, there appears to be as many as 200 mitamas in the game (excluding DLCs). Every mitama is tied to a playstyle and time period. Depending on the slot they are equipped, the player gains a set of additional evade and attack skills that is dictated by the playstyle of the mitama. Also, when using mitamas from the same period (or hidden historical relationship), you also gain combination boosts. There's a fair amount of thinking needed for finding optimal mitama choices to build synergies which is where the depth of build-making is primarily at. Unfortunately, there's no option to show damage numbers and there are no training dummies to test changes. Although you can see health bars of the Onis, it's hard to know objectively whether you're doing better damage when fiddling with setups. Another thing to note is that there's only few resources online which will pose a challenge when min-maxing your gear/mitama setups.\n\nThe game has a good selection of 11 weapons which are technical though not quite at the level of MH but definitely more compared to GE; they also feel less weighty but I feel it's because controller vibration during player actions feels non-existent. There are in-game tutorial missions for all 11 weapons which does a serviceable introduction but the advanced stuff will require exploration. The weapons all play very distinctly, and using them do require mastery because you can't just spam-to-win unless your gear outlevels the Oni (which some of the spammy moves might suggest). Interestingly, quite a number of weapons allow you to do airborne combat in order to hit the hard-to-reach places and some monsters are very tall. Overall, I think TKD2 strikes a nice balance between visceral and deliberate combat which works reasonably well on small and big monsters. In comparison, MH's combat works for large monsters, but feels unsatisfying for small ones.\n\nIn terms of the presentation, the graphics still hold up imo, even if they aren't the best. The color palette, however, is a tad too washed-out for my liking. The music is apt and suitable but I haven't found any strong tracks that caught my attention. The UI and control scheme could be better although it's not terrible. For example, it's hard to find things on a list because you can't sort alphabetically - even though you can sort in other ways. It also doesn't make very good use of the DPad for control scheme, like using it for rotating 3D model when previewing gear.\n\nPerformance-wise, this game runs great and I've not got a single crash (except one instance of suddenly very long loading which I closed the game and restarted). However, this port is a mixed bag although it's far from a bad one. For one, it doesn't have borderless window mode which is an inconvenience and doesn't allow you to remap controls on the gamepad. While I've never played with keyboard/mouse, it doesn't seem like it would work very well with mouse. It also always launches with its configuration tool which can be bypassed but requires additional manual work/research on your part.\n\nOverall, despite some of my gripes, I strongly recommend TKD2, especially for players who like monster hunting as an offline or JRPG experience. However, I'd recommend getting this game only when on sale (which, admittedly, is rare) as I don't think it has a reasonable asking price for such an old title. I really hope Koei Tecmo will continue this series in future as it has pretty good fundamentals down. I think with a bit more polish to its weapon and combat mechanics (like adding more counterplay), the TKD series can become a serious competition to the MH series. But perhaps I compare TKD too much with MH (the gold standard) because with TKD2, it's really become is its own thing and sets itself apart from the others in the genre, like MH and GE.\n\nPSA: There are free DLCs available for the game which are not listed on the store page. You can search \"toukiden 2\" in the store and add them to library. There's also an online manual showing what the game has to offer at [url=https://www.koeitecmoamerica.com/manual/toukiden2/ps4/en/index.html]https://www.koeitecmoamerica.com/manual/toukiden2/ps4/en/index.html[/url].", "timestamp_created": 1736252267, "timestamp_updated": 1736698910, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184428807": {"recommendationid": "184428807", "author": {"steamid": "76561198088430137", "num_games_owned": 0, "num_reviews": 58, "playtime_forever": 21, "playtime_last_two_weeks": 0, "playtime_at_review": 21, "last_played": 1735738117}, "language": "schinese", "review": "It is very good game.  happy UP", "timestamp_created": 1735738195, "timestamp_updated": 1735738195, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184112291": {"recommendationid": "184112291", "author": {"steamid": "76561199401302002", "num_games_owned": 15, "num_reviews": 6, "playtime_forever": 338, "playtime_last_two_weeks": 0, "playtime_at_review": 310, "last_played": 1735722210}, "language": "english", "review": "my memories in toukiden kiwami love ouka\r\n", "timestamp_created": 1735488962, "timestamp_updated": 1735488962, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.522058844566345215", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184065917": {"recommendationid": "184065917", "author": {"steamid": "76561198310660421", "num_games_owned": 180, "num_reviews": 29, "playtime_forever": 2141, "playtime_last_two_weeks": 234, "playtime_at_review": 551, "last_played": 1736245180}, "language": "english", "review": "still in the early stages but based off what ive seen so far its really good and alot of fun. the weapons playstyles are fun and diverse and a good amount of freedom with build choice. some cool mechanics and the story is surprisingly decent", "timestamp_created": 1735449909, "timestamp_updated": 1735449909, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183687430": {"recommendationid": "183687430", "author": {"steamid": "76561199519481807", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 328, "playtime_last_two_weeks": 54, "playtime_at_review": 272, "last_played": 1736710040}, "language": "brazilian", "review": "o jogo e otimo mas podia ter uma resolucao mais alta", "timestamp_created": 1735159561, "timestamp_updated": 1735159561, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183665490": {"recommendationid": "183665490", "author": {"steamid": "76561198845944014", "num_games_owned": 214, "num_reviews": 41, "playtime_forever": 70, "playtime_last_two_weeks": 0, "playtime_at_review": 70, "last_played": 1735011849}, "language": "brazilian", "review": "Não comprem Toukiden 2, Port cheio de incompatibilidades, jogo não abre em tela cheia, só em janela, se der alt+tab não da pra jogar com o teclado, toda vez q vc aperta em alguma tecla do teclado o jogo minimiza, só da pra jogar com controle.", "timestamp_created": 1735143607, "timestamp_updated": 1735143607, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 1119, "total_negative": 279, "total_reviews": 1398}, "cursors": {"AoJwiIWHs/kCc9LX3gI=": "Mon Jan 20 19:32:11 2025"}}
