{"reviews": {"185981036": {"recommendationid": "185981036", "author": {"steamid": "76561197987967870", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 2023, "playtime_last_two_weeks": 2006, "playtime_at_review": 2023, "last_played": 1737329731}, "language": "english", "review": "A very fun little game. A lot of combat, maybe even a little excessive, but it is quite enjoyable for the relatively short duration of the game. One of the few games I have seen where you get to pilot a huge spaceship and take part in big space battles without killing your computer.\r\n\r\nThe only downside is that there is little to no incentive to replay the game. The combat and progression are only enjoyable for one playthrough. Dialogues are very linear to the point you are just pressing a continue button. Story is very basic, most conversations not very interesting, but it is acceptable. Still a better love story than Baldur's Gate 3.\r\n\r\nEngine impaired/10, it is pretty good", "timestamp_created": 1737330687, "timestamp_updated": 1737330687, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185691032": {"recommendationid": "185691032", "author": {"steamid": "76561198392975536", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2215, "playtime_last_two_weeks": 2215, "playtime_at_review": 2215, "last_played": 1736989801}, "language": "english", "review": "It's a very nice little game.\r\n\r\nThe story itself is short, but the corner of the galaxy you're in has its charm, with well voice acted character, excellent soundtracks (which you can customize. Personally I went with Cowboy Bebop), and very beautiful graphics that renders space and spaceships spectacularly well.\r\n\r\nWhere Rebel Galaxy truly shines is its gameplay loop. It is basically a progression to the top, looking for better guns to put on bigger ships with thicker shields. The progression isn't all vertical though.\r\nI had much fun getting right behind bigger ships with my more manoeuvrable corvettes and drilling their hull where they couldn't blast me. Or escaping swarms of fighters, only to slow down a bit and snipe a few before fleeing again.\r\nAdditionally, while it wasn't my desire, you can very well roleplay as a more civilian entrepreneur, mining and trading enormous hauls to sell where the market is best. Combat is still very much an important factor, but you don't need to be a military dreadnought to roll over would be pirates.\r\n\r\nSo skill and style of gameplay have their place.\r\n\r\nPiloting a ship can be a bit strange at first, but the game ease you into it. It is on a 2d map, meaning you'll never have to manage the verticality, except for some fighters who fly all over the place, but automated turrets knows how to reach them.\r\n\r\nAs for the difficulty, do not worry too much. If you reach the limit of your skill, the game rewards patience and diligence. Do some missions, earn your money on a more manageable system, and then buy yourself a better equipment. It will make all the difference. By the end, I had the biggest ship fully upgraded, a flat death star, and only in the most dire situation did I need to manoeuvre a bit. Otherwise, I just had to be there, and rotate a bit for everything to explode around.\r\nIf you do missions though, nI recommend not taking any escort missions. The AI can be frustrating on several levels.\r\n\r\nFinally, the story.\r\nIt is short, but sweet. I was really hoping the end wasn't the end, the story of this weird chasing of mysterious artefacts with half the badlands gunning for us made me smile. I grew attached to the characters introduced (that I didn't kill for being double-crossing pyjacks), and I can only wish there would be more of them.\r\nBut it is just an adventure, with its heights, its doubts, its dangers, and in the end, its goodbyes.\r\n\r\nAll in all, a good game for a few hours of fun. And perhaps to return to once in a while.", "timestamp_created": 1737004163, "timestamp_updated": 1737004163, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185433184": {"recommendationid": "185433184", "author": {"steamid": "76561198987714565", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1515, "playtime_last_two_weeks": 1515, "playtime_at_review": 1515, "last_played": 1736606160}, "language": "hungarian", "review": "Nagyon pörgős és jó stori. A zene meg valami fantasztikus. Igaz, hogy régi, de érdemes nyomni vele pár órát.", "timestamp_created": 1736684343, "timestamp_updated": 1736684343, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185275594": {"recommendationid": "185275594", "author": {"steamid": "76561198044785009", "num_games_owned": 684, "num_reviews": 13, "playtime_forever": 630, "playtime_last_two_weeks": 630, "playtime_at_review": 102, "last_played": 1737079630}, "language": "english", "review": "This game is such a piece of shit when it comes to combat. Don't tell you anything about the mechanics of the game other then aim, or switching guns, but not anything about how you can prioritize aim targets. Doesn't tell you WHY or HOW to aim at targets, but is always willing to condescendingly tell you about the Defend option. Fuck you. Teach me how to play the fighting part of the game. AKA, THE GAME. \nWhat is the everloving point of this game being the rare one to allow sticker changes for controller choices for a game they didnt put the effort into teaching you how to play the core of. Fuck. What a waste of 100 minutes.", "timestamp_created": 1736530610, "timestamp_updated": 1736530610, "voted_up": false, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.442953020334243774", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185229432": {"recommendationid": "185229432", "author": {"steamid": "76561197998346537", "num_games_owned": 295, "num_reviews": 15, "playtime_forever": 2632, "playtime_last_two_weeks": 0, "playtime_at_review": 2632, "last_played": 1451969701}, "language": "english", "review": "Rebel Galaxy is an arcadey space game about how dope it would be if Assassin's Creed: Black Flag's ship combat were in space.", "timestamp_created": 1736482681, "timestamp_updated": 1736482681, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.579246759414672852", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185002299": {"recommendationid": "185002299", "author": {"steamid": "76561198098607010", "num_games_owned": 0, "num_reviews": 84, "playtime_forever": 984, "playtime_last_two_weeks": 16, "playtime_at_review": 967, "last_played": 1736260854}, "language": "english", "review": "too bad its not coop so you can play with a few friends n form fleets together?  also build n design different n better ships", "timestamp_created": 1736238191, "timestamp_updated": 1736238191, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184963480": {"recommendationid": "184963480", "author": {"steamid": "76561198052312081", "num_games_owned": 143, "num_reviews": 2, "playtime_forever": 9832, "playtime_last_two_weeks": 171, "playtime_at_review": 9719, "last_played": 1736384523}, "language": "english", "review": "This is a great game if you want to fly around in  a space shift do some trading, some mining, some light or major piracy. Sandbox space game where you don't need a friggin PHD aeronautics and a dang joystick to fly  around feeling like a awesome space captain. This makes space in this game on a level plain like a ship on the ocean I found it very enjoyable and fun. The game difficultly can be spiky and sometimes frustrating but learning this game is a blast and once you know you mostly know. I am really glad I brought this game and certainly got my moneys worth. Get the fault tracker early and mine.", "timestamp_created": 1736196871, "timestamp_updated": 1736196871, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184812617": {"recommendationid": "184812617", "author": {"steamid": "76561198823277652", "num_games_owned": 0, "num_reviews": 21, "playtime_forever": 785, "playtime_last_two_weeks": 10, "playtime_at_review": 699, "last_played": 1736778775}, "language": "schinese", "review": "一直在找类似浴火银河类的太空飞行游戏，这款游戏不错，操作简单舒适，射击音效优秀。", "timestamp_created": 1736060682, "timestamp_updated": 1736060682, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184791410": {"recommendationid": "184791410", "author": {"steamid": "76561197960934252", "num_games_owned": 659, "num_reviews": 20, "playtime_forever": 16, "playtime_last_two_weeks": 0, "playtime_at_review": 15, "last_played": 1736056870}, "language": "english", "review": "Will not recognise joystick no matter what I do. NXT Gladiator EVO. I tried editing the settings file like people say online. Doesn't work. Steam recognises the joystick, but the game refuses to.", "timestamp_created": 1736038614, "timestamp_updated": 1736038614, "voted_up": false, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.405252546072006226", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184479613": {"recommendationid": "184479613", "author": {"steamid": "76561198023858772", "num_games_owned": 0, "num_reviews": 44, "playtime_forever": 59, "playtime_last_two_weeks": 0, "playtime_at_review": 59, "last_played": 1735668137}, "language": "english", "review": "I'm a little surprised at how well this game was received.\n\nWonky, weird, bad controls, not fun.", "timestamp_created": 1735775572, "timestamp_updated": 1735775572, "voted_up": false, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.430735617876052856", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184450153": {"recommendationid": "184450153", "author": {"steamid": "76561198045864233", "num_games_owned": 0, "num_reviews": 56, "playtime_forever": 5392, "playtime_last_two_weeks": 0, "playtime_at_review": 5392, "last_played": 1701536681}, "language": "spanish", "review": "Rebel Galaxy es una aventura espacial que te pone en el asiento del capitán de una nave en un universo lleno de acción, comercio y piratería. Desarrollado por Double Damage Games, este juego te invita a explorar un cosmos vibrante mientras tomas decisiones que definirán tu camino, ya sea como comerciante, cazarrecompensas o un temido pirata. Con su estilo único y su enfoque en batallas espaciales al estilo naval, te ofrece una experiencia accesible y emocionante.\n\nAspectos positivos\nTe sientes en un universo único:\nDesde el momento en que empiezas, el diseño visual y la música de rock sureño te envuelven en una atmósfera que mezcla ciencia ficción con un western moderno. Cada estación espacial y cada rincón del universo te invita a explorar más.\n\nEl combate es táctico y emocionante:\nLas batallas en Rebel Galaxy no son como las de otros juegos espaciales. Aquí, te mueves en un plano bidimensional, lo que te obliga a pensar como si estuvieras comandando un barco en alta mar. Posicionar tu nave y usar tus torretas con precisión se convierte en una estrategia clave.\n\nTú decides cómo jugar:\n¿Quieres ser un comerciante honesto? ¿O prefieres la vida peligrosa de un pirata? La libertad que tienes para elegir tu camino hace que cada partida sea única y adaptada a tu estilo.\n\nPuedes personalizar tu nave a tu gusto:\nA medida que progresas, consigues naves más grandes y mejores, y puedes equiparlas con armas, escudos y módulos que se ajusten a tus necesidades. Esto te da un control total sobre cómo enfrentar los desafíos.\n\nLa historia está ahí si la quieres:\nRebel Galaxy te ofrece una narrativa interesante, pero no te obliga a seguirla. Si prefieres explorar y jugar a tu ritmo, puedes hacerlo sin sentirte presionado.\n\n Aspectos negativos\nEl movimiento puede sentirse limitado:\nAunque el combate bidimensional es único, puede que te sientas algo restringido si esperabas volar libremente en un entorno completamente tridimensional, como en otros juegos espaciales.\n\nAlgunas misiones se vuelven repetitivas:\nSi bien al principio las actividades son emocionantes, con el tiempo notarás que ciertas misiones, como los contratos de combate o comercio, pueden volverse algo monótonas.", "timestamp_created": 1735753800, "timestamp_updated": 1735753800, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184360434": {"recommendationid": "184360434", "author": {"steamid": "76561198102991281", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 8713, "playtime_last_two_weeks": 1867, "playtime_at_review": 8652, "last_played": 1736984976}, "language": "english", "review": "This game is so addictive. Working your way up and getting better gear is very fun. Very few ships feel useless, everything has it's pros and cons, some just more than others. I put a ton of hours into this game in a single week, it's honestly crazy.\n\nEdit: Not only is this is the first game I've ever  reviewed, it's also the first game I've played where I've gotten 100% of the achievements. Solid 9/10 for me.", "timestamp_created": 1735674312, "timestamp_updated": 1736983095, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184242446": {"recommendationid": "184242446", "author": {"steamid": "76561198282249708", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2414, "playtime_last_two_weeks": 0, "playtime_at_review": 337, "last_played": 1735949072}, "language": "english", "review": "****", "timestamp_created": 1735582795, "timestamp_updated": 1735582795, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.443875372409820557", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184233613": {"recommendationid": "184233613", "author": {"steamid": "76561197984577730", "num_games_owned": 155, "num_reviews": 2, "playtime_forever": 1530, "playtime_last_two_weeks": 0, "playtime_at_review": 471, "last_played": 1736134291}, "language": "english", "review": "I didn't know what I was buying when I got Rebel Galaxy.  I expected a dumb indie game.\n\nI was wrong.  Rebel Galaxy is simple in concept, but all the game mechanics come together to create a deeply immersive and compelling experience.\n\nPut simply, the game is a lot of fun... just pure fun.  It doesn't punish you, it doesn't make you grind, but you still feel you've earned everything you got.  It gives you purpose and meaning to everything you do which makes you want to fire it up randomly throughout your day.\n\nI highly recommend this game.", "timestamp_created": 1735576405, "timestamp_updated": 1735576405, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.608150482177734375", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183722044": {"recommendationid": "183722044", "author": {"steamid": "76561198186927322", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 2463, "playtime_last_two_weeks": 0, "playtime_at_review": 2463, "last_played": 1735191465}, "language": "english", "review": "I've tried and tried and tried to get into this game. I absolutely LOVE Rebel Galaxy Outlaw. It's one of my all-time favorite space games.\n\nLet me preface this with saying I never had a console growing up. I'm 45 now. The only gaming system I had was an Atari/Colecovision that belonged to my grandparents, and I only got to play when I visited them. I never got a Nintendo, never got a Sega or a N64 or PlayStation, etc. I played computer games a lot, though. Especially spaceship games. Those are my favorite. If you can look at my list of games on my profile, you can see that. So I never really learned how to play with a controller. I SUCK at games that make me use a gamepad. I just can't synchronize the camera with the movement, there's too many buttons, etc.\n\nI have 1,500 hours in Elite. I've got over 100 hours in Everspace 2 and RGO. I play tactical space games like Nexus the Jupiter Incident, Battlestar Galactica Deadlock, Battlefleet Gothic Armada 2, Homeworld, and a dozen other space combat dogfighting games. I'm not the best but I'm not bad at them, either.\n\nBut this game, dude. The controls are so freaking wonky, the camera is so bizarre, the combat so clunky and weird and hard to follow... I just can't recommend this game. I know it has massively loyal fans, and I understand why. The universe it's set in is great, it has a lot of style. Sort of like Firefly or other \"space westerns\". It has that feel, and I completely dig that.\n\nBut no matter how many times I've tried (and I've tried, I have 40 hours into this game), I still can't \"get\" it. The controls and the camera movements... I don't dig that.\n\nIf you think you might like it, try it. Go for it. It's pretty cheap at this point. I'm sure you can get it for just a few bucks when it's on sale. But I can't recommend it. Sorry to you hardcore fans, but this game and the way its meant to be played just isn't for me.", "timestamp_created": 1735191978, "timestamp_updated": 1735192080, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.507306873798370361", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183719459": {"recommendationid": "183719459", "author": {"steamid": "76561198115783568", "num_games_owned": 485, "num_reviews": 59, "playtime_forever": 913, "playtime_last_two_weeks": 0, "playtime_at_review": 913, "last_played": 1686254653}, "language": "english", "review": "Fun Spaceship Broadside simulator with a good country metal soundtrack.\nPros: Simple, can play literally whenever, pretty fun (played mostly offline, actual hrs are around 100 over 2 playthroughs)\nCons: Simple: feels grindy at times; cant move vertically, mining is obviously almost never worth it, nor is trading", "timestamp_created": 1735189003, "timestamp_updated": 1735189003, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.518518567085266113", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 6824, "total_negative": 1188, "total_reviews": 8012}, "cursors": {"AoJ4t6nwk44DeNWm4wQ=": "Mon Jan 20 13:49:02 2025"}}
