{"reviews": {"185905804": {"recommendationid": "185905804", "author": {"steamid": "76561198041001540", "num_games_owned": 0, "num_reviews": 199, "playtime_forever": 227, "playtime_last_two_weeks": 0, "playtime_at_review": 227, "last_played": 1545789675}, "language": "brazilian", "review": "F1 2017: mostrando que o melhor jogo de F1 pode, sim, ficar ainda melhor:\n\nQue Jogão !!!!\n\nA Narração:\n\nSubida da Beau Rivage. Pé embaixo, terceira, quarta marcha. Quinta. Sexta. Na aproximação da Massenet o carro está a 250 km/h a uns 30 centímetros do guard-rail à direita. Reduz para a quinta, quarta, brigando para trazer o fórmula para dentro da curva. Puxa a terceira, a sinfonia do motor Honda ecoa pelas ruas de Monte Carlo, aguda no corte de giro, mas o carro aponta direitinho para a tangência e aí a aceleração é retomada para contornar o cassino e descer em direção à Mirabeau.\n\nPoderia ser a descrição do famoso vídeo da volta voadora de Ayrton Senna a bordo da lendária McLaren MP4/5B, mas era eu, no conforto de casa no último sábado, tentando recriar uma das cenas mais icônicas da Fórmula 1. É disso que se trata F1 2017: uma experiência. Uma experiência grandiosa, completa e emocionante.\n\nUma experiência que, se já era quase perfeita na versão 2016, mostrou que não há estúdio no mundo mais digno de estar responsável pela franquia oficial da categoria máxima do automobilismo do que a Codemasters, que vem evoluindo de forma consistente desde F1 2015, dando um passo de cada vez.\n\nO novo título da franquia traz tudo no que seu antecessor acertou – e recicla mesmo, na cara dura –, mas mostra também que essa decisão foi tomada para permitir que os desenvolvedores pudessem focar no que realmente interessava: em vez de mexer no que estava bom, eles criaram conteúdos que deixaram tudo ainda melhor.\n\nPortanto, senhoras e senhores, fãs ou não de F1, liguem seus motores: é hora de descobrir por que F1 2017, sem dúvida alguma, tomou para si a coroa de melhor jogo da Fórmula 1 de todos os tempos.\n\n\nVocê, piloto de Fórmula 1:\n\nQuem dedicou algumas dezenas (quando não centenas) de horas no modo carreira de F1 2016 já sabe o modus operandi da coisa toda: você escolhe um avatar, coloca seu nome, customiza seu capacete, escolhe seu número e aí tem que decidir em qual equipe vai começar a correr: as menores têm menos expectativas, mas também são bem mais desafiadoras para conseguir resultados, enquanto as grandes oferecem um carro melhor, mas a pressão por um bom desempenho é bem maior.\n\nO que antes era só mais uma parte subutilizada em games de corrida se tornou uma peça fundamental não somente para progredir no jogo, mas para fazer de você um jogador melhor. Explico: originalmente eram três programas, o de aclimatação de pista, gestão de consumo de pneu e ritmo de classificação. Agora eles são acompanhados de mais dois: gestão no consumo de combustível e estratégia de corrida.\n\nNa aclimatação de pista, o piloto deve passar por uma série de pontos específicos a uma determinada velocidade. O intuito aqui é que você aprenda sobre o traçado ideal e o ritmo da pista.\n\nNa gestão de combustível, uma das novidades em F1 2017, você deve seguir o mesmo princípio do programa dos pneus, só que economizando o precioso líquido que move o seu carro. Isso é feito com uma técnica que consiste em soltar o acelerador e deixar o carro “rolar” na aproximação de uma curva.\n\n\nUm “quêzinho” de RPG:\n\nFalando sobre a parte de desenvolvimento do carro, especificamente, um grande avanço em relação ao F1 2016 é que ela está ainda mais complexa: em vez de só adquirir melhorias de forma progressiva em diferentes categorias, agora você tem uma árvore com diversas opções.\n\nSão quatro categorias: conjunto motriz (powertrain), chassis, aerodinâmica e durabilidade – e as melhorias são tanto nas peças quanto nas instalações da equipe, que permitem entregas mais rápidas de itens ou aumento de chances na obtenção de resultados melhores.\n\nSendo assim, você, enquanto piloto, pode decidir no detalhe o que deve ser aprimorado no carro. Caso não esteja disposto ou não entenda muito, existe um botão que sugere as melhorias para você.\n\n\nNovos carros, “nova” física:\n\nA jogabilidade do F1 2017, que pode ser considerado um “simcade”, passou por uma mudança em função das alterações nas regras de especificações dos carros para a temporada deste ano na Fórmula 1. Os carros ficaram mais largos, mais baixos, mais aerodinâmicos e mais rápidos. Essas características se tornaram bem perceptíveis no jogo: a aderência maior ficou bem evidente e a dinâmica do veículo mudou.\n\nNo entanto, tanto no volante quanto no controle, o game continua bem democrático e oferece uma ajuda considerável para aqueles que estão começando, graças às assistências, ou uma direção mais desafiadora para quem decide desligá-las. O acerto ainda tem uma contribuição significativa, mas, para aqueles que não entendem muito, os presets disponíveis já ajudam bastante.\n\nUm aspecto que continua muito acertado é a mudança provocada pelas condições climáticas dinâmicas – um exemplo bem claro (e óbvio) é que, com a chuva, você precisa adaptar sua condução para uma situação de aderência bem menor.\n\nOs carros clássicos também contam com um comportamento bem diferente entre si: modelos mais antigos são mais “chucros” de controlar, enquanto os carros da era eletrônica da F1, como a F2007, são verdadeiros foguetes guiados em trilhos.\n\n\nO som... Ah, o som!!!!\n\nMotivo de controvérsia na Fórmula 1, o som dos motores V6 turbo não são os mais populares. Ainda assim, a equipe de desenvolvimento continuou o ótimo trabalho feito nos dois jogos anteriores e conseguiu trazer com certa fidelidade a sonorização dos propulsores para dentro do game.\n\nCada um tem uma característica sonora diferente, assim como na vida real – que, você pode não gostar, mas pelo menos foram reproduzidos com qualidade.\n\nO destaque, no entanto, fica mais uma vez para alguns dos modelos antigos: ouvir o motor Renault V10 da Williams F18 ou o também V10 da Ferrari F2007 rasgando a reta de Monza é simplesmente espetacular.\n\n\n\nO novo melhor jogo de F1 da História: Vale a Pena Muito\n\nO game é uma evolução clara em relação ao seu antecessor: apesar de usar na cara dura o que já havia sido feito de bom, deixou claro que essa decisão foi tomada para priorizar a criação de mais conteúdo de forma a deixar o game ainda mais denso e oferecer, de fato, algo além do que havia sido feito até agora.\n\nA chegada dos veículos clássicos e as melhorias no modo carreira são adições muitíssimo bem-vindas e que enriquecem ainda mais a experiência, permitindo que o jogador tenha a oportunidade de viver eventos e situações que nenhum outro jogo da Fórmula 1 permitiu, pelo menos não com esse nível de flexibilidade e liberdade.\n\nPor outro lado, o aumento no nível de complexidade de algumas mecânicas do game pode afastar um pouco quem é mais casual. Alguns detalhes na parte sonora e gráfica, embora estejam longe de prejudicar a experiência, poderiam fazer o game ser mais grandioso do que ele já é.\n\nSe você gosta de Fórmula 1, em qualquer nível que seja, ou curte jogos de corrida de forma geral, a Codemasters acaba de complicar a sua vida ao fazer um título melhor que F1 2016 e que acaba de se tornar presença obrigatória na sua biblioteca de games.\n\nAgora que a barra de qualidade subiu mais um pouco, a pergunta volta: será que os desenvolvedores vão conseguir se superar de novo em 2018? Uma coisa é certa: F1 2017 oferece conteúdo e qualidade de sobra para manter a gente entretido até lá.\n\n\nPros:\n\n* Modo carreira evoluiu em relação ao F1 2016, ficando ainda mais denso e completo\n* Volta dos carros clássicos foi encaixada perfeitamente no contexto do game\n* Variedade ainda maior de modos de jogo\n* Visual levemente melhor graças a nova engine de iluminação\n* Jogabilidade democrática: ajuda os casuais e pode desafiar os entusiastas\n* Sons dos motores dos diferentes carros está com um nível excelente de qualidade\n* Excelente ambientação e imersão\n\n\nContras:\n\n* Falta uma trilha sonora marcante\n* Sistema de gestão de desgaste de peças pode ser complexo demais para quem é casual\n* Gráficos das partes \"fora do carro\" continuam meio defasados", "timestamp_created": 1737251561, "timestamp_updated": 1737251561, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525547444820404053", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185853323": {"recommendationid": "185853323", "author": {"steamid": "76561199133574831", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1265, "playtime_last_two_weeks": 851, "playtime_at_review": 1084, "last_played": 1737301426}, "language": "german", "review": "Es macht Spaß und die Kariere ist gut gemacht, aber die regeln sind zu streng", "timestamp_created": 1737202660, "timestamp_updated": 1737202660, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185445920": {"recommendationid": "185445920", "author": {"steamid": "76561199013802523", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 3494, "playtime_last_two_weeks": 1878, "playtime_at_review": 3494, "last_played": 1736689881}, "language": "finnish", "review": "Solid F1 experience, highly detailed and well optimized. Overall really enjoyable game to play through with good wheel support and driving physics, it's a shame it can not be purchased any longer.\nOnline multiplayer servers are gone, which means that some of the achievements are now impossible to obtain.", "timestamp_created": 1736695823, "timestamp_updated": 1736695840, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185293516": {"recommendationid": "185293516", "author": {"steamid": "76561198865353828", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 9813, "playtime_last_two_weeks": 1294, "playtime_at_review": 8863, "last_played": 1737382667}, "language": "english", "review": "gud", "timestamp_created": 1736545223, "timestamp_updated": 1736545223, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184253042": {"recommendationid": "184253042", "author": {"steamid": "76561198076264884", "num_games_owned": 102, "num_reviews": 47, "playtime_forever": 11221, "playtime_last_two_weeks": 0, "playtime_at_review": 11221, "last_played": 1550320268}, "language": "english", "review": "i loved the part when leclerc touched my ass", "timestamp_created": 1735590563, "timestamp_updated": 1735590563, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183991575": {"recommendationid": "183991575", "author": {"steamid": "76561198069567662", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 1840, "playtime_last_two_weeks": 0, "playtime_at_review": 1093, "last_played": 1735762519}, "language": "brazilian", "review": ".hghg", "timestamp_created": 1735395449, "timestamp_updated": 1735395449, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183929380": {"recommendationid": "183929380", "author": {"steamid": "76561198420135602", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1503, "playtime_last_two_weeks": 281, "playtime_at_review": 775, "last_played": 1737329861}, "language": "polish", "review": "Great game.", "timestamp_created": 1735342725, "timestamp_updated": 1735342725, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 5191, "total_negative": 753, "total_reviews": 5944}, "cursors": {"AoJwvKXFj4QDfvuE2wM=": "Mon Jan 20 19:25:57 2025"}}
