{"reviews": {"185647944": {"recommendationid": "185647944", "author": {"steamid": "76561198004826004", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 101, "playtime_last_two_weeks": 0, "playtime_at_review": 101, "last_played": 1706303923}, "language": "english", "review": "One of if not my favourite RTS game ever made.  It could use a bit of accessibility, or maybe a remaster, but the game design is so sophisticated and yet easy to understand.  Gameplay is very methodical and deliberate in a perpetual arms race, unlike most other RTS which rely on tension and chaos.", "timestamp_created": 1736951318, "timestamp_updated": 1736951318, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185498259": {"recommendationid": "185498259", "author": {"steamid": "76561198011078569", "num_games_owned": 329, "num_reviews": 13, "playtime_forever": 5457, "playtime_last_two_weeks": 3272, "playtime_at_review": 5457, "last_played": 1736724695}, "language": "polish", "review": "Fun from the past. The core gameplay still holds up pretty well.", "timestamp_created": 1736755857, "timestamp_updated": 1736755857, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183906684": {"recommendationid": "183906684", "author": {"steamid": "76561198075641037", "num_games_owned": 195, "num_reviews": 47, "playtime_forever": 35, "playtime_last_two_weeks": 0, "playtime_at_review": 35, "last_played": 1657586305}, "language": "english", "review": "Don't be fooled by the low amount of playtime i have on this account. I've spent countless hours playing both The Moon Project and Lost Souls before (on both CD and Steam) and i'm only reviewing this revision of the game cause those two are no longer available for purchase on Steam as of 2024.\n\nEarth 2150, the second installement of the Earth franchise is a mixed bag, for one part you got a strategy game set on a dystopian future where our planet is on its limit and we'll have to leave it soon, which is cool in concept but hard on execution to be original as there are plenty of games that have done this before and after, one in particular that comes to mind and reminds me a lot of this game is Warzone 2100, which also shares one of the core concepts of this game \"strategy by design\". \n\nWhat do i mean by this? You can choose how to design your own units, while in this game you have the base model already built, you can select which turrets to mount on it, so there's a slight sense of freedom on how you want to design your army. Want Spiders Mechs with Rockets? Sure. Tigers Mechs with Lasers? Okay. The only real restriction in comparison to the game i mentioned is that you can't select the type of traction the unit has, it's all bulit in by default alongisde its body.\n\nNow, there are a couple of restrictions on which units can or cannot use certain turrets, but it's not something that would really bother you in the long run. What would probably really bother you is the fact that all units consume ammo, and they must get a reload via air (for example, the UCS uses the Condor to reload their units). Luckily, turrets that are mounted on buildings (such as vehicle/weapon factories/airpads) or turrets (every kind including UCS bunkers), while they do technically consume ammo, they are instantly reloaded, so it's not a real problem. \n\nThe game features three distinct factions, the United Civilized States (UCS), based on the former United States and (i guess) its allies, the Eurasian Dynasty (EU), which is inspired by Soviet Russia and its allies, and the Lunar Corporation (LC), which is its own unique concept of humans living on the surface of the Moon. Each has its own playstyle and feature a unique weapon, UCS has plasma guns, EU has lasers and the LC has electric weapons. They also have different focuses, while the UCS is strong with its signature Grenade Launchers, the EU has a strong focus on Cannons and the LC on Rocket Launchers. This is a bit remiscient of Starcraft, which came two years prior to this one, however, Earth 2140, the predecessor of this game came one year before, so again, they share similar concepts of having three unique factions with different playstyles but i wouldn't dare to say someone stole the other's idea.\n\nAnother key difference between the three factions relies on their buildings and methods. The UCS has the Mammoth for building, deploying a small shell that builds itself, and only has one building dedicated to economy but has several upgrades for its Harvester unit, while the ED has its own dedicated unit for building and gathering, requires to have the unit present for building, and also has two buildings, one for gathering resources (a mine-esque buliding) and the other one for processing. LC  can deploy buildings via transmission and have a small queue, but their buildings are very vulnerable while being deployed, and can be easily destroyed by only a few attacks, Regarding economy they only have a Mine building and no gatherers at all. \n\nIn regards to energy collection, the UCS has two dedicated buildings, the Nuclear Plant itself, which can be powered up by reactors increasing the energy output, and the Energy Transmitter, which allows for easy transmisison of energy without the need of building more Plants, this, however, has the drawback of the trasmitter theyselves being very vulnerable to attacks and, if destroyed, can quickly cause a power outage on a whole sector of your base.\nThe ED has to build Power Plants which are smaller and cannot be upgraded normally, but are overall easier to mass build. The LC relies on Solar Energy and has a Solar Power Plant which can field up to ten Solars Panels that do gather energy quickly but are quite fragile. They also have to account for weather and nights, which in turns makes it harder for them to store energy.\n\nHowever, where i always had problems with this game its it campaign mode, cause i always found it a bit boring and lackluster, even tho it tries to tell a story of how the humans are preparing to leave the Earth in search of a new planet (which is expanded upon in Earth 2160). It's not bad, just not amazing as a whole, at least, on my personal opinion.\n\nWell, to not make this review longer im gonna give my overall score now:\n\n6.5/10; works on Windows 10 with a few tweaks to the settings but struggles to run on Windows 11 for some reason. I also strongly recommend picking the Superstorm Mod, which is hard to find these days, but adds new gamemodes, game options and AI difficulties. If you want it, add me.", "timestamp_created": 1735326880, "timestamp_updated": 1735326880, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 659, "total_negative": 200, "total_reviews": 859}, "cursors": {"AoJ4/7fj2vsCeoX9+AI=": "Mon Jan 20 17:12:14 2025"}}
