{"reviews": {"185742615": {"recommendationid": "185742615", "author": {"steamid": "76561198009927158", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 669, "playtime_last_two_weeks": 4, "playtime_at_review": 668, "last_played": 1737118505}, "language": "french", "review": "jeu ne boot pas sur pc", "timestamp_created": 1737065317, "timestamp_updated": 1737065317, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185440385": {"recommendationid": "185440385", "author": {"steamid": "76561198061941336", "num_games_owned": 80, "num_reviews": 20, "playtime_forever": 10840, "playtime_last_two_weeks": 1863, "playtime_at_review": 10597, "last_played": 1736947372}, "language": "english", "review": "First of all: It doesn't even work right out of the box. You download it and it doesn't start - instead, you need to do some cmd voodoo to trick Steam into finding the actual game data. I don't know whose fault it is, Square or Steam, but that's irrelevant to the player. Luckily though, it's not hard to do and there's a bunch of posts in the Discussion and Guide sections describing the process.\n\nNow, about the game itself.\nI am generally not too invested in a game's story, so I won't put much weight on it. Seemed fairly straight forward with some twists near the end that can be unexpected depending on how thoroughly you explore and pay attention. I failed the attention part and was quite surprised. Something that annoyed me from very early on though are some characters: Lann is so braindead it hurts, and Tama's speech impediment is just as insufferable.\nThe game is absolutely stuffed to the brim with humor and goofiness. Your mileage may vary, but I enjoyed most of it as it made the game lighthearted fun for the most part. Many interactions between Lann and anyone else really got pretty old fast though. I get it, Lann is an idiot. The joke lost its merit many hours ago.\n(mini disclaimer: I've only ever played FF1-9) All the cameos of known characters seemed pretty spot on and I'm really happy that my favourite characters of my favourite games made an entrance and felt faithful to their original characters; Bartz & Boko, Faris, Squall, and Quistis. It made me happy to see them all.\nI guess if you enjoy fanservice like this, you're likely to have a good time, even if many of the cameos are fairly minimal.\n\nThe meat of it all: GAMEPLAY!\nYou collect monsters (called mirages) that all have what you'd expect: Certain active skills, passives, stats & growth rates, as well as strengths and weaknesses against elements and status ailments. Where it gets interesting, and as far as I know, quite unique, is that each mirage is in a Size category (Small, Medium, Large) through which you're going to assemble stacks. All the skills, stats, strengths and weaknesses will add up, generally increasing your battle prowess. It's an interesting system with a lot of room to experiment with your monsters to optimize for different battles or areas by juggling offenses and defenses.\n|| Sidenote: Every mirage has different prerequisites for you to be able to catch them. Some need you to hit them with a certain element or status ailment, others want you to heal them, etc. - a few can be made \"catch-ready\" only once within an encounter. So always keep your Libra spell ready for new areas to learn how to catch 'em all! ||\nYou can unstack anytime, or get toppled by enemies (in that case you'll suffer a brief but in worst case fatal stun period). I haven't found much use to unstack other than to reset the topple meter or abuse Reflect against single targets with AoE spells targeted at my own party. That is largely because unstacked participants' stats are useless (increasingly so as you get to higher levels where unstacked characters can often be oneshot by the enemy, let them throw some AoE and you're toast), especially the AP (aka MP/mana/magick) which are a fix 4 per mirage/character, adding up to a maximum of 12 for a full stack. Many many skills require more than 4 AP to cast, thus vastly crippling your battle prowess if you try to go that way. However, if timed well with the ATB bar, it can be useful for using a bunch of items in a short time.\nThen there's a few Mirages that have an XL tag. Those cannot be integrated into stacks, but instead can be summoned as long as they're in your team. For a huge AP cost they can be summoned, replacing both your stacks, and fight as a single entity with two actions per turn. While they are quite an awesome spectacle, I have never found any of them to be necessary for anything. Still a lot of fun.\nLann and Reynn are always part of a stack, either as the Large (Jiant form) or Medium (Lilikin) spot. Both of them can be customized via Mirajewels that'll give them Spells, stats, resistances etc. Somewhere near or at endgame however, you will be able to replace them with other monsters, which can increase battle efficiency even further, at the cost of being unable to imprism (catch) monsters, summon XL mirages or champion.\n\nI could yap on and on about it all, but nobody's gonna read it anyway. All in all, I think the gameplay is incredibly satisfying once you get the hang of it. Even dozens upon dozens of hours after beating the story, I still find myself leveling up unused mirages, playing around with different combinations, attempting different approaches to certain Intervention Quest battles or Coliseum encounters.\n\nOne personal complaint at the end: Near the end, there's a bunch of minigames available. While I'm not a fan of any of them, I HATE HATE HATE Einhänder Invasion. That mobile game-tier trash fest is the one thing in this game that has made me rage so hard I threw stuff around my living room. You aim, you hit the strength meter roughly where you want it AND THEN WAIT 6-11 MONTHS FOR THE CHARACTER TO GODDAMN DO SOMETHING! Screw that, buddy. I hate it!\n\nAll in all though, I really like the game. Feels like a lighthearted love letter to Final Fantasy in general, but with a curious and fun twist to the gameplay formula.\nBaby Tonberry, Baby Behemoth, BABY BAHAMUTH! Buddy, I never thought I needed those in my life.\n\nA General tip: [spoiler]Once you've maxed out a mirage's boards and are able to select a bonus skill, always pick Magic+++ or Strength+++ if available. They always feel vastly more valuable than anything else offered there.[/spoiler]", "timestamp_created": 1736691156, "timestamp_updated": 1736691758, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185398665": {"recommendationid": "185398665", "author": {"steamid": "76561198112504440", "num_games_owned": 299, "num_reviews": 14, "playtime_forever": 685, "playtime_last_two_weeks": 18, "playtime_at_review": 667, "last_played": 1736812648}, "language": "latam", "review": "soy un niño rata dkasjdaskdjkasd", "timestamp_created": 1736644066, "timestamp_updated": 1736644066, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185324064": {"recommendationid": "185324064", "author": {"steamid": "76561198187330631", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 2337, "playtime_last_two_weeks": 0, "playtime_at_review": 2337, "last_played": 1735223728}, "language": "english", "review": "You need to start this game from the steam library.\nJust click on the Play button. It works like a charm.\nDO NOT try to click the desktop icon!", "timestamp_created": 1736575377, "timestamp_updated": 1736575377, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184908345": {"recommendationid": "184908345", "author": {"steamid": "76561198083302840", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 5463, "playtime_last_two_weeks": 222, "playtime_at_review": 5034, "last_played": 1736219967}, "language": "japanese", "review": "とても面白かったです", "timestamp_created": 1736151952, "timestamp_updated": 1736151952, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184662763": {"recommendationid": "184662763", "author": {"steamid": "76561198171244399", "num_games_owned": 108, "num_reviews": 1, "playtime_forever": 2661, "playtime_last_two_weeks": 0, "playtime_at_review": 2661, "last_played": 1735926303}, "language": "spanish", "review": "Si el juego permitiera guardar y no tener que volver a descargarlo para poder guardar entre sesión y estuviese bien configurado cuando se va a jugar por primera vez, lo recomendaría, pero como tienes que buscarte la vida primero para que te funcione y encima después rezar para que no se te congele el juego al intentar guardar y perder todo el progreso que has realizado, aunque sea un buen juego divertido para los fans del universo de final fantasy, si se esta dispuesto a estar reinstalando el juego tras cada sesión de juego, entonces si merece la pena", "timestamp_created": 1735926665, "timestamp_updated": 1735926665, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184245595": {"recommendationid": "184245595", "author": {"steamid": "76561198111069757", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1265, "playtime_last_two_weeks": 0, "playtime_at_review": 640, "last_played": 1736115819}, "language": "spanish", "review": "Juego al estilo clasico de JRPG con alguna variacion como la de formar torres, muy entretenido si te gusta el sistema rpg por turnos ademas de que añade el tema de coleccionar/evolucionar todos los monstruos. Muchos cameos de todas las sagas lo cual tira del factor nostalgia.\r\nLa historia no es \"tan\" profunda como suele ser en los FF pero tampoco lo pretende por su estilo grafico.\r\nRecomendable 100x100", "timestamp_created": 1735585057, "timestamp_updated": 1735585057, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184047471": {"recommendationid": "184047471", "author": {"steamid": "76561199030207219", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 408, "playtime_last_two_weeks": 0, "playtime_at_review": 369, "last_played": 1735436128}, "language": "english", "review": "every time i reinstall this for my kids its the same nightmare i need to look around for hours to find the other .exe its a pain in the ass just dont buy this crap game its not even good! its the worst FF ever why its called FF  i cant say cause it Sht!!", "timestamp_created": 1735433625, "timestamp_updated": 1735433625, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.381411075592041016", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183893709": {"recommendationid": "183893709", "author": {"steamid": "76561199473862733", "num_games_owned": 17, "num_reviews": 9, "playtime_forever": 736, "playtime_last_two_weeks": 1, "playtime_at_review": 714, "last_played": 1736354701}, "language": "english", "review": "silly", "timestamp_created": 1735318071, "timestamp_updated": 1735318071, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183604275": {"recommendationid": "183604275", "author": {"steamid": "76561199177612825", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2088, "playtime_last_two_weeks": 0, "playtime_at_review": 1885, "last_played": 1735092920}, "language": "english", "review": "For me it's cute and a lot of fun. Making a plan to check out the rest that is part of the world", "timestamp_created": 1735080427, "timestamp_updated": 1735080427, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183586303": {"recommendationid": "183586303", "author": {"steamid": "76561198312078727", "num_games_owned": 0, "num_reviews": 75, "playtime_forever": 3676, "playtime_last_two_weeks": 0, "playtime_at_review": 3676, "deck_playtime_at_review": 3392, "last_played": 1704656947}, "language": "english", "review": "World of Final Fantasy is a monster collecting game that splits the difference Pokemon and a traditional jRPG. I was impressed by the production values, which were much higher than typical for this genre - although I found the characters to be kind of annoying. The stacking and balance mechanics provide an extra twist on the traditional jRPG battle system which is generally fun. Monster customization can feel a little overly convoluted for limited payoff.", "timestamp_created": 1735063515, "timestamp_updated": 1735063515, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 2415, "total_negative": 690, "total_reviews": 3105}, "cursors": {"AoJ4nuCbnIsDcrnrtQQ=": "Mon Jan 20 19:32:13 2025"}}
