{"reviews": {"186030772": {"recommendationid": "186030772", "author": {"steamid": "76561198853405462", "num_games_owned": 55, "num_reviews": 7, "playtime_forever": 2128, "playtime_last_two_weeks": 0, "playtime_at_review": 2128, "last_played": 1735229070}, "language": "english", "review": "I beat the game at least twice and i really enjoyed it. At the last boss i had to lower the difficulty as start the fight with half health bar and empty \"mana\" was a bit too much for me. Overall great experience !", "timestamp_created": 1737395425, "timestamp_updated": 1737395425, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "186003925": {"recommendationid": "186003925", "author": {"steamid": "76561198152489263", "num_games_owned": 225, "num_reviews": 38, "playtime_forever": 3531, "playtime_last_two_weeks": 0, "playtime_at_review": 3531, "last_played": 1727468787}, "language": "russian", "review": "Castlevania: Lords of Shadow - это захватывающая и темная приключенческая игра, которая перенесет вас в мистический и опасный мир вампиров, оборотней и других темных существ. Игра сочетает в себе элементы платформера, экшена и RPG, создавая увлекательный и атмосферный игровой мир.\n\nГлавный герой игры - Габриэль Бельмонт, член ордена рыцарей святого Братства, отправляется на поиски своей возлюбленной, которая была похищена темными силами. В процессе своего путешествия Габриэль сталкивается с многочисленными врагами, решает головоломки и сражается с боссами.\n\nОдним из главных достоинств игры является ее замечательная графика и атмосфера. Захватывающие локации, подробно проработанные персонажи и потрясающая анимация делают игровой мир убедительным и захватывающим.\n\nТакже стоит отметить отличный игровой процесс, который предлагает разнообразные бои и сражения, разнообразные умения и навыки персонажа, а также интересные головоломки и задания.\n\nПрисутствуют баги, при чем очень влияющие на получение платины. Благо к ним можно привыкнуть, к сожалению не сломав геймпад или клавиатуру не получится ;)\n\nВ целом, Castlevania: Lords of Shadow - это отличная игра для поклонников жанра и любителей мрачных и атмосферных приключений. Если вы ищете захватывающее и увлекательное путешествие в темные и мистические миры, то эта игра точно стоит вашего внимания.", "timestamp_created": 1737363305, "timestamp_updated": 1737373379, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "186000806": {"recommendationid": "186000806", "author": {"steamid": "76561198278994286", "num_games_owned": 122, "num_reviews": 24, "playtime_forever": 1801, "playtime_last_two_weeks": 1798, "playtime_at_review": 1801, "last_played": 1737321550}, "language": "brazilian", "review": "[h1]A Reimaginação de um Clássico![/h1]\n\nCastlevania: Lords of Shadow nos apresenta um mundo totalmente novo, o ano é 1047 e estamos no chamado \"fim dos dias\", a aliança entre o Céu e a Terra está sendo ameaçada, por causa da quebra dessa aliança, as almas dos mortos vagam sem rumo e criaturas sombrias espalham terror aos vivos.\nAqui entra o nosso protagonista Gabriel Belmont. Gabriel é membro da Irmandade da Luz, um grupo que protege a humanidade de forças sombrias. A Irmandade é quem envia Gabriel para descobrir o porquê da conexão entre o Céu e a Terra ter sido ameaçada.\n[quote] [i]O que motiva um homem a enfrentar os desafios dos quais a maioria de nós fugiria? Condenando a si mesmo à solidão. Expondo a si mesmo à derrota e à morte? A resposta é... o amor.[/i][/quote]\n\n[h3]Combate[/h3]\nCastlevania: Lords of Shadow não é um metroidvania como seus clássicos, se trata de um hack and slash e por se tratar de um hack and slash, ele obviamente tem inspirações em jogos como God of War e Devil May Cry, mas as inspirações vão além, como Shadow of the Colossus e Prince of Persia, por exemplo.\nUsamos a Combat Cross de Gabriel pra descer a peia nos inimigos e temos dois tipos de ataque, o ataque direto e o ataque amplo. Com o ataque direto você bate mais forte, porém concentrado em apenas 1 inimigo. Já no ataque amplo Gabriel gira a Combat Cross e acerta todos os inimigos que estão ao redor, mas os inimigos recebem menos dano. A cada inimigo derrotado ganhamos um número de XP que serve para comprarmos combos e assim melhorar as habilidades de Gabriel.\nTemos também a Magia da Luz e a Magia das Sombras. Quando ativada, a Magia da Luz recupera a nossa vida sempre que acertamos um inimigo. Já a Magia das Sombras aumenta o nosso dano.\nAlém da Combat Cross, Gabriel carrega consigo 4 tipos de equipamento que ele ganha durante a sua jornada: Adagas, Cristal Negro, Fadas, Água Benta, o equipamento certo pode ser a fraqueza de um inimigo ou simplesmente não fazer nenhum arranhão nele (recomendo que veja o bestiário). Durante a jornada, Gabriel consegue também a Luva Negra, as Botas Ciclones e os Ombros de Serafim (asas que permitem pulo duplo) excelentes para combos.\n\n[h3]Momentos Plataforma e Puzzles[/h3]\nO jogo tem momentos plataforma e eles são constantes, pula aqui, escala ali, desce acolá, no geral são muito simples e não tem muito o que falar. Uma das qualidades do jogo são os puzzles, existem vários e são muito bem feitos, o jogo te faz gastar um tempo quebrando a cabeça pra resolvê-los (Uma boa dose de paciência e você consegue).\n\n[h3]Inimigos[/h3]\nO jogo tem tudo quanto é tipo de inimigo, obviamente encontramos Lobos e Vampiros, mas também: Trolls, Chupa-Cabras, Goblins e por aí vai, e como citei acima, cada um com seu nível de fraqueza ou defesa indo 1 a 3. Alguns são fracos a Adagas, outros a Água Benta...\n\n[h3]Sistema de Capítulos e Backtracking[/h3]\nO jogo funciona com sistema de capítulos e você pode revisitar a fase anterior sempre que quiser, aliás, o jogo incentiva que você faça isso. Existem baús com aprimoramentos que só poderão ser encontrados e abertos quando você tiver um determinado poder em mãos. As fases também têm desafios a cumprir. Sempre que você retornar pra uma fase, liberará um desafio, que serve pra fazer o 100%.\nPara aumentar o limite da vida e da magia, é preciso encontrar as gemas da vida, da luz e da sombra, achando 5 de cada você sobe o limite. Funciona como os olhos de górgona e plumas de fênix de God of War. Sempre que você terminar uma fase o jogo te mostrará quantas você achou, se sobrou pode repetir a fase e procurar. Não é necessário finalizar, basta achar o item o voltar ao mapa que você estará com ele.\nAs fases (principalmente as primeiras) têm bifurcações onde pode seguir por um caminho ou outro, de início você pensa que vai ter que vai ter que repetir a fase pra descobrir o que tinha na outra opção, mas não, chega num determinado ponto onde você pode pegar o outro caminho seguir por ele voltando pra ver o que perdeu, é basicamente um circulo.\n\n[h3]Pontos negativos[/h3]\n[list]\n[*]O jogo usa a câmera fixa, e ela é bugada e às vezes mal posicionada. Por exemplo, se o jogo te der o objetivo de passar por uma porta e no meio do caminho surgir inimigos, a câmera não foca Gabriel, ela foca o objetivo, fora que ela ainda fica trêmula quando buga assim. Dependendo da sua localização você fica lutando às cegas sendo forçado e ir até o ponto onde a câmera está focada.\n[*]A hitbox do jogo também é estranha, o inimigo te dá um golpe que claramente nem raspou em você e mesmo assim você toma o golpe, você esquiva e o jogo pode simplesmente achar que você foi acertado e é isso.\n[*]A esquiva junto com o botão do bloqueio. A câmera do jogo é fixa, logo não precisamos do analógico direito pra mexermos nela, então não sei por que caralhos voadores não fizeram a esquiva ser no analógico direito (como em God of War), em vez disso precisamos pressionar o botão de bloqueio e movimentar o analógico esquerdo. O problema disso é que, pra usarmos a Luva Negra pressionamos o botão do bloqueio + botão de ataque, quando Gabriel ataca com a Luva ele dá um soco parado. Então se não ficar ligado quando for começar um combo e tentar esquivar, em vez da esquiva você acidentalmente pode dar um soco parado, assim ficando exposto pro inimigo.\n[*]Os inimigos não dão stagger, você joga um combo poderoso e o inimigo sequer dá uma cambaleada. Inimigos grandes eu entendendo, agora, inimigos comuns aguentando uma sequência de combo e não cair? Tudo bem que a MercurySteam queria que usássemos a esquiva, mas porra, uma caidinha não faria mal.\n[*]O ESQUECIDO! (Forgotten One) CA...RALHO. Esse bicho tem o hitbox mais bugado que idoso usando smartphone. Foi a única parte em que eu tiltei com o jogo. A luta com ele acontece em partes (literalmente kkkkk) tem que acertar cada uma das partes dele, primeiro o pé, depois o quadril, o braço e por fim a cabeça. Quanto mais alto pior fica, você pula, bate, e torce pro golpe pegar e chega um momento que enche o saco. Fora que os combos aéreos são bem limitados.\n[*] Em PCs com Windows 10 e 11 o jogo tem um bug esquisito de textura, as texturas ficam esticadas e atrapalha totalmente o gameplay. Uma forma de resolver isso é sempre que começar uma fase, entrar e sair do modo janela.\n[/list]\n\nÉ isso galerinha, ficamos por aqui.", "timestamp_created": 1737358219, "timestamp_updated": 1737394650, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185940961": {"recommendationid": "185940961", "author": {"steamid": "76561198376539151", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 1059, "playtime_last_two_weeks": 262, "playtime_at_review": 992, "last_played": 1737334395}, "language": "brazilian", "review": "muito massa", "timestamp_created": 1737294208, "timestamp_updated": 1737294208, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185908641": {"recommendationid": "185908641", "author": {"steamid": "76561198258467884", "num_games_owned": 359, "num_reviews": 161, "playtime_forever": 1435, "playtime_last_two_weeks": 1379, "playtime_at_review": 1435, "last_played": 1737222696}, "language": "english", "review": "[h1]3D Castlevania and the Curse of Divisiveness[/h1]\nThis is probably my favourite 3D Castlevania, for now at least. \n\nIt is a hack-n-slash which is said to be inspired by Castlevania Lament of Innocence, but stylistically and even in matters of gameplay it is easier to compare it to the classic God of War games; from the platforming, to the puzzles, combat, QTEs. Even in the aesthetics, your whip having that \"projectile on a hilt\" aesthetic of Kratos' Blades of Chaos than the more solid object whip model in Lament of Innocence.\n\n\n[h2]Combat[/h2]\nI've seen common posts of people struggling with this game's combat, and since it's like the old God of War games, you'll get the stigma of it being a button masher. This comes from the instinctual desire of newbies to mash the attack buttons, which I suppose is the tempting thing to do when you're having to deal with managing hordes of enemies in a fast paced action game. \n\nAlbeit, this game can be punishing to players who play as such. To expand on this, I think this game is stricter than the old God of War games in trying to make the player engage with its' mechanics, though it does so in a potentially vexing manner to the impatient and uninitiated. Though first we must give credit where its' due: the game tries to ease the player into its' combat with plenty of basic mechanics being described concisely through its' collectable scrolls and unlockable combos' descriptions. This is straight forward enough, albeit feels like boring busywork, so impatient players who don't engage so easily may quickly reject the game in a manner that is comical if we consider how generous with information the game can be. Yet some aspects can in fact be elusive. Aerial combat can be tricky to understand, it can seem too risky with the way it punishes you in certain scenarios. This comes from the game wanting players to engage with the dodge roll and parry mechanics as opposed to staying constantly airborne. \n\nNot all of your tricks will work in all situations, and the early game can be grating especially due to the player not having access to certain relics like the Dark Gauntlet (which enriches the aerial combat) until later, so players may bounce off the game's way of teaching them. Though, it is always important to try different combos, alternate between quick button presses and held down inputs. It is also important to use the sub weapons, as they can be tempting to write off, though their effects can make a big difference in varied scenarios.\n\nI found the combat to be mostly fun throughout the main story and DLC, alternating between direct attacks and area attacks based on my intent made sense.\n\n[h2]Platforming[/h2]\nThe platforming takes a backseat to the combat here, a tradition continued from the PS2 Castlevania titles. It was only the Nintendo 64 Castlevania games which got closest to achieving the platforming and combat equilibrium of the classic titles, and those were also probably the purest and most original of the \"3DVanias\", also pretty fun given their age.\n\nNonetheless, even if the platforming isn't the star of the show here. I still believe it fair to give it some merit, especially since the previous 3D Castlevania game, titled \"Curse of Darkness\" went for the bewildering approach of omitting the platforming entirely. \n\nThe use of the Combat Cross to swing across and scale various gaps and walls was typically well implemented and felt appropriate to the Castlevania brand while maintaing its' own style. When you look back at its grappling abilities in Super Castlevania IV and Castlevania Bloodlines and compare, it's clear Gabriel is as capable as any Belmont or other vampire hunter at versatile use of the Vampire Killer. \n\nThere may be problem with overuse of ledge climbing and being too derivative of its' inspiration, but it still takes time to give platforming its' due. In later parts we can especially see greater focus on platforming. The Clockwork Tower featured some solid platforming, given this game's quirks and limitations. The cyclone boots and seraph shoulders relics are used in unison in the game's latter half to provide plenty of 'running start-double jump' leaps over great gaps.\n\nThis is not to absolve the shortcomings of this game's platforming. The Nintendo 64 Castlevania games still felt more naturally attuned towards a platforming experience despite being over a decade older. Likewise, this is too far removed to be considered an approximation of the classic style games, which are the paramount examples of the Castlevania series' distinct platforming style. \n\n\n[h2]Further comparisons to the other 3DVanias[/h2]\nThe game also uses fixed camera angles frequently, I almost never found this to be a real issue. The locked camera angles of Castlevania Lament of Innocence and the Lock-on system of Castlevania Curse of Darkness were much more problematic in feeding the player relevant information, especially during busy fights. While the limitations of Lords of Shadow's camera felt better at encouraging the player to pay attention to the environment and to try and explore, I never felt it impeded the combat.\n\nI also much preferred Lords of Shadow' environments, they never felt like the massive empty room problem we had in the PS2 titles. Navigating through areas was quick.\n\n\n[h2]What didn't work for me[/h2]\nOf course, Lords of Shadow like any honest 3D Castlevania had to have its' fair share of frustrations, and typical shortcomings of evolving the 3D Castlevania experience.\n\nUnlike the 2D Castlevania games, which felt mostly natural at evolving the series, we can see that 3D Castlevania is burdened by the malady of growing pains. It's as if its' cursed to take two steps forward, one step back with each game.\n\nFor me, Lords of Shadow's specific focus on certain mythology and fantasy was a turnoff. It still features plenty of gothic horror, but the Universal horror movie style feels absent here. Not a Medusa head to be found here. Skeletons appear in the game, but quite late and they are somewhat uncharacteristic of what we might expect from this series. \n\nThere is also the issue of the game feeling tedious, towards the last quarter especially. There's just too many missions, weird pacing, and repetition. The game's first 2 bosses are an Ice Titan and a Stone Titan, we've seen the Koraton boss and various golems in other Castlevania games so it's fitting to see such a monster. Yet, there was no need to have such similar bosses one after the other. These should have been combined into a single two-phase boss fight. Stuff like that made the first half of the game uninspired.\n\nThe boss fights in general were odd here. My favourite might ironically be the Evil Butcher, who's pretty irrelevant story-wise but it felt like there was more going on with him than in some of the more generic slug fests that the game offers.\n\nAnother thing I didn't love was how awkward the QTEs felt. There's some games that can do QTEs and make them feel satisfying, but this game's brand of press any button when the white traffic light flashes felt tacky and unfulfilling.\n\n[h2]Final Thoughts[/h2]\nDespite all that, I still would come away with a game I enjoyed. The first 9 chapters genuinely had some good ideas with adequate combat, puzzles and platforming, and the story while cliche and technically just window dressing, still had some okay twists to it that felt like it was trying something.\n\nThough, the shortcomings aren't just a case of struggles to adapt Castlevania to 3D, but also a sort of diluting effect the series seems to be subjected to when trying to grow broader appeal or explore new ideas.", "timestamp_created": 1737255051, "timestamp_updated": 1737335535, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185891156": {"recommendationid": "185891156", "author": {"steamid": "76561198273685312", "num_games_owned": 1831, "num_reviews": 197, "playtime_forever": 1596, "playtime_last_two_weeks": 1392, "playtime_at_review": 1596, "last_played": 1737235177}, "language": "english", "review": "Story is great ,game play is pretty much puzzles are lame ,cam is bit buggy and combat is pretty boring\r\n", "timestamp_created": 1737235381, "timestamp_updated": 1737235381, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185888179": {"recommendationid": "185888179", "author": {"steamid": "76561199264628366", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2560, "playtime_last_two_weeks": 37, "playtime_at_review": 2522, "last_played": 1737236253}, "language": "brazilian", "review": "Bom jogo, mas sempre buga numa fase do castelo, onde tem que acionar um mecanismo\r\n", "timestamp_created": 1737232702, "timestamp_updated": 1737232702, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185883395": {"recommendationid": "185883395", "author": {"steamid": "76561198131533315", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 1083, "playtime_last_two_weeks": 1083, "playtime_at_review": 174, "last_played": 1737401887}, "language": "english", "review": "This game is awesome! Picked it up on sale a while back and decided to pick it up while I got burned out on BGEE and oh man if you are looking for an action game that runs great on older hardware this is a winner. Runs 40- 60 FPS on my old 1050 TI laptop pushing 4k to my LG OLED TV!", "timestamp_created": 1737228442, "timestamp_updated": 1737250045, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185821630": {"recommendationid": "185821630", "author": {"steamid": "76561198841275474", "num_games_owned": 23, "num_reviews": 3, "playtime_forever": 2615, "playtime_last_two_weeks": 35, "playtime_at_review": 2615, "last_played": 1736861684}, "language": "brazilian", "review": "problema de toda fase o grafico fica horrivel e vc tem que mudar configuraçaõ de video pra modo janela e depois voltar pra cofiguraçaõ original , muito chato isso", "timestamp_created": 1737161801, "timestamp_updated": 1737161801, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185798781": {"recommendationid": "185798781", "author": {"steamid": "76561198035271617", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 830, "playtime_last_two_weeks": 325, "playtime_at_review": 505, "last_played": 1737323209}, "language": "english", "review": "gurmanska", "timestamp_created": 1737137552, "timestamp_updated": 1737137552, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185751090": {"recommendationid": "185751090", "author": {"steamid": "76561199084541335", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 888, "playtime_last_two_weeks": 888, "playtime_at_review": 813, "last_played": 1737162152}, "language": "spanish", "review": "me encanta la jugabilidad del juego y la historia del mismo \r\n", "timestamp_created": 1737076567, "timestamp_updated": 1737076567, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185747943": {"recommendationid": "185747943", "author": {"steamid": "76561198116874147", "num_games_owned": 0, "num_reviews": 180, "playtime_forever": 1019, "playtime_last_two_weeks": 608, "playtime_at_review": 1019, "last_played": 1737070953}, "language": "latam", "review": "(Y)", "timestamp_created": 1737072081, "timestamp_updated": 1737072081, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185741719": {"recommendationid": "185741719", "author": {"steamid": "76561198142086015", "num_games_owned": 712, "num_reviews": 179, "playtime_forever": 17, "playtime_last_two_weeks": 0, "playtime_at_review": 17, "last_played": 1709971391}, "language": "russian", "review": "The spectacular design of the locations is confidently supported by decent graphics - the picture is sometimes simply mesmerizing. The considerable length does not tire us at all, because, on the one hand, we follow the constantly developing plot, and on the other, interest is maintained by a variety of locations and an impressive bestiary!\nPros: thoughtful and strong plot; various locations; many enemies with an individual approach; spectacular fights; excellent graphics and decent sound.\nCons: sometimes tiring fights due to constant QTEs; Sometimes the camera behaves illogically, interfering with acrobatics 7\\10", "timestamp_created": 1737064382, "timestamp_updated": 1737064667, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.490196079015731812", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185685522": {"recommendationid": "185685522", "author": {"steamid": "76561199468668370", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 2489, "playtime_last_two_weeks": 1893, "playtime_at_review": 2451, "last_played": 1737033422}, "language": "brazilian", "review": "jogaço da porra, a jogabilidade é incrível, inimigos e bosses marcantes, e um ótimo sistema de upgrade no game. Literalmente o ABSOLUTE VIDEOGAME!", "timestamp_created": 1736995595, "timestamp_updated": 1736995595, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "primarily_steam_deck": false}, "185677142": {"recommendationid": "185677142", "author": {"steamid": "76561198122945868", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 659, "playtime_last_two_weeks": 659, "playtime_at_review": 659, "last_played": 1736983370}, "language": "english", "review": "Other than the stupid Chupacabras, this game is extremely fun. The combos are so fluid and fun to pull off and its got great level design! my only gripe besides the Chupacabras though is probably the length of the game, I kind of wish it was short and sweet like the first Devil May Cry and being endlessly replayable, but it kinda just KEEPS GOING after a while. Still great to play though and a super fun take on the tone and style of castlevania in a God of War/Devil May Cry kinda way.", "timestamp_created": 1736983507, "timestamp_updated": 1736983507, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525316417217254639", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185674028": {"recommendationid": "185674028", "author": {"steamid": "76561199107472532", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1329, "playtime_last_two_weeks": 758, "playtime_at_review": 1329, "last_played": 1736979234}, "language": "russian", "review": "Игра детства. Решил прикупить и перепройти. Всем советую, игра шикарная.", "timestamp_created": 1736979564, "timestamp_updated": 1736979564, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185668239": {"recommendationid": "185668239", "author": {"steamid": "76561198201102263", "num_games_owned": 71, "num_reviews": 20, "playtime_forever": 2231, "playtime_last_two_weeks": 2231, "playtime_at_review": 2005, "last_played": 1737149323}, "language": "brazilian", "review": "Bom, simples e barato", "timestamp_created": 1736972803, "timestamp_updated": 1736972803, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185653655": {"recommendationid": "185653655", "author": {"steamid": "76561199061551204", "num_games_owned": 0, "num_reviews": 43, "playtime_forever": 660, "playtime_last_two_weeks": 0, "playtime_at_review": 660, "last_played": 1733084680}, "language": "brazilian", "review": "Jogo muito bom, com Bosses bem interessantes e difíceis, com mecânicas que lembram assassin's Creed e God of War de play 2. Recomendo demais.", "timestamp_created": 1736957409, "timestamp_updated": 1736957409, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185618225": {"recommendationid": "185618225", "author": {"steamid": "76561198172885419", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 2244, "playtime_last_two_weeks": 2, "playtime_at_review": 2244, "last_played": 1736905554}, "language": "spanish", "review": "Me resulto un juego con un hermoso apartado visual y musical, ademas de una historia muy interesante y bien lograda, con personajes complejos y boss que resultan algunos un verdadero reto.\r\nLo que no me gusto mucho son los puzzle exesivos que poseé, pero después es por demas recomendado, es un juego que realmente vale la pena darle una oportunidad.", "timestamp_created": 1736906206, "timestamp_updated": 1736906206, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185602767": {"recommendationid": "185602767", "author": {"steamid": "76561198237321804", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 11, "playtime_last_two_weeks": 11, "playtime_at_review": 11, "last_played": 1736887180}, "language": "turkish", "review": "bu oyunu yaparken hiç mi utanmadınız o*ospu çocukları ben oynarken utandım annem odayı bastı porno izlesem daha rahat açıklarım bu ne a*ın oğlu dedi sağ kroşe sol kroşe derken bu incelemeyi yazma gereği duydum iyi eğlenceler", "timestamp_created": 1736887329, "timestamp_updated": 1736887329, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185589451": {"recommendationid": "185589451", "author": {"steamid": "76561199197684769", "num_games_owned": 31, "num_reviews": 3, "playtime_forever": 180, "playtime_last_two_weeks": 180, "playtime_at_review": 21, "last_played": 1737071001}, "language": "english", "review": "fuck konami", "timestamp_created": 1736873453, "timestamp_updated": 1736873453, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185573118": {"recommendationid": "185573118", "author": {"steamid": "76561198164341253", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 287, "playtime_last_two_weeks": 287, "playtime_at_review": 287, "last_played": 1736857483}, "language": "turkish", "review": "Öncelikle oyunun girişi, müzikleri insanı heyecanlandırıyor. Ancak kısa süre sonra oynanışı ve kontrolleri bayıyor. Bölümler çok kısa ve sürekli cutscene izlemek zorunda kalıyorsun. Tam kendini kaptırıp düşmanlara dalacaksın, bölüm bitiyor ve oynanış kesiliyor. Akıcılık yok. Ancak oyun müzikleri gerçekten çok epik olmuş. Sabrım var diyen alsın. Puanım 5/10", "timestamp_created": 1736857753, "timestamp_updated": 1736857753, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185567738": {"recommendationid": "185567738", "author": {"steamid": "76561199025762825", "num_games_owned": 238, "num_reviews": 82, "playtime_forever": 2243, "playtime_last_two_weeks": 0, "playtime_at_review": 2243, "last_played": 1681366455}, "language": "english", "review": "My friend who I play CS 2 with said if I post a review on this game and it gets 202 likes and 69 Awards that he will buy me a RTX 3060 and 2 Kilos of canned ham. So I'm just gonna leave this here. Help a brotha!", "timestamp_created": 1736849538, "timestamp_updated": 1736849538, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516483545303344727", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185560302": {"recommendationid": "185560302", "author": {"steamid": "76561199056894302", "num_games_owned": 0, "num_reviews": 43, "playtime_forever": 145, "playtime_last_two_weeks": 145, "playtime_at_review": 145, "last_played": 1736515379}, "language": "dutch", "review": "The best Castlevania game there is.", "timestamp_created": 1736837681, "timestamp_updated": 1736837681, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185547016": {"recommendationid": "185547016", "author": {"steamid": "76561198090680544", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 1081, "playtime_last_two_weeks": 1081, "playtime_at_review": 1077, "last_played": 1737060706}, "language": "english", "review": "Die Monster! \r\nYou Don't Belong In This World!", "timestamp_created": 1736816584, "timestamp_updated": 1736816584, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.502992033958435059", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185537994": {"recommendationid": "185537994", "author": {"steamid": "76561198207328316", "num_games_owned": 539, "num_reviews": 34, "playtime_forever": 115, "playtime_last_two_weeks": 33, "playtime_at_review": 115, "last_played": 1736801644}, "language": "russian", "review": "кал.", "timestamp_created": 1736804364, "timestamp_updated": 1736804364, "voted_up": false, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.526089489459991455", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185529955": {"recommendationid": "185529955", "author": {"steamid": "76561198113707482", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 1213, "playtime_last_two_weeks": 72, "playtime_at_review": 1171, "deck_playtime_at_review": 1171, "last_played": 1736802030}, "language": "german", "review": "This game is far from perfect but I like the francise and the main campaign, I would recommend those. But both DLCs are awfull made and far away from what I expected. By far the worst DLCs I have ever played in a Videogame. Campaign: recommend, DLC: No f... way!", "timestamp_created": 1736795504, "timestamp_updated": 1736795504, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}, "185526143": {"recommendationid": "185526143", "author": {"steamid": "76561199050920824", "num_games_owned": 0, "num_reviews": 93, "playtime_forever": 2794, "playtime_last_two_weeks": 989, "playtime_at_review": 2794, "last_played": 1736729275}, "language": "ukrainian", "review": "[b] Castlevania: Lords of Shadow - Ultimate Edition (Каслванія: Володарі тіні) [/b] — це пригодницька гра з поєднанням платформінгу та hack-and-slash бойових дій. Розробники інтерпретували популярні легенди Європи і що спричинило їх появі. Це розширене видання оригінальної гри Castlevania: Lords of Shadow, випущене у 2013 році для ПК, яке включає доповнення Reverie та Resurrection, які додають нові сюжетні глави.\n\n[h3] Сюжет [/h3]\nДія гри розгортається в темному фентезійному світі, де головний герой, Габріель Бельмонт, шукає спосіб повернути до життя свою дружину Марію, вбиту злими силами.\nЦентральною темою стала боротьба добра і зла, що перегукується з християнськими мотивами, зокрема із темою спокуси, жертовності й падіння.\nГабріель Бельмонт є алегорією лицаря, який проходить через спокуси та моральні випробування.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3406471452\n[h3] Механіка гри [/h3]\nОсновною зброєю Габріеля є батіг із руків'ям у формі хреста, а також різноманітні додаткові предмети, які відкриваються поступово в процесі гри. Гравець також отримує можливість використовувати світлу і темну магію, що додає стратегії до ігрового процесу.\nГра пропонує насичені бої, цікаві головоломки та інтерактивні елементи. Система збереження реалізована на відмінно — можна забути про ручне збереження на зразок F5.\nКарта виконана дуже якісно: вона не лише відображає прогрес, а й надає підказки про зібрані предмети та покращення, а також показує, що ще залишилося знайти.\n\n[h3] Візуальна частина [/h3]\nВізуально гра відчувається застарілою. Місцями бракує більшої деталізації, а подекуди локації здаються дещо порожніми. Однак, коли я проходила її вперше понад 10 років тому, це було справжнє естетичне задоволення.\nПопри ці недоліки, гра все одно зберігає свою привабливість і виглядає дуже красиво.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3399713015\n[h3] Музика [/h3]\nМузичний супровід вдало підкреслює атмосферу різних локацій і бойових сцен, але він більше слугує фоном для підсилення візуального сприйняття. На жаль, серед треків я не знайшла жодного, який би мене справді вразив.\n\n[h3] Рекомендації [/h3]\n1. Гру краще проходити на геймпаді для максимально комфортного керування.\n2. Неуважним, таким як я: обов'язково налаштуйте параметри під свій дисплей. Гра рекомендує лише повноекранний режим.\n3. Для людей, які вибивають всі досягнення: гра не пропонує почати нову гру, воно і не потрібно. Пройшовши гру на складності \"Лицар\", переключіться на \"Паладин\" (тому що ця складність на початку закрита) і зачистіть локації на 110%.\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3395803391\n[h1] Дякуючи небайдужим людям, ми маємо українізатор.\nPlease add Ukrainian language [/h1]", "timestamp_created": 1736791370, "timestamp_updated": 1737310330, "voted_up": true, "votes_up": 37, "votes_funny": 0, "weighted_vote_score": "0.796856403350830078", "comment_count": 6, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185521891": {"recommendationid": "185521891", "author": {"steamid": "76561198001848939", "num_games_owned": 134, "num_reviews": 2, "playtime_forever": 461, "playtime_last_two_weeks": 214, "playtime_at_review": 422, "last_played": 1736788511}, "language": "french", "review": "clairement de la merde en plus 18/20 pour un jeux qui a des commandes a chier prenez dmc collection vous aurez plus pour votre argent et vous aurez plus d'amusement", "timestamp_created": 1736786890, "timestamp_updated": 1736786890, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185502859": {"recommendationid": "185502859", "author": {"steamid": "76561198057940498", "num_games_owned": 943, "num_reviews": 200, "playtime_forever": 77, "playtime_last_two_weeks": 0, "playtime_at_review": 77, "last_played": 1601441274}, "language": "english", "review": "It just doesn't hold up in 2025, I remember loving it a long time ago but there are just better things to spend your time on now.", "timestamp_created": 1736764053, "timestamp_updated": 1736764053, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185457640": {"recommendationid": "185457640", "author": {"steamid": "76561199023419504", "num_games_owned": 46, "num_reviews": 6, "playtime_forever": 3804, "playtime_last_two_weeks": 1475, "playtime_at_review": 3804, "last_played": 1736705260}, "language": "brazilian", "review": "O jogo é bom porém em algumas partes os controles não são precisos, ele é uma mistura de GOW com assansin creed", "timestamp_created": 1736705530, "timestamp_updated": 1736705530, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185420157": {"recommendationid": "185420157", "author": {"steamid": "76561198076698233", "num_games_owned": 0, "num_reviews": 18, "playtime_forever": 1338, "playtime_last_two_weeks": 1175, "playtime_at_review": 1338, "deck_playtime_at_review": 635, "last_played": 1736630863}, "language": "turkish", "review": "2D Castlevania oyunlarını hiç oynamadım ve bu evrene dair hiçbir fikrim de yok açıkçası. Bu oyunun sadece eski hack n slash God of War oyunlarına benzerliği ilgimi çekmişti. Oyunun ana hikayesi toplamda 12 Chapter'dan oluşuyor. Chapter 13 ve 14 ise Ultimate Edition'un içinde halihazırda olan DLC bölümleridir. Ben her yeri araştırıp tüm can ve büyü yükseltmelerini aradığımdan tüm içeriği bitirmem 22 saat kadar sürdü, bu sizin oynayış tarzınıza göre birkaç saat daha düşük olabilir.\n\nDevil May Cry veya Bayonetta haricinde eski God of War'lara benzer bir oyun arıyorsanız bu oyun tam size göre diyebilirim. God of War 3 ile kıyaslandığında oynanış bakımından pek geride kalır bir yanı yok. Bol bol boss savaşı, yer yer epik kısımlar, puzzle'lar, çeşitli lokasyonlar ve canavarlar... Lords of Shadow içerik bakımından epey dolu bir oyun. Fakat yer yer bazı kısımlarda ana hikayeyle tam olarak alakasını anlayamadığım ve filler gibi hissettiren kısımlar da oldu. Bazı şeyler çok aniden gelişiyor, ana karakter Gabriel'in motivasyonu da çok basit ve sade fakat bu onun ne kadar havalı bir karakter olduğu gerçeğini değiştirmiyor. Gabriel ile çok havalı kombolar yapıp koca koca yaratıkları zincirli silahıyla kesip biçebiliyorsunuz. Gabriel'in görevine adamışlığı ve kendi ile olan iç hesaplaşmasıyla ilgili daha fazla şey görmek isterdim doğrusu. Oyunun son kısmına gelene kadar \"abi bu olay nereye bağlanacak şimdi?\" diye düşünmeden edemiyordum.\n\nHikayesine kısaca bir değinmek istiyorum çünkü oyunun başında tam olarak ne yaptığım, Gabriel'in kim olduğu ve ne amaçladığı hakkında pek bir bilgi vermiyor size. Oynadıkça öğreniyorsunuz. Derin bir spoiler vermeden şöyle açıklayabilirim: Gabriel, Brotherhood of Light'ın bir şövalyesidir ve görevi gereği dünyayı sarmış kötülükleri arındırma peşindedir. Nedeni bilinmeyen bir şekilde ölen insanlar öteki tarafa geçemez olur. Dünyayı troller, goblinler, kötü varlıklar sarmalamaya başlar ve bu sorunun kaynağını çözme görevi ve karısını kimin öldürdüğünü bulmak Gabriel'e düşer.\n\nHikaye öyle ahım şahım değil, karakterler çok da derin veya ilginç değil ama oyunun sonunda hikaye çok güzel bağlanıyor bence. Yer yer puzzle kısımları sıkabilir fakat puzzle'ların çözümünü her zaman tek tuşta öğrenebiliyorsunuz. Ben DLC'lere gelene kadar tüm puzzle'ları kendim çözdüm, biraz düşündürücü olabiliyorlar. Oynanış ise klasik Hack n Slash oyunlarından beklentinizi karşılayacak düzeyde. \n\nSon olarak oynanış ile ilgili ufak bir negatif eleştiri yapacağım. Oyunun bir bölümünde kombo barı açılıyor ve bu kombo barını doldurmanın tek yolu savaş sırasında hiç hasar almadan düşmanlara sürekli olarak saldırmak ve(ya) parry'lemek. Parry'lediğiniz zaman veya sağlam bir kombo hareketi yaptığınızda bu barı çok rahat doldurabiliyorsunuz fakat tek bir hasar yediğiniz zaman bu bar tamamen sıfırlanıyor. Özellikle oyunun ileri kısımlarında kalkanlı ve zırhlı düşmanlar geliyor onların Allah belasını versin. Ne kalkanlarını hızlıca kırabiliyorsunuz ne düzgün hasar verebiliyorsunuz ne de saldırılarını engelleyebiliyorsunuz. Posture'ları bozulmuyor ki anasını sattığımın iskeletlerinin. Özellikle DLC'de, yani 14. Chapter'da, Final Boss'tan önce art arda 12 tane bu kalkanlı iskeletlerle karşılaşıyorsunuz ve Final Boss'tan önce bunlarla savaşmak çok büyük bir şerefsizlik. Final Boss'tan önce tüm kaynakları tüketecek bir savaşa girilir mi Allah aşkına? O nedenle Chapter 14'e gelirseniz direkt iskeletleri skipleyip dümdüz devam etmenizi öneririm.", "timestamp_created": 1736670056, "timestamp_updated": 1736670615, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185414711": {"recommendationid": "185414711", "author": {"steamid": "76561199143680423", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5209, "playtime_last_two_weeks": 85, "playtime_at_review": 5124, "last_played": 1736832132}, "language": "english", "review": "A pretty good and interesting take on Castlevania. Gameplay was engaging and the visuals and soundtrack are phenomenal. Story had its issues, but was good overall. It's evident the developers of this game were big fans of the franchise and poured a lot of love into it.\r\n\r\nIt may not be for everyone, but I'd recommend giving it a shot if you're interested.", "timestamp_created": 1736662913, "timestamp_updated": 1736662913, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185397895": {"recommendationid": "185397895", "author": {"steamid": "76561198077858632", "num_games_owned": 717, "num_reviews": 780, "playtime_forever": 1609, "playtime_last_two_weeks": 1603, "playtime_at_review": 1609, "last_played": 1736643135}, "language": "english", "review": "the greatest post credit scene ever", "timestamp_created": 1736643189, "timestamp_updated": 1736643189, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185348796": {"recommendationid": "185348796", "author": {"steamid": "76561197984498962", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 3175, "playtime_last_two_weeks": 526, "playtime_at_review": 3175, "last_played": 1736599505}, "language": "russian", "review": "Это шикарная игра по франшизе Кастельвании. Лично мне понравился и геймплей и боевая система и сюжет. Много красивых видосов. Ну прям все зашло. Почти все. Как обычно и минусы есть. Кажется зря тут вставили элементы метроидвании. Ну не нужно тут заставлять игрока возвращаться, чтобы взять некоторые предметы. А второй прям жирнючий минус - это DLC. При этом к самому DLC вопросов нет. Во-первых, в нем действительно есть новые механики и туча новых головоломок. Во-вторых, это DLC связывает 1 часть со следующей, где Габриель уже в облике Дракулы. Но вот последний босс... Это, пожалуй один из самых ужасных боссов, которых я видел. Помните шредера из черепашек на пиратском картридже - вот это то же самое. Только тут такое поведение были изначально задумано разработчиками. В общем, советую прохождение последнего босса смотреть не лестплее, чтоб не траить время и нервы. (для инфо, на само DLC я потратил 2-3 часа и часов 10 на босса).", "timestamp_created": 1736602057, "timestamp_updated": 1736602057, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862038135528564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185306006": {"recommendationid": "185306006", "author": {"steamid": "76561199655487945", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 715, "playtime_last_two_weeks": 2, "playtime_at_review": 715, "last_played": 1736556335}, "language": "romanian", "review": "Honestly, I liked this game and I would even recommmed this game for other people to play (despite my low time play session of 11 hours), and that's due to the \"throw\" mechanic (and yes, I'm talking about the Stone Titan boss fight). That's literally my only complaint about the game. If that mechanic alone was made to work using the mouse, then I would have actually finished the game by now (and knowing there is one more boss fight with the same mechanic). And if you're new, just make sure you have a game controller with a joystick, otherwise you may get stuck just as me. Still, the game is impressive nonetheless.", "timestamp_created": 1736557102, "timestamp_updated": 1736557102, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185297490": {"recommendationid": "185297490", "author": {"steamid": "76561199146130746", "num_games_owned": 1448, "num_reviews": 245, "playtime_forever": 2201, "playtime_last_two_weeks": 929, "playtime_at_review": 2201, "last_played": 1736548403}, "language": "russian", "review": "Интересный взгляд на историю Castlevania с элементами из God of War и Shadow of the Colossus. Легко играется короткими раундами благодаря системе глав, имеет действительно приятную графику и чертовски хороший саундтрек. Рекомендуется, если вы ищете экшн-игру.", "timestamp_created": 1736548711, "timestamp_updated": 1736548711, "voted_up": true, "votes_up": 9, "votes_funny": 1, "weighted_vote_score": "0.619221389293670654", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185284693": {"recommendationid": "185284693", "author": {"steamid": "76561198112446962", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 30, "playtime_last_two_weeks": 20, "playtime_at_review": 30, "last_played": 1736528898}, "language": "brazilian", "review": "Muito Bom o jogo", "timestamp_created": 1736537978, "timestamp_updated": 1736537978, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185232441": {"recommendationid": "185232441", "author": {"steamid": "76561199044757906", "num_games_owned": 17, "num_reviews": 2, "playtime_forever": 1567, "playtime_last_two_weeks": 1, "playtime_at_review": 1565, "last_played": 1736648435}, "language": "spanish", "review": "Bn chido", "timestamp_created": 1736487222, "timestamp_updated": 1736487222, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185188595": {"recommendationid": "185188595", "author": {"steamid": "76561198444013644", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 194, "playtime_last_two_weeks": 0, "playtime_at_review": 194, "last_played": 1736198006}, "language": "russian", "review": "Эта игра — не Castlevania. Ей нужно было придумать другое название.", "timestamp_created": 1736436406, "timestamp_updated": 1736436406, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.467289716005325317", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185182701": {"recommendationid": "185182701", "author": {"steamid": "76561198132286184", "num_games_owned": 259, "num_reviews": 12, "playtime_forever": 1465, "playtime_last_two_weeks": 1465, "playtime_at_review": 1208, "last_played": 1736474414}, "language": "english", "review": "I now know why vampires hate mirrors....If i have to go through another one i would be pissed too... \r\n\r\ngameplay 8/10\r\nstory 8/10\r\ncamera angles  4/10 \r\n\r\nOverall the games good if you can look past the camera cause it works against you at times when fighting. I was able to.\r\n\r\nIf you want a different take on a castlevania games worth playing. Has that DMC and GOW style.", "timestamp_created": 1736430467, "timestamp_updated": 1736430467, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185174261": {"recommendationid": "185174261", "author": {"steamid": "76561198384879589", "num_games_owned": 30, "num_reviews": 13, "playtime_forever": 2090, "playtime_last_two_weeks": 1956, "playtime_at_review": 454, "last_played": 1737229762}, "language": "brazilian", "review": "jogaço", "timestamp_created": 1736420372, "timestamp_updated": 1736420372, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185084939": {"recommendationid": "185084939", "author": {"steamid": "76561199326483007", "num_games_owned": 51, "num_reviews": 14, "playtime_forever": 1750, "playtime_last_two_weeks": 666, "playtime_at_review": 1750, "last_played": 1736320144}, "language": "english", "review": "8/10 FORGOTTEN ONE , soggy places , mossy dump , desecrated lands , bewildered Gabriel seeking his beloved ,  stumbled upon peculiar manuscripts , he should to ascertain fiendish plans + OST in main menu something splendid incredible , froze me for few min , good exp however not for all , despite some camera issue + platforming cringe game worth ur time if u fan of (DMC / DARKSIDERS)", "timestamp_created": 1736321336, "timestamp_updated": 1736321864, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185047173": {"recommendationid": "185047173", "author": {"steamid": "76561198131581190", "num_games_owned": 0, "num_reviews": 49, "playtime_forever": 1150, "playtime_last_two_weeks": 387, "playtime_at_review": 1150, "last_played": 1736279392}, "language": "english", "review": "Castlevania: Lords of Shadow is a really good Hack and Slash game, with a plethora of bosses and regular enemies alike (oh and there are also those pesky puzzles). But what really impressed me is the plot. To be honest, the whole thing was kinda boring until like halfway through Chapter II, at which point I slowly started to realize it's way more complicated than just \"go kill those very evil monsters, good guy\", maybe it's because I've never played a Castlevania game before.\nThe combat system isn't challenging, honestly, I played on the third hardest difficulty out of four (which I recommend you choose as well if you're not a pro in the genre, like myself, believe me, that will be enough) and I only had to use regular one-button combos, dodges, AoE attacks a few times and closer to the end of the game I stared using one AoE combo that was more than just pressing one button repeatedly, and that was enough. Oh, and there are QTEs, with is super cool if you ask me. The bosses are engaging, each standoff is a combination of well-timed dodges, attacking without getting too greedy and a bit of wit. Only the very last one in Chapter XIV is a pain in the ass, took me like 2 hours to beat him lol.", "timestamp_created": 1736280972, "timestamp_updated": 1736281105, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185042832": {"recommendationid": "185042832", "author": {"steamid": "76561198097576840", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 593, "playtime_last_two_weeks": 47, "playtime_at_review": 546, "last_played": 1737254292}, "language": "english", "review": "Very simple yet fun combat system. Only one main weapon with four secondaries and two types of magic. The magic system itself interacts very well with both the Combat Cross and the secondary weapons.\n\nThe narrative is also simple, but compelling. It's no Oscar winning writting but you'll get invested in Gabriel and his quest to save his wife. The characters design and overall art style is extremelly well done too. And the hand drawn images on Gabriel's bestiary and combo-list are very cool.\n\nThat being said, this game has some very... interesting flaws. I say \"interesing\" because they're very basic things which most games of the same genre get right. It's not something you'd normally notice unless something is wrong.\n\nOne is camera angles. It's very hard to tell sometimes whether you're jumping to a grabbable ledge or to your demise. Add in the game's lack of deph of field and you have no idea if a certain object is right in front of you or far into the backgroung.\n\nThe second is this game's poor idea of exploration. Similar titles like the classic GoW games have you exploring every corner of the level for collectables which can increase your health, magic meter, etc. Lord of Shadow is no different, except it's not so much of \"Aha! I see an out-of-the-way path there. Let me check it out.\" It's more like \"Let me walk against the entire edge of this area to see if the invisible wall gives up at any point and let's me into a out-of-view hidden area.\" There is little logic to the hidden itens, you just have to bash Gabriels face against every nook and cranny hoping you'll accidentally stumble uppon a hidden area. It feels more like a chore, not fun or rewarding as in other games. And when you finally DO find the body of a fallen brotherhood knight, only for it to have a scroll instead of a gem... Oh man.\n\nFinally, the color pallete sometimes makes it difficult to see what smaller enemies are doing, like the lesser werewolves or small trolls. So they can get some cheap hits on you.\n\nI'd say 7/10. A fun experience if a bit frustrating every now and then. Haven't played the second game yet (very late, I know), but hopefully it doesn't suffer from the same problems as the first title.", "timestamp_created": 1736277407, "timestamp_updated": 1736277990, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184993243": {"recommendationid": "184993243", "author": {"steamid": "76561199204406242", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 103, "playtime_last_two_weeks": 59, "playtime_at_review": 103, "last_played": 1736227554}, "language": "english", "review": "I really wanted to like this game, but it is just bad. Horrible (locked) camera angles, uninteresting combat, and really phoned in story telling all add up to a truly 'meh' experience. In addition, the levels are frustratingly short and disjointed. Honestly, it feels like the game is a collection of game samples or scrapped attempts. I heard the other games in the series are stand alone and very different, so I will check those out. For this one, I do not recommend.", "timestamp_created": 1736228135, "timestamp_updated": 1736228135, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184988220": {"recommendationid": "184988220", "author": {"steamid": "76561199436005508", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 2334, "playtime_last_two_weeks": 372, "playtime_at_review": 2233, "last_played": 1736263047}, "language": "brazilian", "review": "confesso que não gostei inicialmente, a ideia de ser um \"rebot\" de uma franquia que eu gosto mt me afastou mt desse jogo, mas jogá-lo foi uma experiência incrível, ele não é um jogo que vai apagar pra mim o que os clássicos foram, é uma nova proposta diferente e que me agradou, não achei que fosse gostar tanto mas cá estou eu com 37 horas depois de uma jornada incrível com meu mano gabriel, jogo incrível", "timestamp_created": 1736221481, "timestamp_updated": 1736221481, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184979824": {"recommendationid": "184979824", "author": {"steamid": "76561199171237996", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1240, "playtime_last_two_weeks": 572, "playtime_at_review": 766, "last_played": 1736478063}, "language": "brazilian", "review": "BÃO", "timestamp_created": 1736211941, "timestamp_updated": 1736211941, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184965605": {"recommendationid": "184965605", "author": {"steamid": "76561199128343432", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 1550, "playtime_last_two_weeks": 807, "playtime_at_review": 743, "last_played": 1736988738}, "language": "latam", "review": "es el GOW con vampiros, hombres lobo y muertos vivientes, buenos bosses, buenas skils, buenos graficos y ya me canse", "timestamp_created": 1736198581, "timestamp_updated": 1736198581, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184957858": {"recommendationid": "184957858", "author": {"steamid": "76561198124601741", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 442, "playtime_last_two_weeks": 0, "playtime_at_review": 442, "deck_playtime_at_review": 442, "last_played": 1735979247}, "language": "brazilian", "review": "Jogo fenomenal, sem palavras, reviveu a saga do Castelo com uma nova aparição crepuscular do conde mais temido da terra. O atormentador secular do mundo, que, com seu castelo maldito, sua congregação do mal, pretende punir o mundo mais uma vez. Mas dessa vez a história se aprofunda em diversos aspectos, numa miríade adentrando a Igreja, sociedades perdidas, culturas e mitologias já mortas para construir uma riqueza ainda maior pro universo de Castlevania.", "timestamp_created": 1736192636, "timestamp_updated": 1736192636, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}, "184922917": {"recommendationid": "184922917", "author": {"steamid": "76561198995172013", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1395, "playtime_last_two_weeks": 0, "playtime_at_review": 1395, "last_played": 1735875576}, "language": "german", "review": "Meiner Meinung nach ist das Spiel sehr underrated, es unterscheidet sich zwar stark von den originalen Castlevania Spielen da dies kein Metroidvania Spiel ist wie die meisten zuvor, sonder ein Spiel was ganz klar sich eine \"hauch dünne Scheibe\" (Die Ganze Wurst) von den alten God of War Teilen abgeschnitten hat, kurzgefasst spielst du Gabriel Belmont, bist Monsterjäger und tötest gerne Hals Enthusiasten (Vampire)  und gerne auch die ein oder anderen Alpha Wölfe so wie Unschuldige Mädchen die nichts mit der Situation zutun haben, und hast eine sehr gut erzählte Story. Man merkt das es nicht so gut gealtert ist und ich empfehle das Spiel nur den Leuten die ein Controller zuhause haben.", "timestamp_created": 1736165358, "timestamp_updated": 1736165753, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184899874": {"recommendationid": "184899874", "author": {"steamid": "76561198056131558", "num_games_owned": 282, "num_reviews": 41, "playtime_forever": 1220, "playtime_last_two_weeks": 0, "playtime_at_review": 1220, "last_played": 1736139123}, "language": "russian", "review": "Балдеж балдежом реально.", "timestamp_created": 1736139437, "timestamp_updated": 1736859389, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184898402": {"recommendationid": "184898402", "author": {"steamid": "76561198336009030", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1284, "playtime_last_two_weeks": 780, "playtime_at_review": 503, "last_played": 1737334704}, "language": "spanish", "review": "juego viejo y guapo", "timestamp_created": 1736137445, "timestamp_updated": 1736137445, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184886957": {"recommendationid": "184886957", "author": {"steamid": "76561198858021068", "num_games_owned": 38, "num_reviews": 2, "playtime_forever": 2125, "playtime_last_two_weeks": 0, "playtime_at_review": 2125, "last_played": 1736124392}, "language": "brazilian", "review": "bom", "timestamp_created": 1736124583, "timestamp_updated": 1736124583, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184884494": {"recommendationid": "184884494", "author": {"steamid": "76561197994852092", "num_games_owned": 0, "num_reviews": 61, "playtime_forever": 979, "playtime_last_two_weeks": 0, "playtime_at_review": 831, "last_played": 1736191919}, "language": "english", "review": "7/10", "timestamp_created": 1736122074, "timestamp_updated": 1736122074, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184882218": {"recommendationid": "184882218", "author": {"steamid": "76561199233547310", "num_games_owned": 12, "num_reviews": 5, "playtime_forever": 1543, "playtime_last_two_weeks": 0, "playtime_at_review": 1543, "last_played": 1736119162}, "language": "brazilian", "review": "a melhor coisa desse jogo é a dublagem muito muito bom\r\n", "timestamp_created": 1736119763, "timestamp_updated": 1736119763, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184815986": {"recommendationid": "184815986", "author": {"steamid": "76561198026060499", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 61, "playtime_last_two_weeks": 0, "playtime_at_review": 61, "last_played": 1736063994}, "language": "english", "review": "I’m sorry but this is a terrible game.  I love castlevania and I’ve played the classics.  I even really enjoyed LOS2,  but the sheer amount of bullshit in this game is insurmountable.  The quick time events are what sealed the deal on getting a refund.", "timestamp_created": 1736064570, "timestamp_updated": 1736064570, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184802938": {"recommendationid": "184802938", "author": {"steamid": "76561198040817288", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 911, "playtime_last_two_weeks": 478, "playtime_at_review": 494, "last_played": 1737269857}, "language": "english", "review": "T\\his spinoff series its a hit or miss, I love classic Castlevania,but this mini series was quite entertaining, combat is good, story its really entertaining, visually its eye candy there is not a single environment that doesn't look amazing AND you get all DLC in one package, sountrack has this epic vibe that lets you immerse in this epic quest to defeat the world's evils", "timestamp_created": 1736050072, "timestamp_updated": 1736314599, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184798960": {"recommendationid": "184798960", "author": {"steamid": "76561199116500805", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 2238, "playtime_last_two_weeks": 103, "playtime_at_review": 2134, "last_played": 1736557382}, "language": "latam", "review": "El juego esta infravalorado por salir casi a la par que god of war 3 y tener  casi el mismo sistema de combate .", "timestamp_created": 1736046310, "timestamp_updated": 1736046310, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184781707": {"recommendationid": "184781707", "author": {"steamid": "76561199544926189", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1817, "playtime_last_two_weeks": 351, "playtime_at_review": 946, "last_played": 1736642099}, "language": "spanish", "review": "Me gusta la parte inicial, la historia, tienes puzzzles muy interesantes de resolver,las 2 baras de energía dan un plus de estrategia", "timestamp_created": 1736029911, "timestamp_updated": 1736029911, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184779423": {"recommendationid": "184779423", "author": {"steamid": "76561198127915644", "num_games_owned": 140, "num_reviews": 34, "playtime_forever": 1864, "playtime_last_two_weeks": 485, "playtime_at_review": 1362, "last_played": 1736854425}, "language": "russian", "review": "9/10\n\n(Из-за последнего босса 2го длс 9/10, слишком сложный, больше ста попыток, как будто в Дарк Соулс поиграл. Бой с боссом был с пол хп и без магии, классно меня закинуло)  если бы было полное хп и магия, думаю было бы изи, может попробую в будущем. А так, 10/10 \n\nИгра огонь!", "timestamp_created": 1736028101, "timestamp_updated": 1736028101, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184770138": {"recommendationid": "184770138", "author": {"steamid": "76561199253342856", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 2827, "playtime_last_two_weeks": 0, "playtime_at_review": 2634, "last_played": 1736041436}, "language": "latam", "review": "no mames, hize 50 horas en un dia , tremendo juegazo", "timestamp_created": 1736020934, "timestamp_updated": 1736020934, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184655892": {"recommendationid": "184655892", "author": {"steamid": "76561199522874465", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1536, "playtime_last_two_weeks": 29, "playtime_at_review": 1506, "last_played": 1736952854}, "language": "english", "review": "Good ol devil may cry/GOW violence", "timestamp_created": 1735921837, "timestamp_updated": 1735921837, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184602384": {"recommendationid": "184602384", "author": {"steamid": "76561198306043107", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1989, "playtime_last_two_weeks": 0, "playtime_at_review": 1989, "last_played": 1735884557}, "language": "latam", "review": "El mejor juego .\r\n", "timestamp_created": 1735884605, "timestamp_updated": 1735884605, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184569878": {"recommendationid": "184569878", "author": {"steamid": "76561199524820459", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 361, "playtime_last_two_weeks": 65, "playtime_at_review": 295, "last_played": 1736627141}, "language": "brazilian", "review": "isso é castlevania meus amigos !!!!", "timestamp_created": 1735853565, "timestamp_updated": 1735853565, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184529201": {"recommendationid": "184529201", "author": {"steamid": "76561198854090729", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 6397, "playtime_last_two_weeks": 1097, "playtime_at_review": 4317, "last_played": 1737229925}, "language": "brazilian", "review": "Falta dublagem", "timestamp_created": 1735824228, "timestamp_updated": 1735824228, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184520331": {"recommendationid": "184520331", "author": {"steamid": "76561198116605956", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 253, "playtime_last_two_weeks": 0, "playtime_at_review": 253, "deck_playtime_at_review": 253, "last_played": 1730474386}, "language": "english", "review": "This might have been good in 2013. It's not good in 2025.\n\nThe Castlevania series has always been a bit hit-and-miss for me. (I enjoy the PS1/GBA era of games, but not necessarily much before or since.) This one is essentially like an early God of War (the original trilogy, not the reinvented duology), but with the bosses of Shadow of the Colossus...except that the boss fights here manage to be excruciating, rather than clever or interesting or puzzling. (I loved Colossus, by the way - just to give you a bit of context for that statement.)\n\nLords of Shadow has a cool vibe/aesthetic if you can forgive the PS3-era graphics. (They don't bother me, but they certainly aren't nearly up to snuff by today's standards...nor the past 10ish years' standards.) Good soundtrack too, but the rest of the sound design (voice acting and such) is questionable at best.\n\nThe level design and camera are unpleasant, but manageable. Combat is passable (except for the bosses), but nothing particularly exciting. And the progression system (i.e. getting new abilities that allow you to open previously inaccessible routes) is annoying. (I generally love this in a game - such as you find in other Metroidvanias - but it's implemented quite poorly here.)\n\nAll in all, I can't in good conscience recommend this if you're coming to it for the first time today. It simply hasn't aged well. Everything about it is a product of its time. But if you're a big fan of the era or the series, you could do worse.\n\nThat said, if you want a similar game from the era that still holds up well today, I'd definitely recommend DMC over this. It's a smoother experience, and with much less questionable design choices.\n\nFor what it's worth, Lords of Shadow plays well on a Steam Deck.", "timestamp_created": 1735816015, "timestamp_updated": 1735816015, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}, "184510744": {"recommendationid": "184510744", "author": {"steamid": "76561199501400076", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 58, "playtime_last_two_weeks": 0, "playtime_at_review": 58, "last_played": 1695395239}, "language": "russian", "review": "Были проблемы с запуском игра баговалась и модельки либо теряли цвета, либо растягивались на экран. Почитал у многих такая проблема и что бы исправить вам конкретно нужно танцевать с бубном короче оптимизации нету! Так что если у вас слабый ПК и вы видите системные требования и думаете (щас запущу кайфану) то нет закатай губёнку. Ну или танцуйте с бубном.", "timestamp_created": 1735805185, "timestamp_updated": 1735805185, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.490196079015731812", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184479865": {"recommendationid": "184479865", "author": {"steamid": "76561199421599508", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 370, "playtime_last_two_weeks": 0, "playtime_at_review": 370, "last_played": 1734136955}, "language": "spanish", "review": "excelente es un juegaso saludos desde mi bella guatemala", "timestamp_created": 1735775808, "timestamp_updated": 1735775808, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184452542": {"recommendationid": "184452542", "author": {"steamid": "76561198081487657", "num_games_owned": 0, "num_reviews": 17, "playtime_forever": 460, "playtime_last_two_weeks": 0, "playtime_at_review": 456, "last_played": 1735757353}, "language": "brazilian", "review": "Joguinho \"bão\"!", "timestamp_created": 1735755533, "timestamp_updated": 1735755533, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184420930": {"recommendationid": "184420930", "author": {"steamid": "76561198930952480", "num_games_owned": 14, "num_reviews": 1, "playtime_forever": 1238, "playtime_last_two_weeks": 0, "playtime_at_review": 1126, "last_played": 1736024421}, "language": "brazilian", "review": "massa", "timestamp_created": 1735731478, "timestamp_updated": 1735731478, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184365645": {"recommendationid": "184365645", "author": {"steamid": "76561198092293096", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 887, "playtime_last_two_weeks": 0, "playtime_at_review": 887, "last_played": 1735671507}, "language": "english", "review": "Maybe this game was \"good\" for the time it was made for but now it is a terrible experience. Everything is uninspired and annoying with little to no creativity.\r\n\r\nMap design is awful. Most of the time you will have no idea where to go because the camera is locked in a single direction but unlike most other games that do locked camera, angles 90% of the time don't show you anything. There were so many instances where I would find a secret by accident thinking that was the way to go because somehow they managed to hide the real path better than secrets.\r\n\r\nCombat is so simple you can probably beat it with one hand. Combat is extremely similar to god of war. You have 2 swings, one wide and one singlurar, just spam singular target and you will win. Main annoyance here comes from the fact that enemies have too much health. Sometimes it felt like I was trying to break a brick wall with my face. Last 3 levels I turned difficulty to easy because I just wanted it to end. \r\n\r\nArt design is... why... Everything looks same. Enemy design is so bad I started predicting the next enemy and was correct every time. You see a skeleton? Now think about a bigger skeleton. Not even joking that's the enemies every time. First fight small then it gets big and all looks the same. Even enemy names are generic and uninspired. \r\n\r\nStory is so bad I started having a brain aneurysm. Gabriel says I will never do x and give him literally 2 cutscenes and he will be like \"I never liked x anyways\". Gabriel himself might be one of the worst characters I've ever seen in my life. He is just extremely dumb and annoying whenever he speaks. But hey at least it gave me a few laughs thanks to how bad it was.\r\n\r\nDon't play it even if you feel nostalgic. I promise you, it is not as good as you remember.", "timestamp_created": 1735678322, "timestamp_updated": 1735678322, "voted_up": false, "votes_up": 1, "votes_funny": 2, "weighted_vote_score": "0.47826087474822998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184300954": {"recommendationid": "184300954", "author": {"steamid": "76561199268344502", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 62, "playtime_last_two_weeks": 0, "playtime_at_review": 62, "last_played": 1735528288}, "language": "russian", "review": "Хуйня репак на комп. переделывайте", "timestamp_created": 1735629752, "timestamp_updated": 1735629752, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.490196079015731812", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184295441": {"recommendationid": "184295441", "author": {"steamid": "76561198149088054", "num_games_owned": 441, "num_reviews": 45, "playtime_forever": 1178, "playtime_last_two_weeks": 0, "playtime_at_review": 1178, "last_played": 1658356050}, "language": "english", "review": "I remember this game with rose colored glasses. While it is still a fun game to go back to. Please note it is a lot clunkier than you probably remember. Some of the  bosses are so broken you will rage.\nStill generally fun and challenging however try to not play it with nostalgia in mind", "timestamp_created": 1735624796, "timestamp_updated": 1735624796, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184230141": {"recommendationid": "184230141", "author": {"steamid": "76561198017428923", "num_games_owned": 666, "num_reviews": 121, "playtime_forever": 2356, "playtime_last_two_weeks": 0, "playtime_at_review": 2356, "last_played": 1735570774}, "language": "english", "review": "Castlevania: Lords of Shadow is the perfect example of a game that could be great, but it's held back by the poor design choices. This game was first released in 2010 as a console exclusive and it was ported in 2013 to PC as \"Ultimate Edition\", the current PC version, including the DLCs.\n\nI'll start with the positives. The game is probably the best played on a Controller, however it's totally fine to play with Mouse and Keyboard, I personally didn't have any issue after rebinding the default keys. Sure, some mechanics might feel odd and counter intuitive because they are specifically designed for joysticks (for example the throwback quick time event where you have to rotate your stick), but it shouldn't hinder your gaming experience. The gameplay is similar to God of War and probably that's the main reason why I ended up enjoying it, the weapon, quick items and combos are satisfying and some of the bossfights can feel like playing a souls game where you \"dance\" with the boss, dodging the patterns and finding a window to attack. The parkour was surprisingly good, I didn't have any problem traversing the map, it felt very accurate compared to other modern games (maybe that's an effect of the fixed camera angles?). The story was interesting enough to keep me entertained and the atmosphere created by the setting, cinematics and music was on point, it was exactly what I would expect from a Castlevania game after watching the Netflix show. Checkpoints were generous, some of the puzzles were great and you can always choose to see the solution if you're stuck.\n\nNow the negatives and the reason why I think that this game didn't age well. The game feels clunky a lot of the times, the Paladin difficulty is a joke when you can grab the small enemies and instantly kill them while having infinite i-frames. I don't mind cheesing bosses with tools that the game gives you, like the Fairies and Holy Water, especially when they are limited, but the fact that your Health/Light Magic/Shadow Magic carries over to the next level is such an outdated mechanic. Imagine you are 1HP at the end of the level and you start the next level with nothing, that doesn't feel right... you can replay another level to increase the bars, but that's wasted time for a bad design choice. Some level design is awful, there were often times when I had to search the internet for a section where I was stuck because I couldn't find the way forward. Everyone laughed at Resident Evil when they added the yellow tape around objects to mark what is breakable and what not, making it insanely easy for anyone, but this game desperately needs something like that. And don't get me started with some bullshit areas full of traps like The Music Box or the Clock Tower, I hope the designer for that got fired along with the developer who thought it's a good idea to be able to attack the final boss of the DLC only by using double jumps while he has 2 AoE attacks around him and having no movement control while mid air.\n\nI rate this game a solid 6/10, the worst game I actually enjoyed. Definitely buy it on a sale if you want tot try out the Castlevania franchise.", "timestamp_created": 1735573948, "timestamp_updated": 1735573948, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184195522": {"recommendationid": "184195522", "author": {"steamid": "76561198090616312", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2429, "playtime_last_two_weeks": 0, "playtime_at_review": 2248, "last_played": 1735890104}, "language": "english", "review": "A fantastic take on Castlevania. Art, gameplay, story, music, it was a great experience and would definitely recommend. \r\nIt's a shame what happened to the studio after this. I would definitely like to see another Castlevania that feels like Lords of Shadow.", "timestamp_created": 1735542390, "timestamp_updated": 1735542390, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184183865": {"recommendationid": "184183865", "author": {"steamid": "76561199139230895", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1404, "playtime_last_two_weeks": 1, "playtime_at_review": 1403, "last_played": 1737086597}, "language": "latam", "review": "Un juegazo superior a la segunda entrega. CLoS uno de los mejores Castlevania de todos los tiempos.", "timestamp_created": 1735530700, "timestamp_updated": 1735530700, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184176250": {"recommendationid": "184176250", "author": {"steamid": "76561198066255843", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 1549, "playtime_last_two_weeks": 0, "playtime_at_review": 1549, "last_played": 1670063549}, "language": "english", "review": "It's a cool game, definitely worth your time! DLC is a bit hard though", "timestamp_created": 1735523865, "timestamp_updated": 1735523865, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184172369": {"recommendationid": "184172369", "author": {"steamid": "76561198151252900", "num_games_owned": 286, "num_reviews": 29, "playtime_forever": 4902, "playtime_last_two_weeks": 0, "playtime_at_review": 4902, "last_played": 1735499568}, "language": "latam", "review": "Un juego que se conserva muy bien en múltiples aspectos. En el aspecto artístico está fantástico y en jugabilidad hace muy bien el combinar el estilo de combate y mejoras (tanto de personaje como de armas) de los God of War clásicos o hack and slash, y adaptarlo al estilo de los Souls, con algunos de sus jefes, sus patrones de combate, el rodar, bloquear y parry. No cuestan resistencia, y eso lo hace más tranquilo en cualquier dificultad. No es fácil, pero tampoco imposible. Me gustó. ʢ♥Ѡ♥ʡ ┌|ﾟзﾟ|┘└|ﾟεﾟ|┐", "timestamp_created": 1735520711, "timestamp_updated": 1735520711, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184172038": {"recommendationid": "184172038", "author": {"steamid": "76561198969064369", "num_games_owned": 57, "num_reviews": 47, "playtime_forever": 340, "playtime_last_two_weeks": 0, "playtime_at_review": 340, "deck_playtime_at_review": 339, "last_played": 1735092657}, "language": "english", "review": "Yes", "timestamp_created": 1735520475, "timestamp_updated": 1735520475, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}, "184161797": {"recommendationid": "184161797", "author": {"steamid": "76561198088427134", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 2528, "playtime_last_two_weeks": 0, "playtime_at_review": 2508, "last_played": 1735513965}, "language": "brazilian", "review": "Very good", "timestamp_created": 1735512285, "timestamp_updated": 1735512285, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184150837": {"recommendationid": "184150837", "author": {"steamid": "76561198099971133", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 733, "playtime_last_two_weeks": 0, "playtime_at_review": 672, "last_played": 1735508366}, "language": "russian", "review": "Она очень скучная и однообразная , все боссы почти одинаковые куча уклонов от атак потом ты бьёшь пару раз  потом опять уклоны ... Лазать по стена отдельная нудятина , (занимает много времени ),  что бы все собрать и получить все камни придётся не раз проходить игру... Очень не удобная камера, не приятное управление , (если ты играешь на клавиатуре ), некоторые бои с боссами будут крайне нервировать по причине поймай камень и быстро  нажми кнопки по часовой стрелки... Плюс в игре есть , красивая графика и хороший сюжет.", "timestamp_created": 1735504423, "timestamp_updated": 1735504423, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.448247730731964111", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184136709": {"recommendationid": "184136709", "author": {"steamid": "76561198079106500", "num_games_owned": 0, "num_reviews": 327, "playtime_forever": 161, "playtime_last_two_weeks": 0, "playtime_at_review": 161, "last_played": 1621735701}, "language": "english", "review": "[Gordoniankid]\r\nCastlevania Lords of Shadow Review | This game was hated?\r\nhttps://youtu.be/D5g8y_1EEK4", "timestamp_created": 1735497745, "timestamp_updated": 1735497745, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184096298": {"recommendationid": "184096298", "author": {"steamid": "76561198069552560", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 7359, "playtime_last_two_weeks": 0, "playtime_at_review": 7359, "last_played": 1683313632}, "language": "russian", "review": "Оличный слэшер! История Гэбриеля Бельмонта хорошо раскрыта, крутая боёвка... Что ещё надо?) Всем советую!!!", "timestamp_created": 1735478220, "timestamp_updated": 1735478220, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184073169": {"recommendationid": "184073169", "author": {"steamid": "76561198885997205", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 639, "playtime_last_two_weeks": 206, "playtime_at_review": 259, "last_played": 1736691790}, "language": "english", "review": "Its Amazing !", "timestamp_created": 1735457111, "timestamp_updated": 1735457111, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184047832": {"recommendationid": "184047832", "author": {"steamid": "76561198359055973", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 3005, "playtime_last_two_weeks": 0, "playtime_at_review": 3005, "last_played": 1728604552}, "language": "brazilian", "review": "Com belos gráficos, combate único, câmera bem posicionada, e sua história mesmo sendo diferente da série Castlevania. Acaba sendo sim, um bom jogo e muito divertido, conforme você vai jogando, vai encontrando mais facilidade em seu combate. Mas claro que nem todos vão gostar do jogo, pois acaba sendo um jogo de fases, e o que mais te prende é sua história e seu combate. Sua platina é um pouco cansativa, mas acaba sendo até que divertida.\r\n NOTA: 07/10", "timestamp_created": 1735433934, "timestamp_updated": 1735433934, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184044267": {"recommendationid": "184044267", "author": {"steamid": "76561198076541944", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1748, "playtime_last_two_weeks": 660, "playtime_at_review": 602, "last_played": 1736695230}, "language": "brazilian", "review": "Muito bom!", "timestamp_created": 1735430922, "timestamp_updated": 1735430922, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183995844": {"recommendationid": "183995844", "author": {"steamid": "76561198214222283", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2146, "playtime_last_two_weeks": 0, "playtime_at_review": 2027, "last_played": 1735405337}, "language": "german", "review": "Es ist auch 2024 noch ein tolles Spiel!", "timestamp_created": 1735398317, "timestamp_updated": 1735398317, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183962865": {"recommendationid": "183962865", "author": {"steamid": "76561199192531883", "num_games_owned": 0, "num_reviews": 65, "playtime_forever": 67, "playtime_last_two_weeks": 0, "playtime_at_review": 67, "deck_playtime_at_review": 41, "last_played": 1726960061}, "language": "english", "review": "It's Castlevania, need I say more, its a epic game, aged ok, but awesome game, so is the second.", "timestamp_created": 1735372487, "timestamp_updated": 1735372487, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.513513505458831787", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}, "183941281": {"recommendationid": "183941281", "author": {"steamid": "76561198219523899", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1908, "playtime_last_two_weeks": 0, "playtime_at_review": 1908, "last_played": 1735352531}, "language": "brazilian", "review": "É um pouco travado, o que me fez morrer varias vezes pulando no lugar errado, mas é um bom jogo", "timestamp_created": 1735352676, "timestamp_updated": 1735352676, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183917770": {"recommendationid": "183917770", "author": {"steamid": "76561199644679492", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2005, "playtime_last_two_weeks": 0, "playtime_at_review": 742, "last_played": 1735517248}, "language": "brazilian", "review": "jogo muito foda\r\n", "timestamp_created": 1735334398, "timestamp_updated": 1735334398, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183909350": {"recommendationid": "183909350", "author": {"steamid": "76561198083272491", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 807, "playtime_last_two_weeks": 0, "playtime_at_review": 206, "last_played": 1735734543}, "language": "greek", "review": "ακόμα και σήμερα το παιχνίδι είναι πανέμορφο. πολυ καλοδουλεμένο game play και πολυ καλό story", "timestamp_created": 1735328754, "timestamp_updated": 1735328754, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183891460": {"recommendationid": "183891460", "author": {"steamid": "76561198893258980", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1332, "playtime_last_two_weeks": 0, "playtime_at_review": 1332, "last_played": 1735316470}, "language": "brazilian", "review": "Apesar dos controles mais duros e as vezes você acabar morrendo por causa disso, como zerei dark souls 1, estou acostumado a esse tipo de coisa", "timestamp_created": 1735316569, "timestamp_updated": 1735316569, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183772695": {"recommendationid": "183772695", "author": {"steamid": "76561199653798135", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 254, "playtime_last_two_weeks": 0, "playtime_at_review": 234, "last_played": 1735659275}, "language": "german", "review": "Sehr gutes Spiel", "timestamp_created": 1735232986, "timestamp_updated": 1735232986, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183751897": {"recommendationid": "183751897", "author": {"steamid": "76561199564021790", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2082, "playtime_last_two_weeks": 0, "playtime_at_review": 2082, "last_played": 1735217844}, "language": "greek", "review": "I have played 90% of the castlevania games and it's sad to see that this spinoff is worst than the original but i'll start with the positives first:\r\n\r\n-The game is beautiful, i found myself stop to admire the the eviroment and the longs shots of the camera to show giant structures and gliffs \r\n-I liked the holy water subweapon \r\n-The usage of light and shadow magic was kinda cool mechanic but i dont really see myself wanting it to come back \r\n-The DRIP is simply stupendous\r\n\r\nThe Negative:\r\n\r\n-Most of the boss/mini bosses fights sucked with The Forgotten one being the if not the worst the second worst \r\n-The sucks not bcs it like god of war but bcs theyare some missing aspects like when you upgrade your blades you get more damage and new move, in this game the combat cross even though it feels one of kratos's blades you can deals more damage unless you use shadow magic\r\n-The relics are kinda funky, the glove is forgetable tool in combat, the boots are meh bcs i tidious have to double tap L3 just to sprint for a short range and the wings suck bcs in combat your jump is ok but double jump gets way to high\r\n-QTE's are worst than the first god of war, is unnecessary to have qte when you grab and enemy plus having the circle every time a qte happens bcs it takes away the need for the player to be focused on pressing the other buttons especially when the other buttons are appear for button smashing\r\n-There in no Cross subweapon\r\n-The combos suck bcs 99% of them make your character stationery against fast enemies that always outnumber youare more tanky and are unfazed to getting hit \r\n-The perfect parry mechanic and the amulet suck bcs its a high risk low reward since there's no point to use parry to charge the amulet when a single hit can send it to zero \r\n-Voice acting and dialoge it's just bad most of the times\r\n \r\ni have already said enough so here is my last words: Take a good 4/10 and go spend your money on the advanced and the dominous collections", "timestamp_created": 1735220608, "timestamp_updated": 1735220608, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183699162": {"recommendationid": "183699162", "author": {"steamid": "76561199096821974", "num_games_owned": 54, "num_reviews": 4, "playtime_forever": 2325, "playtime_last_two_weeks": 0, "playtime_at_review": 1284, "last_played": 1735797482}, "language": "brazilian", "review": "sim jogo bom da poura, vale a pena ler as telas de loading e os pergaminhos dos cadaveres.", "timestamp_created": 1735168971, "timestamp_updated": 1735168971, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183615218": {"recommendationid": "183615218", "author": {"steamid": "76561199778203255", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 721, "playtime_last_two_weeks": 0, "playtime_at_review": 588, "last_played": 1735691657}, "language": "brazilian", "review": "Toooop", "timestamp_created": 1735094358, "timestamp_updated": 1735094358, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183580399": {"recommendationid": "183580399", "author": {"steamid": "76561198274442106", "num_games_owned": 82, "num_reviews": 1, "playtime_forever": 1069, "playtime_last_two_weeks": 0, "playtime_at_review": 1069, "last_played": 1734973817}, "language": "spanish", "review": "juegazo", "timestamp_created": 1735058521, "timestamp_updated": 1735058521, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183572857": {"recommendationid": "183572857", "author": {"steamid": "76561199089813727", "num_games_owned": 0, "num_reviews": 42, "playtime_forever": 541, "playtime_last_two_weeks": 0, "playtime_at_review": 541, "last_played": 1735052265}, "language": "latam", "review": "The people who made this game never played or cared about an actual Castlevania game.\r\n\r\nThe action part of it is not hard, it's just frustrating. Fighting enemies just doesn't feel good.\r\n\r\nI hope next time they make a soulslike Castlevania with actual gothic themes and setpieces. This world of war high fantasy bullshit just doesn't go well with Castlevania.", "timestamp_created": 1735052555, "timestamp_updated": 1735052555, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183552773": {"recommendationid": "183552773", "author": {"steamid": "76561198076128798", "num_games_owned": 446, "num_reviews": 86, "playtime_forever": 1616, "playtime_last_two_weeks": 0, "playtime_at_review": 1616, "last_played": 1595348752}, "language": "english", "review": "The game isn’t worth 25 euros. The gameplay feels repetitive, the combat clunky, and the pacing slow, making it hard to justify the price.", "timestamp_created": 1735033332, "timestamp_updated": 1735033332, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.503521084785461426", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 7198, "total_negative": 1718, "total_reviews": 8916}, "cursors": {"AoJw9YfHqJMDfaXwrAU=": "Mon Jan 20 16:27:54 2025"}}
