{"reviews": {"186019692": {"recommendationid": "186019692", "author": {"steamid": "76561198012549336", "num_games_owned": 72, "num_reviews": 29, "playtime_forever": 2940, "playtime_last_two_weeks": 0, "playtime_at_review": 2940, "last_played": 1571688109}, "language": "russian", "review": "Nep nep", "timestamp_created": 1737384690, "timestamp_updated": 1737384690, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185832849": {"recommendationid": "185832849", "author": {"steamid": "76561199044405419", "num_games_owned": 93, "num_reviews": 21, "playtime_forever": 5984, "playtime_last_two_weeks": 1952, "playtime_at_review": 5984, "last_played": 1737176015}, "language": "spanish", "review": "De los tres \"Re:Birth\" por mucho este es el mejor, la optimización del minijuego de Estella facilita bastante el gameplay. En caso de la historia este re:birth progresa de manera significativa, es demasiado genial enfrentarte a un enemigo como Rei, por mucho recomiendo jugarlo. En lo personal considero que el culo de Uni es maravillosamente magnifico, y las tetas de Rei son apantallantes, jugar esto y platinarlo fue la mejor elección de mi vida, el culo de Uni hace que todo valga la pena.", "timestamp_created": 1737176525, "timestamp_updated": 1737176525, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185554759": {"recommendationid": "185554759", "author": {"steamid": "76561198954108537", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 1121, "playtime_last_two_weeks": 1121, "playtime_at_review": 236, "last_played": 1737338742}, "language": "english", "review": "Nep Nep Nep", "timestamp_created": 1736828137, "timestamp_updated": 1736828137, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185471157": {"recommendationid": "185471157", "author": {"steamid": "76561198317040745", "num_games_owned": 0, "num_reviews": 23, "playtime_forever": 2775, "playtime_last_two_weeks": 0, "playtime_at_review": 2775, "last_played": 1735058641}, "language": "english", "review": "In my view, the weakest entry in the series.\n\nFor someone like me who has played all three Re;Birth games, and is currently halfway through VII, I can confidently say that this game has been not only been the worst story experience out of all, but also the only case in which I found the game an overall negative experience.\n\nWhile I disliked the grindfest that was Re;Birth 1, and the lacking story in Re;Birth 2, neither of these elements were bad enough to where it made me dislike the game as a whole... but this time it's different.\n\n[h3]Overview[/h3]\nNeptune gets isekai'd (sent to another dimension), and needs to find her way back, while navigating the challenges that present themselves in this somehow different, but also somehow similar place.\n\nSounds fair enough, if it wasn't for some issues...\n\n[h3]Out of character[/h3]\nBased on my experiences with the previous (and following) games, it seems that some of the characters are actually out-of-character for sizable portions of the game.\n\nNow, you may reply [i]\"Well, they're from another dimension, so maybe that's why\"[/i], which would make sense if Neptune (who is not from that dimension) wasn't the one who was most out of character of them all.\n\nJust one such case is that, for around the first 1/4 of the game, Neptune wants to do nothing but laze around and sleep, and is only pushed into action by other people who are fed up with her idleness.\n\nWe're talking about the same Neptune who is known for her child-like personality and who would constantly do the most random things in the other games.\n(Like that one time when she wanted to ride a roller coaster in Re;Birth 2, but wasn't tall enough to be let in, so she transformed into her CPU form in which she is taller... only to then find out that since she has a more mature personality in her CPU form, she didn't enjoy the ride nearly as much.)\n\nThat's the sort of Neptune-like randomness you would expect, and is in stark contrast to her boring, idle personality in this game.\nShe does explain that she dislikes working (doing quests and such) and doesn't want to do it, but even then, she would still want to do other things, not just sit around and sleep.\n\n[h3]Even more out of character...[/h3]\nAside from Neptune, there is also the case of Nepgear...\n\nWhile Nepgear herself is actually fairly consistently in-character, what is out-of-character is how almost everyone responds to her and her actions.\n\nIt appears that the writers wanted to somehow respond to how relatively unpopular Nepgear was as a protagonist in Re;Birth 2, and so they decided to turn her entire existence in this game into a joke (and I'm not exaggerating).\n\nEvery time Nepgear does something, she is treated with either indifference or hostility, even by her supposed \"allies\" and her own sister.\nThis makes no sense, as in Re;Birth 2, she was portrayed as a somewhat insecure, but nonetheless reliable and likeable personality, who had a good heart and wanted to do what's best for everyone.\nI do not recall anyone disliking her (other than temporarily).\n\nBut Re;Birth 3 wants to tell us that nobody likes her - there is even a scene in which Nepgear uses her technological expertise to find an important item in one of the CPUs' homes, which allows the story to advance, but instead of thanking her, the CPUs pick on her because of how much of a nerd she is... it makes no sense.\n\n[h3]Plutia[/h3]\nYes, this one gets its own section.\n\nWhile there is division in the fan base about whether Plutia is a likable character or not, there is something more objective which is wrong with her presence in this game.\n\nThis being that she has the personality of an antagonist, while being treated as a protagonist for some reason.\nThroughout the game, she is entirely selfish, and on a number of occasions outright admits that she is only in it for herself - not only that, but she literally commits acts of sexual harassment against not only her enemies, but against her supposed \"allies\" as well.\n\nMeanwhile, the other party members (in spite of their opposition) do nothing to stop her, even when they outnumber her, and/or are stronger individually as well.\n\nSo you're trying to tell me about how evil the antagonists are, while the protagonists have a team member that does all this evil shit uninterrupted by any of them?!\n(This is another instance of the protagonists being out of character.)\n\nPlutia's personality and behavior is actually very similar to that of the main antagonist of this game, which makes her treatment as a protagonist absolutely nonsensical.\n\n(And there is no interesting moral conflict behind this either, Plutia literally just gets away with these things without much of a justification from any of the protagonists.)\n\n[h3]Plot holes[/h3]\nFinally, plot holes... mostly involving the antagonists.\n\nRe;Birth 3 features a variety of different antagonists - some old, some new.\n\nAs you would expect, you end up fighting those antagonists... but not only once... since for some reason the protagonists decide to constantly let them get away (either through some excuse, or even entirely off-screen, without any explanation).\n\nSome of these antagonists, you end up fighting 2 or 3 times, before you finally get to the end of the game... and after around chapter 6 (out of 10) I had to completely ignore the main story arch and focus on the banter between the main characters in order to retain any interest in continuing to play this thing, because of just how ridiculous things got...\n\nThey are your enemies - if you don't want to kill them (even though they want to kill you), then at the very least throw them in jail or something, but don't just let them go after defeating them!!\n(You know exactly what they're going to do afterwards!!)\n\n[h3]TL;DR[/h3]\nStory doesn't make much sense due to plot holes involving antagonists simply being let go without punishment in many cases (only to then attack again), as well as a number of protagonists being out-of-character for substantial periods of the game.\n\nIf you've made it this far in the Re;Birth series, you know that their gameplay mechanics are just copy/pastes of each other with very little change, so there's no need to even talk about those.\n", "timestamp_created": 1736717839, "timestamp_updated": 1736717839, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185203283": {"recommendationid": "185203283", "author": {"steamid": "76561198097126228", "num_games_owned": 317, "num_reviews": 79, "playtime_forever": 2186, "playtime_last_two_weeks": 490, "playtime_at_review": 2186, "last_played": 1736450998}, "language": "polish", "review": "", "timestamp_created": 1736451005, "timestamp_updated": 1736451005, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185167141": {"recommendationid": "185167141", "author": {"steamid": "76561199007117569", "num_games_owned": 19, "num_reviews": 1, "playtime_forever": 3732, "playtime_last_two_weeks": 2437, "playtime_at_review": 1915, "last_played": 1737209269}, "language": "japanese", "review": "まだ見ていないEDのCGが解放されてネタバレを食らったこと以外は特に不満はないです。", "timestamp_created": 1736409484, "timestamp_updated": 1736409484, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184963927": {"recommendationid": "184963927", "author": {"steamid": "76561198451718159", "num_games_owned": 287, "num_reviews": 18, "playtime_forever": 1909, "playtime_last_two_weeks": 103, "playtime_at_review": 1806, "last_played": 1736301808}, "language": "english", "review": "Plutia", "timestamp_created": 1736197225, "timestamp_updated": 1736197225, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184743751": {"recommendationid": "184743751", "author": {"steamid": "76561198885289835", "num_games_owned": 178, "num_reviews": 28, "playtime_forever": 2865, "playtime_last_two_weeks": 0, "playtime_at_review": 2865, "last_played": 1735758334}, "language": "french", "review": "Ce que j'apprécie avec ce jeu c'est que c'est une claire évolution par rapport aux précédents opus.\nLes menus sont bien plus attirants et colorés, le système de combat est repris des jeux originaux ce qui fait que l'utilisation d'items est bien plus élaborée (pas autant que les jeux originaux). L'histoire est super bien et fun. Le jeu est bien plus rapide en terme de contrôle que les précédents.\nEt surtout, les ajouts que j'ai adoré, les stats qui augmentent en fonction de ce qu'on fait avec chaque perso, c'est tout bête mais c'est super bien. Les donjons sont aussi pour la majorité plutôt biens, meilleurs qu'avant ça c'est sur même si on en a qui sont répétés dans les trois jeux, mais à j'ai senti plus de variété et c'est bien.\n\nEn résumé, très bonne histoire toujours dans l'humour et dans l'absurde mais qui reste cependant la meilleure de la trilogie, très bon UI et mécaniques de gameplay, des donjons très sympas bien que parfois répétitifs, un système de combat bien plus abouti que les opus précédents.\nSi vous avez aimé les deux opus précédents, foncez sur celui là, il est très très bien!", "timestamp_created": 1736001991, "timestamp_updated": 1736002045, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184491721": {"recommendationid": "184491721", "author": {"steamid": "76561199047054371", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 855, "playtime_last_two_weeks": 0, "playtime_at_review": 583, "last_played": 1735850142}, "language": "english", "review": "‎", "timestamp_created": 1735786268, "timestamp_updated": 1735786268, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184087040": {"recommendationid": "184087040", "author": {"steamid": "76561198199598763", "num_games_owned": 315, "num_reviews": 67, "playtime_forever": 4233, "playtime_last_two_weeks": 0, "playtime_at_review": 4233, "last_played": 1713375184}, "language": "english", "review": "I love Plutia but frick this game\n\nIt has the worst pacing, the worst combat (they combined EXE drive and SP into one which is so god damn stupid), the story is trash, the dlcs are dumb, it needs a patch to work and the main villain is boring as shit\n\nI love nepnep and i love Plutia but god i hate this + the post game is just impossible hard to the sake of being hard", "timestamp_created": 1735470521, "timestamp_updated": 1735470521, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183883253": {"recommendationid": "183883253", "author": {"steamid": "76561198877933201", "num_games_owned": 50, "num_reviews": 17, "playtime_forever": 853, "playtime_last_two_weeks": 0, "playtime_at_review": 853, "last_played": 1735311401}, "language": "english", "review": "Nep Nep Nep", "timestamp_created": 1735311461, "timestamp_updated": 1735311461, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183524297": {"recommendationid": "183524297", "author": {"steamid": "76561198920482556", "num_games_owned": 0, "num_reviews": 75, "playtime_forever": 3198, "playtime_last_two_weeks": 0, "playtime_at_review": 3198, "last_played": 1734998809}, "language": "english", "review": "Story:\n\nThis one involves two worlds, connecting to the fallen nation by a CPU that went insane and destroyed it through their tyranny. That's pretty much the gist of it, as this is what it was building up. Honestly, storywise, it is one of the worst in the entire series. Makes for some okay humor though.\n\nSystem:\n\nSame as the rest with slight improvements. Not much to say there, it just works.\n\nMusic:\n\nGood.\n\nArt Style:\n\nGood.\n\nReason to Play It:\n\nIt is a direct link into VII, the game with the best story I'd say. With Rebirth 1 coming in second.\n\nProblems:\n\nIt failed to balance humor like rebirth one did, failed to execute serious scenes like Rebirth 1 and 2 did. I've said this before in narrative driven games that has sequels. Multiple Endings just hurts it, I mean this game links into VII. Multiple Endings just harms the experience. It is actually a problem most of these game have, especially Rebirth 2/Mk2. It is a thing where is less is more.\n--> SP system is horrendous. You have a max of 1000, and it takes forever to build up. Late game you will get Drill which solves that problem, but it still makes HDD Neptune completely terrible to use, since that one costs all 1000 SP.\n\n--> You need to use 100 skill to learn an Exe drive, very terrible and tedious addition.\n\nThat's about it, the system was fine like I said.\n\nOverall:\n\nIt is an okay game, the characters were good. Though it has a lot of flaws with its story telling, and some with its system.", "timestamp_created": 1734999265, "timestamp_updated": 1735007052, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 3240, "total_negative": 190, "total_reviews": 3430}, "cursors": {"AoJw+KuJpYcDcdmHhwQ=": "Mon Jan 20 18:07:01 2025"}}
