{"reviews": {"185976593": {"recommendationid": "185976593", "author": {"steamid": "76561199007495948", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 9135, "playtime_last_two_weeks": 619, "playtime_at_review": 8518, "last_played": 1737406125}, "language": "brazilian", "review": "EU MATEI O BOSS MAIS FORTE DO JOGO, E AINDA ASSIM EU ACHO COGUMELO O PIOR BIXO! o jogo e mt bom", "timestamp_created": 1737325552, "timestamp_updated": 1737325552, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185079928": {"recommendationid": "185079928", "author": {"steamid": "76561198119501364", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 522, "playtime_last_two_weeks": 0, "playtime_at_review": 522, "last_played": 1735209969}, "language": "english", "review": "I wanna say fuck yeah; but I cant.\n\nTook me like ten years to finally give this a chance.\n\nThe game seems unfinished and its just a grind fest. \n\nOnce i got the hang of crafting it got alot more fun and scratched that magicite itch.\n\nLooks like the dev has moved on long ago. \n\nReally wish he’d rework magicite or make a sequel. \n\nId say this game is worth it for a few dollars. Especially if you played magicite back in the day.\n\nFix magicite please", "timestamp_created": 1736314822, "timestamp_updated": 1736314822, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184762591": {"recommendationid": "184762591", "author": {"steamid": "76561198892810493", "num_games_owned": 35, "num_reviews": 8, "playtime_forever": 4363, "playtime_last_two_weeks": 162, "playtime_at_review": 3667, "last_played": 1736531189}, "language": "english", "review": "This is one of my favorite games of all time (which probably says something about me, I don't know what though). There's a lot of content and it's very fun to play. The replay value is enormous, the graphics and effects are great, music and sound effects are good as well. There is a lot of content in the game as I've said before, a giant amount of weapons, armor, potions, gear in general.\n\nThat being said, it's actually crazy how unfinished this game is. Most of the enemies are the same, even some of the bosses, there are game breaking bugs, some of which require you to delete your character and create a new one because you're one hit away from dying... from any enemy. All of that to say, I seriously don't think this game is worth the $10 it's at right now, especially that the developer has completely abandoned the project, and I don't think they'll pick it up any time soon to fix it, though I hope that isn't the case and they'll return to it at some point.\n\nAll hope is not lost as there is a pretty active modding community since I last saw, I hope it hasn't died. I've seen some new mods since the last time I played, so at least some third-party development is still ongoing.\n\nEither way, I love this game. Been playing it on and off since it came out, picked it back up again to play with my brother, which has been a great time even though we've died in the stupidest ways at the worst times. It's ok, we'll get back to where we left off, eventually.\n\nIf you love roguelikes and don't mind spending money on an overpriced (as I've said before) basically dead (except the modding community, I hope) game, then you should definitely buy Roguelands as I can guarantee you'll have a great time for the couple of hours you spend on it.\n\nIf you're not into roguelikes that much or it's your first time playing a roguelike, or you're trying to buy a game that you think you will enjoy with the last $10 of the whatever amount of money your mom gave you on your birthday, don't bother, spend it on some other game that's in better shape or on something completely different, it doesn't have to be a game per se.", "timestamp_created": 1736015175, "timestamp_updated": 1736015175, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184292434": {"recommendationid": "184292434", "author": {"steamid": "76561198856225776", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 3093, "playtime_last_two_weeks": 0, "playtime_at_review": 1243, "last_played": 1735979372}, "language": "schinese", "review": "游戏是好游戏，但是作者不更新了是真难蚌。如果坚持更新多半就不会像现在这样冷门了", "timestamp_created": 1735621919, "timestamp_updated": 1735621919, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 2968, "total_negative": 722, "total_reviews": 3690}, "cursors": {"AoJ4vLDo6oEDcOS8wwM=": "Mon Jan 20 18:13:25 2025"}}
