{"reviews": {"185920996": {"recommendationid": "185920996", "author": {"steamid": "76561198121368281", "num_games_owned": 0, "num_reviews": 40, "playtime_forever": 3178, "playtime_last_two_weeks": 0, "playtime_at_review": 3178, "last_played": 1469256999}, "language": "english", "review": "Better than people remember and a certified Bioware classic. The combat and classes are very unique, and a lot of that uniqueness gets stripped away in later entries. I adored the soldier abilities as the heat reduction + invincibility makes you feel like a walking tank that just destroys everything in it's path. \r\n\r\n", "timestamp_created": 1737271669, "timestamp_updated": 1737271669, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185918972": {"recommendationid": "185918972", "author": {"steamid": "76561198151721416", "num_games_owned": 0, "num_reviews": 118, "playtime_forever": 96, "playtime_last_two_weeks": 1, "playtime_at_review": 96, "last_played": 1737268812}, "language": "english", "review": "Game's not 100 gigs and doesn't require you to download EA's shitty service to launch the game that you just spent 2 hours downloading. No controller support, but that's okay. It's a lil more buggy than the Legendary Edition though. That's about the only reason I'd recommend that version over this one. \n\nGame itself is just KOTOR but actually fun.", "timestamp_created": 1737268919, "timestamp_updated": 1737269236, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185697615": {"recommendationid": "185697615", "author": {"steamid": "76561198049604279", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 884, "playtime_last_two_weeks": 228, "playtime_at_review": 881, "last_played": 1737016377}, "language": "english", "review": "Very good game to escape life and remember there is more. Use Flawless Widescreen.", "timestamp_created": 1737016214, "timestamp_updated": 1737016214, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185674339": {"recommendationid": "185674339", "author": {"steamid": "76561198433753710", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 5815, "playtime_last_two_weeks": 0, "playtime_at_review": 5815, "last_played": 1656977884}, "language": "spanish", "review": "Very Good Game", "timestamp_created": 1736979911, "timestamp_updated": 1736979911, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185633482": {"recommendationid": "185633482", "author": {"steamid": "76561198342847734", "num_games_owned": 42, "num_reviews": 11, "playtime_forever": 881, "playtime_last_two_weeks": 881, "playtime_at_review": 881, "last_played": 1736931387}, "language": "english", "review": "Tried to get the LE version but due to region ban, I got this and it did not disappoint. Some glitches are there but this game held its place through time.", "timestamp_created": 1736931578, "timestamp_updated": 1736931578, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185314928": {"recommendationid": "185314928", "author": {"steamid": "76561198041184986", "num_games_owned": 0, "num_reviews": 29, "playtime_forever": 6944, "playtime_last_two_weeks": 0, "playtime_at_review": 6944, "last_played": 1618541218}, "language": "english", "review": "Back when this series was an RPG. \n\nSo, I probably hold a minority opinion, but I find this game to be the best of this entire series. \n\nSure, it definitely has its flaws, and I am not defending those. Compared to what came after though, there is just so much more game here. \n\nIt's primarily a loot game - think Diablo but a third person shooter. And it is much more linear than Diablo. Also, the further you progress, the better loot ya find. \n\nThe gunplay in this game is satisfying for what it is. It is a tad on the clunky side, but I do like the rechargeable ammo mechanic. It gets really goofy later on when you get High Explosive Rounds. It's hilarious to just watch enemies get blasted into the air from a shotgun blast. \n\nWhich brings up another fun aspect to this game - gear customization. You can equip certain upgrades to your weapons and armor to assist during combat. Some make your guns have less cool down on recharge, some make your shields recharge super fast, some make your guns fire freezing, fire, or disintegrating rounds, some make your health super buffed, etc. There's a lot of customization and builds you can try that can compliment the class you choose. \n\nI will say this though, while the game gives you the illusion of playing with biotic powers... you're better off just using guns. The biotic powers in this game just aren't fun to use. However, they do each have their own independent cooldown, so that's nice. \n\nSpeaking of negatives, there is the Mako driving segments. As others have highlighted, these can be a drag. A lot of the planets you land on will require you to drive this clunky brick through some odd landscapes that the Mako isn't really build to traverse. You'll find yourself Skyrimming up a mountain a few times. \n\nIf the Mako was more of a hovercraft and less of a rover, these segments would be more bearable. If would also help if there was more on the planets to actually explore. \n\nPeople also like to pick on the Elevator loading screens in this game... I don't really mind them. They offer a moment of rest in between exploration or combat segments. Can some of them be a bit long? Eh. I guess. I never went to an elevator and thought \"Jesus! This is way too slow!\"\n\nThe combat works. Is it the best third-person-shooter you'll ever play. No. Pick RE4 or Vanquish for that.\nIs it fun to customize your guns and blast enemies away? Oh yeah. \n\nI also like for every enemy you kill, every objective you complete, you get XP. Really feels like your character is progressing the more you do. The leveling system is also pretty nice and decently balanced with each skill point you put in. I wouldn't say it is hard, but it does suffer from the common video gamey issue where if you play on higher difficulties, the more tanky enemies become. A lot of fights on Insanity are just wars of attrition and can make the combat really boring.\n\nI hold the opinion that due to the Mass Effect series being more narrative focused, they honestly should not even have a difficulty select. There isn't Devil May Cry levels of depth here. It's shoot enemies, get XP, talk to person, complete quest, level up. Nothing bigger or greater.\n\nWith this series being narrative heavy, the one here is a solid set up: big evil thing coming to destroy all life in galaxy, and you need to stop it. It's simplistic, but it is engaging with how you can choose certain scenarios to play out. Characters can die. Friendships can be ruined. Monumental events can be decided by you. It's just a shame the sequels didn't really do a good job of using these decisions. \n\nMany people praise the characters in this game and I will say there is a lot to love there. Garrus is always great as is Wrex. Tali is an enjoyable crewmate as well. Everything is well voice acted and it's mostly enjoyable to just listen to characters speak with each other. The arguments they have, the choices you can make - it's charming and endearing. You actually feel for what's going on. \n\nThis is an all around good RPG. It has its goofy quirks, but you could do so much worse (like turning the sequels into boring cover-based shooters that derail the story into stupidity). \n\nI don't know what BioWare has planned for the future of Mass Effect, but I doubt it will ever get back to its heights here. Especially with most of the devs no longer being at BioWare anymore. \n\nIf you want a classic and goofy RPG to play in your spare time, try this game out. If this game is too arcadey for you and you desire a more streamlined experience, the sequels might be more for ya, but don't expect a lot of narrative significance there. The second game might as well be a spin off with ass-pulled relevance to the main plot here. \n\nYou might be interested in picking up the Legacy Collection they produced a few years ago - it has some QoL enhancements to this game and the modding scene also helps a lot too.", "timestamp_created": 1736567157, "timestamp_updated": 1736567157, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185261162": {"recommendationid": "185261162", "author": {"steamid": "76561198992306293", "num_games_owned": 43, "num_reviews": 78, "playtime_forever": 599, "playtime_last_two_weeks": 0, "playtime_at_review": 599, "last_played": 1735994881}, "language": "russian", "review": "[h1] Отрицительаня оценка к порту в Стим сама игра хорошая хотя тут я напишу и минусы игры [/h1]\n\nЯ фанат трилогии Mass effect кучу раз прошел ремастер и решил купить оригинал что-бы поддержать разработчиков и скажу что я не доволен\n \n[h1] Русификатор [/h1]\nВ игре нету русского языка ДАЖЕ ТЕКСТА то что нету русской озвучки это хорошо она ужасна но хотя-бы русский текст могли добавить а самое интересное что я читал в 1 из обзоров что раньше русский язык был но его почему-то убрали и мне пришлось скачать русификатор\n\n[h1] ДЛС [/h1]\nНету ДЛС ни гибели с небес ни станции вершины ну ладно станции вершины нету это тупо арена я играл в мод который портирует это ДЛС к ремастер мне не понравилось но почему нету гибели с небес? Если я не ошибаюсь то для других оригинальных частей Mass effect сделали версию со всеми ДЛС отдельно почему первую часть обделили? Иза этого приходится качать ДЛС с какихто сайтов что у меня не получилось\n\n[h1] Достижения [/h1]\nЯ читал что раньше в игре были достижения вопрос ГДЕ ОНИ почему их убрали для меня остается загадкой\n\n[h1] Минусы игры [/h1]\nТеперь перейдем к минусам самой игры это не делает ейо плохой просто минусы они есть во всех играх\n\n[h1] Черные текстуры [/h1]\nНа Новерии на Вершине 15 до поезда все враги и мы становимся черными пиксемями так же и весь Илюс (Ил) я понимаю что это потомучто игра старая но всеже неужеле нельзя было исправить?\n\n[h1] Система морали [/h1]\nНу очки парагона (героя) и ренегата (отступника) как по мне в игре страная система морали типо на Феросе мы можем убить ученого который угрожает простым людям обычный корпоративный ублюдок или мы можем с ним договорится если мы его убьем то это будет считатся за плохое действие вопрос ПОЧЕМУ нахрен нам с ним договариватся он не несет никакой пользы убив его мы также спасаем людей как и в варианте где мы договариваемся с ним вопче если проходить игру выбирая только верхние варианты ответа то ну... Шепард превратится в неженку который со всеми плохишами обшяется вежливо", "timestamp_created": 1736518977, "timestamp_updated": 1736519091, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184990818": {"recommendationid": "184990818", "author": {"steamid": "76561198953820916", "num_games_owned": 112, "num_reviews": 18, "playtime_forever": 13161, "playtime_last_two_weeks": 0, "playtime_at_review": 13161, "last_played": 1694374843}, "language": "spanish", "review": "simulador de follar aliens esta viejito pero gooood", "timestamp_created": 1736224807, "timestamp_updated": 1736224807, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184673386": {"recommendationid": "184673386", "author": {"steamid": "76561198015151045", "num_games_owned": 0, "num_reviews": 99, "playtime_forever": 4682, "playtime_last_two_weeks": 0, "playtime_at_review": 4682, "last_played": 1341903600}, "language": "english", "review": "Amazing story and world building. Combat was a bit rough in the original and inventory management was a nightmare but you should still play it. ME2 is a worthy follow up. ME3 was a let down. There are no other mass effect games after that. Just Mass Effect husks.\n\nRanking: ME2 > ME > ME3", "timestamp_created": 1735934728, "timestamp_updated": 1735934728, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184639875": {"recommendationid": "184639875", "author": {"steamid": "76561198268507662", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 3074, "playtime_last_two_weeks": 583, "playtime_at_review": 939, "last_played": 1737128062}, "language": "russian", "review": "Too bad they cut the horror vision on Eden Prime (( it was iconic!", "timestamp_created": 1735912369, "timestamp_updated": 1735912369, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184620520": {"recommendationid": "184620520", "author": {"steamid": "76561198008086470", "num_games_owned": 0, "num_reviews": 22, "playtime_forever": 4275, "playtime_last_two_weeks": 0, "playtime_at_review": 4275, "last_played": 1362038400}, "language": "italian", "review": "storia eccezionale, molteplici possibilità di svolgere il gioco, must play", "timestamp_created": 1735903372, "timestamp_updated": 1735903372, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184557335": {"recommendationid": "184557335", "author": {"steamid": "76561198817172099", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 1625, "playtime_last_two_weeks": 160, "playtime_at_review": 187, "last_played": 1736595165}, "language": "english", "review": "A fantastically built sci-fi experience, very good for its time. Can't believe I haven't played till now.\r\n", "timestamp_created": 1735844565, "timestamp_updated": 1735844565, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184533276": {"recommendationid": "184533276", "author": {"steamid": "76561198395707239", "num_games_owned": 288, "num_reviews": 49, "playtime_forever": 1106, "playtime_last_two_weeks": 0, "playtime_at_review": 1106, "last_played": 1691272902}, "language": "english", "review": "good game", "timestamp_created": 1735827436, "timestamp_updated": 1735827436, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184404254": {"recommendationid": "184404254", "author": {"steamid": "76561199229550861", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1232, "playtime_last_two_weeks": 0, "playtime_at_review": 1216, "last_played": 1735752133}, "language": "english", "review": "I love this game, has a lot of playablity and backstory. My only gripe in there's no autosave(bad if any) and its not more popular.", "timestamp_created": 1735715264, "timestamp_updated": 1735715264, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184366526": {"recommendationid": "184366526", "author": {"steamid": "76561197998413647", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 1706, "playtime_last_two_weeks": 1, "playtime_at_review": 719, "deck_playtime_at_review": 719, "last_played": 1737059702}, "language": "english", "review": "Happy can finish this Game finally.", "timestamp_created": 1735679051, "timestamp_updated": 1735679051, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.46875", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}, "183998707": {"recommendationid": "183998707", "author": {"steamid": "76561199427206023", "num_games_owned": 37, "num_reviews": 8, "playtime_forever": 2064, "playtime_last_two_weeks": 0, "playtime_at_review": 1980, "last_played": 1735424539}, "language": "latam", "review": "muy buen juego, con una gran historia, gráficos y buena banda sonora, ademas de tener un buen gameplay, lo único malo es su cobertura de aprendizaje que se puede volver exasperante al principio pero te acostumbras al momento", "timestamp_created": 1735400214, "timestamp_updated": 1735400214, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183904047": {"recommendationid": "183904047", "author": {"steamid": "76561197973019975", "num_games_owned": 0, "num_reviews": 51, "playtime_forever": 4240, "playtime_last_two_weeks": 0, "playtime_at_review": 4240, "last_played": 1489354444}, "language": "english", "review": "of course its good", "timestamp_created": 1735325032, "timestamp_updated": 1735325032, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183840759": {"recommendationid": "183840759", "author": {"steamid": "76561198804918804", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 1022, "playtime_last_two_weeks": 347, "playtime_at_review": 312, "last_played": 1737336118}, "language": "english", "review": "After hearing about how amazing Mass Effect was in middle school I never got to experience Mass Effect til now...\r\n\r\nI get it now.", "timestamp_created": 1735272292, "timestamp_updated": 1735272292, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183687976": {"recommendationid": "183687976", "author": {"steamid": "76561198160379612", "num_games_owned": 394, "num_reviews": 417, "playtime_forever": 4396, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1735548020}, "language": "russian", "review": "good", "timestamp_created": 1735159994, "timestamp_updated": 1735159994, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183654885": {"recommendationid": "183654885", "author": {"steamid": "76561197970864851", "num_games_owned": 3976, "num_reviews": 44, "playtime_forever": 1034, "playtime_last_two_weeks": 0, "playtime_at_review": 1034, "last_played": 1735135705}, "language": "english", "review": "Aside from a couple of cheese moments in the storyline, this sci-fi tale was an awesome ride. Having only just played this through for the first time, in late 2024, I was concerned that it would be too dated. Sure, the controls, graphics and camera is a little rigid, but they are all adequate enough to allow you to experience the thrilling 'choose-your-story' type of game that BioWare became fondly known for. Every line is voiced, mo-capped and valuable to the enjoyment of the game. Really high quality stuff, and there are no barriers from playing it through. No launchers, no online only, no accounts, no obtrusive EULAs. Just a fantastically made game. \r\n17 hours to complete, and I am looking forward to playing through Mass Effect 2 following on from this. It is rare you find a game that makes you want to carry on.", "timestamp_created": 1735136023, "timestamp_updated": 1735136023, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183515701": {"recommendationid": "183515701", "author": {"steamid": "76561198011659098", "num_games_owned": 199, "num_reviews": 3, "playtime_forever": 1343, "playtime_last_two_weeks": 0, "playtime_at_review": 637, "last_played": 1735071868}, "language": "german", "review": "Es ist von Bioware und EA kann es nicht puttmachen!!!!!!!!!!", "timestamp_created": 1734990994, "timestamp_updated": 1734990994, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 15343, "total_negative": 1031, "total_reviews": 16374}, "cursors": {"AoJ4hrWV7o4Deuig7QQ=": "Mon Jan 20 15:26:04 2025"}}
