{"reviews": {"186014238": {"recommendationid": "186014238", "author": {"steamid": "76561198959535138", "num_games_owned": 0, "num_reviews": 30, "playtime_forever": 678, "playtime_last_two_weeks": 678, "playtime_at_review": 546, "last_played": 1737386258}, "language": "english", "review": "It is important to note that this is a remake of the much older, original Colonization game. And while it incorporates a lot of changes, very few of them actually improve the gameplay over what the 1994 version could offer. Gone are the trade routes and native tribes giving you frequent gifts; gone are the political strife in Europe affecting the colonies; gone are the custom houses and the ability to pay through the nose to lift a boycott of goods; gone is the ability to set a skilled worker as a teacher in schoolhouse and train unskilled workers directly, in favour of the unskilled worker now studying at the schoolhouse, and, as a result, utterly tanking your revolution rating because they get flagged as a 'new' colonist the moment they graduate. And, because the game now implemenets cultural borders, gone is the ability to maintain a good relationship with the nearby tribes simply by keeping a small distance to their settlements.\r\n\r\nGet the 1994 version instead. It's more fun.", "timestamp_created": 1737378788, "timestamp_updated": 1737378788, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185683507": {"recommendationid": "185683507", "author": {"steamid": "76561198202334720", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 19993, "playtime_last_two_weeks": 0, "playtime_at_review": 19993, "last_played": 1692331591}, "language": "english", "review": "I thoroughly enjoy the management of trade and logistics in this game. I find that extremely enjoyable.\r\nHowever I must stress the extreme caveat that this game has you play as a party conducting a campaign of genocide against the indigenous peoples of these pseudo-american continents. You can attempt to mitigate this to some degree, but it should be kept in mind when playing, as the game does not explicitly point this out.", "timestamp_created": 1736992618, "timestamp_updated": 1736992618, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185661819": {"recommendationid": "185661819", "author": {"steamid": "76561198043815481", "num_games_owned": 159, "num_reviews": 11, "playtime_forever": 1852, "playtime_last_two_weeks": 1852, "playtime_at_review": 718, "last_played": 1737257812}, "language": "english", "review": "For me the best Colonization is still the original DOS game.\nBut I can understand why people will not play a 640x480 game on a 42\" screen .. . ^^\n\nThis version here doesnt´t reach the strategic depth of the original, bur if you give the T.A.C. mod a try you´ll get what I´m talking about.\nhttps://forums.civfanatics.com/threads/mod-the-authentic-colonization-tac.440319/\nNearly the original regarding the strategy and the CIV IV graphics which still is ok for today.\n\nHighly recommended for all the oldies like me who loved the 1994 Micropose original.", "timestamp_created": 1736965783, "timestamp_updated": 1737061693, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185444641": {"recommendationid": "185444641", "author": {"steamid": "76561198042381194", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 1003, "playtime_last_two_weeks": 825, "playtime_at_review": 696, "last_played": 1736885619}, "language": "english", "review": "The original version is among my favourite games, but the remake honestly leaves much to be desired. It's incomprehensible even, as most of the changes remove major strategic elements and make the game look way more boring than it actually is!\n\nI had to dust off the DOS original and give it a go to see how many things have been left out for no good reason. That one had a great gameplay loop, true to Sid's vision:\n\n[quote=Sid Meier]A good game is a series of interesting decisions.[/quote]\n\nWe are talking about an over 30 years old game, how cool is that?\n\nLet's see what's been left out and how it clashes with this original idea.\n\n[table]\n[tr]\n[th]Original[/th]\n[th]Remake[/th]\n[/tr]\n[tr]\n[td]You can choose which colonist you'd like from the three available when an immigrant wants to come.[/td]\n[td]The colonist is picked randomly. You may hurry the one you want, just like in the original.[/td]\n[/tr]\n[tr]\n[td]The Fountain of Youth found in ruins allows you to bring in loads of colonists![/td]\n[td]No Fountain of Youth (nor Cibola for that matter) present :([/td]\n[/tr]\n[tr]\n[td]Education needs [i]teachers[/i], who'll train available colonists. The cost of education stays consistent, but there's a period of slower production while the teacher is occupied.[/td]\n[td]Education needs [i]students[/i], who'll learn from an available specialist with higher tiers costing gold (making exports mandatory). [b]Education costs quickly increase permanently with each colonist trained![/b][/td]\n[/tr]\n[tr]\n[td]No borders; essentially anyone can move anywhere and attack whenever they wish to. You need a minimal defensive force even in times of peace.[/td]\n[td]All-or-nothing diplomacy with no middle ground between brutal genocidal wars and total mind-numbing boredom. The crazy native AI can end your game instantly if they have a bad day... or they'll let you envelop them and pass the peace pipe as they disappear into the void with no trace.[/td]\n[/tr]\n[tr]\n[td]Boycotted goods can be paid off at a huge expense, allowing them to be traded again.[/td]\n[td]Boycotted goods can never be traded for again! There isn't even Jakob Fugger to save your skin![/td]\n[/tr]\n[tr]\n[td]Founding Fathers follow a relatively even arch. Majority of them is quite useful with relevant bonuses for their price and the stage they come in. There are only bells used for earning them, produced at town halls only.[/td]\n[td]Everything about the Founding Fathers is all over the place! Now you have to collect multiple points that are given automatically for various actions with no feedback given. You also need bells to unlock a Father. It burns both of your points. Most bonuses also either come too late or are absolutely useless. Confusing and not very helpful at all![/td]\n[/tr]\n[tr]\n[td]You can abandon settlements when the last colonist leaves (except after building a stockade for some reason).[/td]\n[td]No way to abandon a settlement, unless it's razed by others.[/td]\n[/tr]\n[tr]\n[td]Captured settlements can be looted and the citizens taken away. If not needed, they can often be abandoned.[/td]\n[td]You cannot examine captured settlements before deciding to capture or raze them. Capturing them permanently adds them to your empire.[/td]\n[/tr]\n[tr]\n[td]Pioneers use up tools and need to be refilled when they run out.[/td]\n[td]Pioneers build improvements for cash (no self-sufficiency) and only need to be equipped once.[/td]\n[/tr]\n[tr]\n[td]Silver mines eventually run out of ore, forcing you to diversify.[/td]\n[td]Silver mines never run out of ore and give a reliable source of income all game.[/td]\n[/tr]\n[tr]\n[td]You can haggle with natives, earning higher prices at the chance of risking angering them.[/td]\n[td]No haggling. If you cannot pay up completely, you won't be sold anything. They'll also often give you offers that barely make you break even, making trading with natives a bit of a moot.[/td]\n[/tr]\n[tr]\n[td]Native settlements cannot be entered (you can speak with them, but cannot physically enter) and they'll block your path. Native settlements also cannot be traded with via ships, unless you've met them previously on land.[/td]\n[td]Native settlements can be entered by any unit and can be used to \"harbor\" your ships, especially privateers. Trading with them via ships is possible.[/td]\n[/tr]\n[tr]\n[td]Horses can be bred automatically as long as you have at least 2 of them and enough food. No ranchers exist.[/td]\n[td]Horses only can be bred at stables and it is not done automatically. New expert ranchers for this profession.[/td]\n[/tr]\n[tr]\n[td]Experienced troops become veterans, greatly increasing their combat abilities all around. During the revolutionary war, veterans can become professional colonial troops, further increasing their strength (and giving them a dapper look!)[/td]\n[td]Experienced troops receive really weak promotions (inherited from Civ 4), but do not become veterans.[/td]\n[/tr]\n[tr]\n[td]Wounded units \"demote\", dragoons become soldiers, soldiers become colonists that need to be equipped again before they can fight.[/td]\n[td]Losing units die and their equipment is lost for good.[/td]\n[/tr]\n[tr]\n[td]The King's forces become more vulnerable in nature, receiving negative defense bonuses, encouraging you to bait them into woods or mountains. This shakes up late game, where previously dangerous terrain becomes a deathtrap for your enemies.[/td]\n[td]The King's forces receive no bonuses or maluses from terrain at all. You have to go toe-to-toe with them, so its a numbers' game.[/td]\n[/tr]\n[/table]\n\nPlus many more minor changes not mentioned here. I could go on about how do they upset the gameplay, but veterans can figure it out. All these little changes up to something that results in a vastly different game from the original vision. Player agency is lost and previously rewarding mechanics are gone.\n\nStill, there are some positive changes though: great graphics for its age, better automation, support for modern OS and modding... Most of the gameplay is fairly close to the original, but all these pointless changes make the concept look way worse for newcomers than it's actually is. Baffling.\n\nWhy would I recommend it then? Well, it's an overused trope, but mods do solve lots of these issues I mentioned... hear me out: Civ 4's engine makes not only adjusting values or adding new things easy for modders, but as the source code for the game has been essentially released for us, numerous gameplay improvements have been added by us fans over the years.\n\nFirst with \"[i]The Authentic Colonization[/i]\" mod laying down the essentials, then came \"[i]Religion and Revolution[/i]\" greatly expanding it, then building upon of all its ancestors here's the \"[u][url=forums.civfanatics.com/threads/we-the-people-mod-overview.636758]We the People[/url][/u]\", each adding new features while staying true to the original vision of the game. They may feel bloated and janky at times, but I think they are still the saving grace of this remake and for a good reason. Incredible effort put in by the fans. I even made my own submod for RaR back then, diving deep into the XML jungles, I liked the experience that much!\n\nEven if you are not very much into modding, this game is still a brilliant concept that's unlikely to be ever touched again. It's certainly worth taking a look just for the fact that it turns everything you've known about 4X games to its head and still manages to give you a cohesive experience with some edutainment sprinkled in.\n\nhttps://store.steampowered.com/app/327400/Sid_Meiers_Colonization_Classic\n\nGive the original DOS one a try first if you are captivated by the idea. Please do. The vanilla version of the remake is mediocre, but playable. Only buy it if you plan on trying a total conversion mod and wish to see this concept expanded upon. A unique 4X experience, but certainly not for everyone.\n\nAlso you might be interested in [u][url=freecol.org]FreeCol[/url][/u] as an alternative take on this classic game.", "timestamp_created": 1736694773, "timestamp_updated": 1736695813, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184925752": {"recommendationid": "184925752", "author": {"steamid": "76561197971037905", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 53817, "playtime_last_two_weeks": 4567, "playtime_at_review": 53260, "last_played": 1737320617}, "language": "german", "review": "habe hunderte Spiele, spiele das da schon seit Ewigkeiten original und seit Jahren mit genialen Mods.\n\nEmfehle z.B. folgende Mods mit weit hunderten Stunden Spielzeit.\n\n\nWe the people spiele ich seit 4 Wochen, funktioniert bei mir im Szenario modus super, dennoch sollte man öfter mal saven.\nDawn of a New Era 6.0 seit Jahren, Komplett Overhaul mit vielen völlig neuen Sachen, funktioniert in allen Modi dennoch sollte man auch regelmässig saven.\n\nkann ich reinen Herzens empfehlen.\n\nwenn beide Mods zusammengelegt wären könnte ich mir kaum ein anderes Spiel dieses Genre mehr vorstellen. das es wert wäre statt dessen zu spielen.", "timestamp_created": 1736167952, "timestamp_updated": 1737283789, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184903451": {"recommendationid": "184903451", "author": {"steamid": "76561198010899535", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 4240, "playtime_last_two_weeks": 2792, "playtime_at_review": 1448, "last_played": 1737007794}, "language": "english", "review": "Used to play this game and enjoyed it, particularly the World Builder , glad to see it on steam.", "timestamp_created": 1736144471, "timestamp_updated": 1736144471, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184616982": {"recommendationid": "184616982", "author": {"steamid": "76561198026855660", "num_games_owned": 0, "num_reviews": 89, "playtime_forever": 487, "playtime_last_two_weeks": 0, "playtime_at_review": 216, "last_played": 1735982466}, "language": "english", "review": "A fun experience and a great alternative to Civilization, this game could certainly benefit from a fresh iteration. However, it seems that this type of story may not align with modern sensibilities anymore.", "timestamp_created": 1735901244, "timestamp_updated": 1735901244, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184325053": {"recommendationid": "184325053", "author": {"steamid": "76561198028495709", "num_games_owned": 1987, "num_reviews": 379, "playtime_forever": 62, "playtime_last_two_weeks": 0, "playtime_at_review": 62, "last_played": 1435779363}, "language": "english", "review": "Nah. It is more like ketchup alone than a whole Civ game (which is a whole burger + fries set).", "timestamp_created": 1735649503, "timestamp_updated": 1736777019, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184227728": {"recommendationid": "184227728", "author": {"steamid": "76561198291385001", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 2385, "playtime_last_two_weeks": 10, "playtime_at_review": 1089, "last_played": 1736548852}, "language": "english", "review": "a step into past", "timestamp_created": 1735572251, "timestamp_updated": 1735572251, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184120726": {"recommendationid": "184120726", "author": {"steamid": "76561198043085967", "num_games_owned": 742, "num_reviews": 39, "playtime_forever": 428, "playtime_last_two_weeks": 0, "playtime_at_review": 428, "deck_playtime_at_review": 12, "last_played": 1732939250}, "language": "english", "review": "Especially with mods, Civilization IV colonization is a fantastic resource management strategy game for creating a fledging colony into an independent nation.\n\nLike vanilla civ 4 the late game can start to have a little too much micromanagement with doom stacks and resource management. It also is disappointing that other colonial powers and natives don’t fight each other it’s a great game if you are in the mood for a game set in the time period of colonial American settlement. \n\nThe way the game treats native Americans and depicts them can be pretty poor, ignoring historical realities with blanket generalizations as well ignoring the elephant in the room (slavery) but despite these problems the game with mods can be a real classic “just one more turn” experience.", "timestamp_created": 1735494442, "timestamp_updated": 1735494566, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.551934778690338135", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184051999": {"recommendationid": "184051999", "author": {"steamid": "76561197980553696", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 2232, "playtime_last_two_weeks": 0, "playtime_at_review": 2232, "last_played": 1630648894}, "language": "english", "review": "This is really fun. It's not an add-on to Civilization. It's another game. As the description says, it's a \"total conversion\" of the Civilization IV engine. In other words, it's part mod, part tea-chucking, redcoat-jeering, 'murica!!!-screaming love letter to American colonial history.", "timestamp_created": 1735437517, "timestamp_updated": 1735437517, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183857395": {"recommendationid": "183857395", "author": {"steamid": "76561198004889761", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 549, "playtime_last_two_weeks": 0, "playtime_at_review": 549, "last_played": 1735288493}, "language": "german", "review": "macht spaß, es bindet schön an die 1. version aus den 90ern an", "timestamp_created": 1735288544, "timestamp_updated": 1735288544, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183752412": {"recommendationid": "183752412", "author": {"steamid": "76561198012342118", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 45490, "playtime_last_two_weeks": 533, "playtime_at_review": 43861, "last_played": 1737273671}, "language": "english", "review": "Some of the up grade is reasonable but most is not. A good game spoilt by a mindless programmer, too clever for his own good.", "timestamp_created": 1735220983, "timestamp_updated": 1735220983, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.401459872722625732", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183574215": {"recommendationid": "183574215", "author": {"steamid": "76561198012503347", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 24166, "playtime_last_two_weeks": 0, "playtime_at_review": 23243, "last_played": 1735355790}, "language": "english", "review": "Merci Meyer", "timestamp_created": 1735053639, "timestamp_updated": 1735053639, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471698105335235596", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183574193": {"recommendationid": "183574193", "author": {"steamid": "76561198056335152", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 30474, "playtime_last_two_weeks": 3513, "playtime_at_review": 21645, "last_played": 1737400108}, "language": "english", "review": "Quality graphics and familiar to anyone who's played CIV.", "timestamp_created": 1735053621, "timestamp_updated": 1735053621, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 1149, "total_negative": 177, "total_reviews": 1326}, "cursors": {"AoJw84TfmIsDfenEtQQ=": "Mon Jan 20 15:25:56 2025"}}
