{"reviews": {"185864829": {"recommendationid": "185864829", "author": {"steamid": "76561198239866768", "num_games_owned": 114, "num_reviews": 14, "playtime_forever": 78, "playtime_last_two_weeks": 12, "playtime_at_review": 78, "last_played": 1737177756}, "language": "russian", "review": "К сожалению, я вынужден оставить негативный отзыв о продукте из-за отсутствия поддержки VR-гарнитуры Pico 4. Но, к сожалению, столкнулся с серьезными ограничениями.", "timestamp_created": 1737213216, "timestamp_updated": 1737213216, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185835133": {"recommendationid": "185835133", "author": {"steamid": "76561198007847377", "num_games_owned": 892, "num_reviews": 141, "playtime_forever": 2332, "playtime_last_two_weeks": 2284, "playtime_at_review": 1693, "last_played": 1737342736}, "language": "english", "review": "This game is a mess, that is generally worth getting on sale, if you have a gamepad nearby(or use Vive or Oculus), and are ready to spend time on a title that is hell-bent on trying to drive you away from playing it. It does have cool moments in it. \n\nThis is an experimental version of an experimental game, made in 2017, when VR was more niche than it is now. At the core of everything is an interesting and a fairly deep world, but it is buried under a pile of strange design decisions, badly done missions, and poor choices.\n\nMinutes into the play in free mode, the game will offer you a mission chain of awful repetitive quests that should end with a big battle. However, the final mission is for some strange reason on a very short timer, and is probably glitched. The game can promise money for discovering new sectors, but that mission can break too. Then you'll t ry trading, and realize that the game gates trading from you - you'll have to revisit stations personally or play an awkward talk minigame. Then you'll learn of cut content, like that in VR version station doors do not open, or that they cut main story mission from rebirth and removed your copilot. Lots of things are unexplained, some stuff like encyclopedia is buried in menu without ever being mentioned, and so on. \n\nIt feels like it had a potential to become a killer VR space game, but due to many things it was botched and butchered, and developers never revisited it since. There will be probably no updates in the future.\n\nBut. If you get through all those issues, manage to withstand game's continuous attempt to drive you away, there will be some very cool sights and area. Some of them almost qualify to be breathtaking. How about a space station almost swimming within sun's corona, for examle? That area looks very very cool.\n\nSo there you have it. You have a game that actively tries to fight you and drive you away. You can handle it, there are some cool moments underneath it. Is it worth it? I don't know. This was more interesting for me than Flatscreen rebirth, and thanks to this game I finally understood what flatscreen rebirth was supposed to be.\n\nIf you decide to get it, see my [url=https://steamcommunity.com/sharedfiles/filedetails/?id=3408256712]guide here[/url]. It is on steam and explains how I configured controls. \n\nHave fun.", "timestamp_created": 1737179691, "timestamp_updated": 1737179691, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185661758": {"recommendationid": "185661758", "author": {"steamid": "76561198150700113", "num_games_owned": 0, "num_reviews": 32, "playtime_forever": 55, "playtime_last_two_weeks": 0, "playtime_at_review": 55, "last_played": 1735982391}, "language": "russian", "review": "крайне убогий порт оригинальной игры на vr.\r\nуправление на столько сложное что аж зубы сводит, большинство функций с джойстиков тупо не доступны, уровень интерактивности окружения: отсутствует напрочь!\r\nЕДИНСТВЕННЫЙ плюс: пространство и станции выглядят круто", "timestamp_created": 1736965722, "timestamp_updated": 1736965722, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.481012642383575439", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184803890": {"recommendationid": "184803890", "author": {"steamid": "76561198019831633", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 34, "playtime_last_two_weeks": 0, "playtime_at_review": 34, "last_played": 1733202912}, "language": "schinese", "review": "游戏不支持pico等没有触摸板的vr手柄布局\n有一条很奇怪的模型渲染分界线，一般游戏是近景用高模，远景用低模。这游戏有一条中间偏右的分界线，两面的模型渲染精度不一样。近景由其明显。不清楚是本机的bug，还是游戏普遍bug", "timestamp_created": 1736051083, "timestamp_updated": 1736051083, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183925672": {"recommendationid": "183925672", "author": {"steamid": "76561197978460533", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 11692, "playtime_last_two_weeks": 3090, "playtime_at_review": 6687, "last_played": 1737351391}, "language": "english", "review": "Quick Summary - This game is not perfect or easy to get up and running, let alone play, but Egosoft has been building Space Sims for a long time and in X:Rebirth VR make a game you will want to play once you get over the humps.  You will see the potential, you will wish for more, but what you get here is unique and special in its own right.\n\nStarted as a 4/10, but currently feel it is an 8/10)\n\n------------------------------------------------------------------------------------\n\nLet me start this review by saying it took me years to get into this.  I had multiple false starts where it felt like I couldn't even get the controls to work, and the frustration was off the chart.  But I love Space Sims especially in VR\n\nI love Elite Dangerous, but never felt like I could make an impact in the game - mind you - I am a solo player\nI love No Man's Sky, but the flight model never really clicked for me\nStar Citizen does not support VR\n\nSo I kept coming back and trying to get this game going.  It looks so good right from the moment you see the first ship come into view at the start menu.  I really wanted to play this game.\n\nThe first issue to overcome - I have a Steam Version of the game and am currently using a Quest 3 (Previously a Vive, Rift-S, Quest 1 and 2).  There is an option to launch in Oculus Mode.  This launches the game from the Meta Quest Link App and uses Oculus/Meta controllers.\n  \nThe second issue is figuring out the controls - on Egosoft's YouTube Channel, there is a video about the controls and that was what helped me get over the initial hump and get me to actually start playing the game.\n\nI am currently over 100 hours into the game.  I've had a couple different starts - and it can be frustrating to have to start over.  On top of that, I am still struggling with how some things work in the game.  It feels like I got only so far in the tutorial/campaign and then it broke and left me high and dry.\n\nWith all of this, you might wonder how I could possibly recommend this game\n\nThere is so much to love in this game and you feel the potential right from the first moments.  It just takes  a lot of work and patience to get over the humps.  But stick with it and you will get there.  You will find yourself both loving this game and wishing for more.  Egosoft is on the right path, the things that happen in the background simulation are outstanding.  The real economy is something that I am still working to get my mind around, but I am getting there (I now have built 2 space stations and am slowly figuring out how they work and how to benefit from them)  \n\nIf you want to fly your own ship in VR and have impact on the game universe... so far as I know this is the best game we have for that (especially for single players)  That being said, with all the potential, with how many itches this game scratches, there is still a significant amount of it where you wish the game was still being pushed forward by the developer.  Mods do help this game (Especially to be able to initiate and mostly skip the small talk mini game) and the game itself makes it easy to install and use them.  The Egosoft Forum and YouTube will be your friend to help figure things out.\n\nLike I said, I am just over 100 hours into the game now and can see myself putting in many times that.  I might make it my goal to exterminate the Xenon... (the out of control AI \"race\") that might not be possible, but at some point I can see I will be going to war with them, or one of the other factions.  Can I build a massive empire that would support such a war?  Can I support my own efforts from raw materials to building starships?  \n\nI dearly hope a developer will one day create an incredible VR Space Sim.  X:Rebirth VR gets a lot of things wrong but is a good foundation and deserves to be played.  Once you get over the initial hump, you will hopefully find the diamond in the rough that I am.", "timestamp_created": 1735339928, "timestamp_updated": 1735340670, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.544607162475585938", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 163, "total_negative": 121, "total_reviews": 284}, "cursors": {"AoJ47PyMn+ACcYbbkQE=": "Mon Jan 20 19:37:51 2025"}}
