{"reviews": {"185361912": {"recommendationid": "185361912", "author": {"steamid": "76561198029138408", "num_games_owned": 532, "num_reviews": 23, "playtime_forever": 1853, "playtime_last_two_weeks": 1815, "playtime_at_review": 944, "last_played": 1736853651}, "language": "french", "review": "En résumé : c'est un bon jeu, difficile mais rigolo, qui a besoin de polish (mais qui malheureusement n'en aura jamais) et qui nous permet de créer nous même notre aventure, dans un civilization version might and magic. En somme : c'est la sandbox ultime pour les joueurs qui n'ont pas de compétence de modding et qui veulent personnalisé leur experience eux même (merci a l'outil d'édition intégré).\r\n\r\nWarlock 2: The Exiled, est meilleur que le premier opus en tout points ou presque : \r\n\r\n-Plus de sorts et surtout la possibilité de les personnalisés comme on le souhaite dans l'éditeur intégré (que ce soit pour les nerfs ou les améliorés comme on le souhaite)\r\n\r\n-Une vraie utilité des mondes secondaires : on commence tout simplement dans ceux ci pour rejoindre notre \"terre d'origine\", qui du coup est beaucoup plus grande que tout les autres mondes, mais aussi bien plus dangereux.\r\n\r\n-Une personnalisation énorme, parce que oui je parle des sorts, mais en sois on peu créer son propre archimage, ses propres quêtes, ses propres campagnes ... C'est beaucoup d'investissement en temps de préparer son jeu comme on souhaite, mais c'est très gratifiant. D'une certaine façon on peut se dire qu'on fait le taf des devs a leur place, mais d'un autre au moins on fait exactement ce qu'on veut faire.\r\n\r\n-Plus de monstres, plus de races, plus de biomes ... bref c'est vraiment une grosse amélioration.\r\n\r\nEn revanche en points négatifs : \r\n\r\n-Les quêtes ! Alors c'est bourré de ref (sacré graal ou robin des bois par exemple) mais certains de ces event m'ont fait HURLER, en plus d'être hyper intrusifs (parce que ça te tombe sur la gueule sans prévenir, jusqu'au spam même) des fois, sans pression, ça te balance une troupe de paysan en colère (mine de rien ils sont vraiment balaise) et puis tu avance plus ... Grace a la personnalisation on peut choisir de désactiver ces quêtes intrusives et punitives, mais encore faut-il le savoir et trouver les bonnes quêtes dans la liste ...\r\n\r\n-L'interface ... Moche, j'ai pas d'autre mot, c'est comme si le jeu avait pris une interface des jeux des années 90 ... C'est rebutant mais on s'y fait malgré tout.\r\n\r\n-Les boss de fins ... DES SACS A PV j'ai même pas eu la force de finir le jeu tellement c'est n'importe quoi, en plus je sais pas pourquoi, mais j'était incapable de tuer l'un d'entre eux qui pourtant était isolé avec un pauvre PV, beau faire, il voulais pas mourir, j'ai pas compris ... \r\n\r\nMerci d'avoir tout lu pour les curieux, et bon résumé aux autres !", "timestamp_created": 1736612639, "timestamp_updated": 1736612639, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.584813475608825684", "comment_count": 7, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 864, "total_negative": 378, "total_reviews": 1242}, "cursors": {"AoJ4yLuOy/kCdtzO4AI=": "Mon Jan 20 15:57:37 2025"}}
