{"reviews": {"185532823": {"recommendationid": "185532823", "author": {"steamid": "76561198033632557", "num_games_owned": 672, "num_reviews": 106, "playtime_forever": 455, "playtime_last_two_weeks": 455, "playtime_at_review": 455, "last_played": 1736714283}, "language": "russian", "review": "На своем пути к лучам славы и десяткам наград, Larian перепробовали многое. Из под их крыла выходили игры разных жанров, иногда причудливо смешанных. (с) писал я про Ego Draconis.\r\n\r\nЭто же касается и Dragon Commander, которая представляет из себя смесь визуальной новеллы с 4х-стратегией и даже полноценной RTS, а также с легкими нотками авиасимулятора!\r\nЕсли немного упростить, то это Story-driven версия игр серии Total War. Задача игрока - захватить весь архипелаг, страну за страной, попутно принимая какие-то политические решения, влияющие на отношение населения и добычу ресурсов.\r\n\r\nИ эти политические решения - самое интересное, что есть в игре. Условно они делятся на 2 вида: взаимооотношения с советниками и с женой.\r\nК сожалению, не все из 7 рас Ривеллона добрались до релиза игры (хотя, судя по концепт-артам, они были в планах). В качестве советников не выступают представители Орков, а в жены нельзя взять еще и представительницу Импов.\r\n\r\nВсе действия разделены на условные дни: \r\n- Общаемся со всеми помощниками и советниками. Принимаем какие-то решения.\r\n- Улучшаем навыки дракона и исследуем улучшения для войск\r\n- Передвигаем армию по глобальной карте\r\n- Проводим локальные бои\r\n- Читаем новости в газете.\r\n\r\nLarian известны своим юмором, но в этой игре, кажется, он достигает пика абсурдности! Каждая раса - совершенно карикатурное представление какого-то актуального громкого движения.\r\nПочти каждый ход на голосование выносятся вопросы типа \"разрешить ли однополые браки\", \"дать ли право голоса женщинам нежити\", \"обложить церковь налогом или нет\" и т.д. У всех этих решений есть последствия. Во-первых, не всем расам понравится решения игрока, во-вторых, в зависимости от выбора пойдет сюжетная ветка и следующие голосования, а в-третьих, результаты будут опубликованы в местной газете.\r\nПричем изложены они будут в классическом формате \"Ученый изнасиловал журналиста\" - факты вывернуты наизнанку, а любые действия игрока будут поданы с негативной стороны.\r\n\r\nВ какой-то момент появится возможность выбрать себе в жены представительницу одной из рас. Это откроет дополнительные ветки развития событий, и тоже повлечет за собой какие-то последствия.\r\n\r\nЗа пререканиями советников так забавно наблюдать, что я бы даже перепрошел игру, чтобы увидеть все варианты развития событий. Но не хочется душиться об RTS часть.\r\n\r\nК слову о ней. Если 4х на глобальной карте еще достаточно увлекательно играется, то локальные сражения с прямым управлением вызывают только разочарование. Они аналогичны высадкам на планеты в Космических Рейнджерах. Но там подобные сражения были необязательными, но при этом игрались довольно увлекательно.\r\nЗдесь же сразу возникает ощущение, что разработчики не заходили в свою игру - настолько неудобное здесь управление камерой и юнитами.\r\nДаже возможность превратиться в дракона не добавляет разнообразия. В итоге я старался по максимуму использовать автоматический расчет боев. Благо он есть.\r\n\r\nИтог.\r\nDragon Commander - отличное развлечение на 1-2 вечера. Возможность узнать, что случилось после Ego Draconis, как развивалась история мира, встретить знакомых персонажей и поучаствовать в знаковом для лора событии. И всё это под узнаваемую сказочную музыку Кирилла Покровского.", "timestamp_created": 1736798590, "timestamp_updated": 1736798590, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.547014415264129639", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185350216": {"recommendationid": "185350216", "author": {"steamid": "76561198020595897", "num_games_owned": 2722, "num_reviews": 126, "playtime_forever": 2416, "playtime_last_two_weeks": 0, "playtime_at_review": 2416, "last_played": 1597090864}, "language": "english", "review": "Dragon Commander is a unique blend of RTS, RPG and action combat (you use a dragon in fights), that focuses on making political decisions between different factions, that affect the world and the campaign; has a nice art-style (full of vibrant colors, stylized graphics), and a fitting soundtrack. The dragon combat can feel repetitive after a while, the RTS mechanics are a bit underbaked and some fights feel imbalanced, especially towards the end, but overall it's a decent game.", "timestamp_created": 1736603294, "timestamp_updated": 1736705318, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.557157576084136963", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185343747": {"recommendationid": "185343747", "author": {"steamid": "76561199799537849", "num_games_owned": 19, "num_reviews": 3, "playtime_forever": 167, "playtime_last_two_weeks": 167, "playtime_at_review": 167, "last_played": 1736597398}, "language": "russian", "review": "Монополия+симулятор дракона+стратегия в мире дивинити. В детстве казалась очень сложной, а став старше прошла ее меньше, чем за 3 часа. Ну это было круто. По акции само то. Вроде хотят выпустить вторую часть этой игры, но более проработанную и в стиле дивинити 2. Лично я надеюсь, что это не слухи и жду. Люблю эту игру, люблю мир игры. Жена эльфийка, которая ест мясо и бухает с гномами 100/10.", "timestamp_created": 1736597602, "timestamp_updated": 1736597602, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185066867": {"recommendationid": "185066867", "author": {"steamid": "76561198044853651", "num_games_owned": 0, "num_reviews": 13, "playtime_forever": 2211, "playtime_last_two_weeks": 476, "playtime_at_review": 2211, "last_played": 1736300368}, "language": "english", "review": "Good Game.", "timestamp_created": 1736300446, "timestamp_updated": 1736300446, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184758169": {"recommendationid": "184758169", "author": {"steamid": "76561198325476467", "num_games_owned": 0, "num_reviews": 266, "playtime_forever": 111, "playtime_last_two_weeks": 0, "playtime_at_review": 111, "last_played": 1736010893}, "language": "russian", "review": "+", "timestamp_created": 1736011835, "timestamp_updated": 1736011835, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184477027": {"recommendationid": "184477027", "author": {"steamid": "76561198440237299", "num_games_owned": 87, "num_reviews": 13, "playtime_forever": 1112, "playtime_last_two_weeks": 0, "playtime_at_review": 1054, "last_played": 1735775986}, "language": "russian", "review": "Классная игрушка всем советую", "timestamp_created": 1735773427, "timestamp_updated": 1735773427, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184161107": {"recommendationid": "184161107", "author": {"steamid": "76561199091837480", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 663, "playtime_last_two_weeks": 0, "playtime_at_review": 661, "last_played": 1735591214}, "language": "english", "review": "Diamond in the rough, still a bit rough but definitely worth pushing through some of the less developed aspects to see the shine beneath the rough.", "timestamp_created": 1735511774, "timestamp_updated": 1735511774, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183943953": {"recommendationid": "183943953", "author": {"steamid": "76561198006555024", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 386, "playtime_last_two_weeks": 0, "playtime_at_review": 386, "last_played": 1735354762}, "language": "english", "review": "In a single campaign I was able to:\n\nTurn my vegan wife into a burger-loving alcoholic;\nWeigh in on genocide; \nBan dwarven nudists;\nPreserve lesbian statues;\nLegalize medicinal weed;\nPiss off Yennefer so badly and so often that she founded a school for women to keep them away from me.\n\n\nA forgotten gem with some surprisingly dark themes. Charming voice acting and endearing characters. Simple RTS that's easy to cheese - come for the choices and the factions involved.\n", "timestamp_created": 1735355031, "timestamp_updated": 1735355031, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.562904953956604004", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183786125": {"recommendationid": "183786125", "author": {"steamid": "76561197991500129", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 2557, "playtime_last_two_weeks": 0, "playtime_at_review": 2520, "deck_playtime_at_review": 36, "last_played": 1735392385}, "language": "english", "review": "Dragon Commander is not a bad game, but i can get the other reviews saying, it has it's issues. Yes it does. However i think the campaign mode feels surprisingly good, a lot of little bits and jokes and it has a couple interesting decisions. That being said, it is also rather short and while your choices do influence certain aspects somewhat, there is no real change of the story or the endings.\n\nHowever i still had a lot of fun with it over the years. And it's a game i occasionally come back to. \n\nThe RTS Element feels a little repetitive after some time. There are only a handful of maps and units. And it is sometimes very easy to just overpower everything with Hunters lol. The dragon is a nice gimmick, but feels extremely unbalanced. It can either really turn the tide of battle, or just gets killed in a matter of seconds. \n\nOverall it's really not a bad game, but it sometimes feels a bit rushed here and there. I guess most work at the time went to Original Sin, which would explain the shortcomings here. I kinda wish Larian would remake this with a proper budget and time, since then i think this could become a really great game. \n\nStill, i enjoyed it, and while it has it's shortcomings it's fun to play. So i recommend it. However it would be good if you enjoy Larians writing / jokes / setting, since that is really the main factor to look into this game.", "timestamp_created": 1735241759, "timestamp_updated": 1735241914, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 1742, "total_negative": 612, "total_reviews": 2354}, "cursors": {"AoJwgfW80YcDfN3jigQ=": "Mon Jan 20 16:53:33 2025"}}
