{"reviews": {"185976638": {"recommendationid": "185976638", "author": {"steamid": "76561198019387775", "num_games_owned": 406, "num_reviews": 21, "playtime_forever": 835, "playtime_last_two_weeks": 830, "playtime_at_review": 835, "last_played": 1737321245}, "language": "english", "review": "[h1] BETRAYAL! - Wait no. This isn't that bad [/h1]\n\nThis game was never going to be a runaway success, It’s design as a tactical action shooter left it firmly in the shadow of the unreleased X-com: Alliance. An FPS Squad shooter slated for 2001. But releasing this near simultaneously with Enemy Unknown was a detrimental mistake that buried this game.\nWhich is a shame, because its not bad- despite a few questionable design choices.\n\n[h2] This doesn't make the best first impression [/h2]\n\nAhem. If you check out the steam discussions many will complain the AI is underwhelming, which it half-true. The companions are lobotomised, until you get them to level 5. Then they become responsive and more importantly have enough health to not immediately keel over & die to every encounter.\nAny orders you direct to your squad are immediately carried out, they even change texture to illustrate they’re following your commands. Their actions are queued and each class has their own set of unique abilities all designed to synergise.\nSupport casts Disrupt, you use the ability levitate, then Recon uses Critical strike. \nCongrats!\nYou just killed everything except for a Muton or Sectopod. If you time it right.\n\nCommands are done through a proto Fallout 4 VATS system where time slows down, and there is even a mass effect dialogue wheel for interacting with characters. It’s neat. \n\nThe squad is limited just to three which sucks since the player counts as a unit.\nMind control is a late game action which really adds tactical variety. Deployable drones, Turrets and Silacoid’s all work surprisingly well.\nThe combat is satisfying once you level up your roster of companions. Don’t worry about the permadeath, you can simultaneously send new recruits off to do automated missions as you play which levels them up.\nA Total party kill is easily replaceable with no disadvantage, just customise the new squad to look like the old.\nBy the mid game I didn’t need to micromanage my companions anymore, they could tank most things, the AI automatically avoids grenades to the point they’ll never be hit. It’s nice… You just have to get them to level 5 because the starting health pool and their lack of abilities really screws with the AI’s capability to dynamically react.\nThese soldiers were lobotomised in the early game, they do get better.\n\n[h2] The difficulty is meaningless [/h2]\n\nYou will never fight more than two mutons until the final level, you will only encounter a maximum of two Sectopod’s, only a handful of optional side missions have Sectoid’s swam you on mass and the Outsiders and all their variants can be managed systematically. Difficulty has no bearing on the mechanics.\nIt just nerfs your abilities and turns everything into a bullet sponge if you raise it.\nWhilst I completed it on Commander difficulty, I did replay a little bit on novice and the early game was more enjoyable. The spawns didn’t change, only the enemie’s health.\nCall me old fashioned but a Muton shouldn’t have more health than a Sectopod, quadrupedal tank. But on commander oh boy they do.\nThere is no intended difficulty unlike in classic X-com or Enemy unknown. Play around with it.\nFind a comfortable balance between your damage output and the enemy’s strength.\n\n[h2] It has the spirit of X-Com [/h2]\n\nIt's no secret that a bunch of X-Com fans rejected [strike] Two & Chimera Squad [/strike] because it betrayed the core themes of the franchise.\nThe indomitable human spirit adapting and overcoming Alien, Lovecraftian and interdimensional threats. A rag tag group of rainbow resistance warriors isn’t X-com.\nThe idea that we’re in waters so uncharted that despite have an entire facility, bureau, military or even a full-on megacity at your disposal. And you’re still on the backfoot is X-Com. It’s the best of the best having to rise beyond their limitations to save humanity. It shouldn’t be a plucky underdog story.\nIt’s a war of attrition between the best & brightest and the horrors of the uknown.\n\nThe Bureau, X-Com declassified [i] gets [/i] this. It understands the necessity of having an established facility which is impressive considering there is zero research or base management. \n\nEveryone around you is a highly trained professional from various background selected to defend humanity. It’s X-Com with a little more personality and a stronger than average narrative. \nIs it a good narrative? \nEh, it has major pacing issues. There are only 7 mainline and 7 optional missions. But it doesn’t playout as predictably as the classics or Enemy Unknown does, someone was having fun writing this and whilst its brevity takes away from the intended emotional impact… \nIt has more going on than most 7th gen shooters. \n\n[h2] The none existent technical hic-ups [/h2]\n\nA lot of people state this game doesn’t run on windows 11.\nI have the dreaded 24H2 build and it runs perfectly. [b] First time booting the game did take several minutes [/b] but every start up afterwards was immediate.\nI’m running an Integrated RTX 3050 4gb, hardly cutting edge stuff for the 2020’s and the game ran with out a single crash.\nThe cutscenes are pre-recorded in 720p with some terrible compression. It looks bad.\n\nThere is full controller support right out of the box, plays well with my 3rd party Xbox One controller. No issues.\nThe texture work is surprisingly great, you can read almost all the chalkboards, posters and graffiti present in the environments. It adds to the conspiracy latent atmosphere the game is striving for.\n\n[h2] It’s well worth it when on a sale [/h2]\n\nFor $2 of $5 it’s a fun little distraction, it’s hardly the betrayal Spoony [Godspeed my sweet prince, find the help you need] led me to believe it was back in 2012.\nIt’s far from the worst entry in the franchise.\nSure, if Alliance was playable this would be a redundant entry (Unless you really liked the cold war aesthetic) but as some one who brought this after sinking 150+ hours into Enemy within in the space of two weeks, yeah this has the X-Com spirit I yearn for. \n\n10-15 Hours of gameplay, if you get the DLC then I could see 20 at a push. There is no new game plus or randomly generated missions everything in this game was purposely designed which is something of a lost art now-a-days.\n\nI will add the marketing for this game did it no favours, like seriously. This isn’t a bad game it’s just that everything surrounding it, including its marketing absolutely betrayed it. Heh. I guess there was betrayal after all.", "timestamp_created": 1737325592, "timestamp_updated": 1737325694, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185949147": {"recommendationid": "185949147", "author": {"steamid": "76561197984683092", "num_games_owned": 736, "num_reviews": 117, "playtime_forever": 549, "playtime_last_two_weeks": 1, "playtime_at_review": 549, "last_played": 1737299483}, "language": "english", "review": "Game does not work more, just crash when launch it", "timestamp_created": 1737301219, "timestamp_updated": 1737301219, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.516619682312011719", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185929864": {"recommendationid": "185929864", "author": {"steamid": "76561197978903294", "num_games_owned": 936, "num_reviews": 123, "playtime_forever": 490, "playtime_last_two_weeks": 0, "playtime_at_review": 490, "last_played": 1496996929}, "language": "german", "review": "Super Game!", "timestamp_created": 1737282785, "timestamp_updated": 1737282785, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185736006": {"recommendationid": "185736006", "author": {"steamid": "76561198096207758", "num_games_owned": 684, "num_reviews": 32, "playtime_forever": 650, "playtime_last_two_weeks": 359, "playtime_at_review": 650, "last_played": 1737059442}, "language": "english", "review": ":)", "timestamp_created": 1737059466, "timestamp_updated": 1737059466, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185694009": {"recommendationid": "185694009", "author": {"steamid": "76561198041037717", "num_games_owned": 0, "num_reviews": 15, "playtime_forever": 1607, "playtime_last_two_weeks": 1250, "playtime_at_review": 1477, "last_played": 1737400046}, "language": "english", "review": "Game is great! If only I could get pass selecting a squad?", "timestamp_created": 1737009502, "timestamp_updated": 1737009502, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185455682": {"recommendationid": "185455682", "author": {"steamid": "76561198002530277", "num_games_owned": 1010, "num_reviews": 62, "playtime_forever": 1093, "playtime_last_two_weeks": 0, "playtime_at_review": 1093, "last_played": 1593852953}, "language": "english", "review": "I met one of the writers of this game at a festival, and said I quite liked it. \"But,\" he protested, \"that's the *bad* XCOM!\"", "timestamp_created": 1736703793, "timestamp_updated": 1736703793, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185422781": {"recommendationid": "185422781", "author": {"steamid": "76561198045019032", "num_games_owned": 0, "num_reviews": 28, "playtime_forever": 1070, "playtime_last_two_weeks": 1070, "playtime_at_review": 1070, "last_played": 1736671172}, "language": "english", "review": "Firstly make sure to turn off the PhysX settings as they cause lots of crashes, once I disabled those it was smooth sailing, \n\nI want to put down my thoughts on the game while I'm still fresh from finishing so sorry if this comes across as a little disjointed. I did really enjoy playing the game, it's sort of a Mass Effect style with more emphasis on abilities and fine control of your squad mates. But beware the first two missions are by far the games weakest as you get used to the controls and you start getting enough abilities to reliably deal with situations. There's some good weapon variety and most weapons have some sort of niche throughout the game and enemy variety is even better though sadly the more specialist ones are rather rare to fight, though with good reason as they easily affect the entire firefight with their abilities.\n\nThere's about 7 main missions each of which has decent length with a single exception that have around 100 enemies and about an equal number of side missions of much shorter duration but still decent with I'd say an average of 40-50 enemies.\n\nAvoiding spoilers, story wise there's a good plot there but I have to wonder how many problems there were in development as I think some bits of exposition got forgotten about and are later referred back to regularly. There are multiple endings and your choices are sometimes called back to but the deciding decision is much later on and think very carefully on it unlike me who got the worst one by seeing the good in someone. Ending does feel rather rushed though. I just feel like the games story would of went better with a little bit more buildup in the beginning or a better sense of how long events have been happening to give a better sense of scale or urgency.", "timestamp_created": 1736672415, "timestamp_updated": 1736672733, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185421098": {"recommendationid": "185421098", "author": {"steamid": "76561198338336590", "num_games_owned": 260, "num_reviews": 4, "playtime_forever": 37, "playtime_last_two_weeks": 37, "playtime_at_review": 37, "last_played": 1736671356}, "language": "schinese", "review": "点下键盘就闪退，点鼠标没事", "timestamp_created": 1736671408, "timestamp_updated": 1736671408, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185335695": {"recommendationid": "185335695", "author": {"steamid": "76561198057839697", "num_games_owned": 0, "num_reviews": 57, "playtime_forever": 981, "playtime_last_two_weeks": 0, "playtime_at_review": 981, "last_played": 1453948675}, "language": "english", "review": "Game does not launch, gets stuck \"updating executable\" then just stops. Used to be decent but looks like it has been abandoned now", "timestamp_created": 1736589520, "timestamp_updated": 1736589520, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185266966": {"recommendationid": "185266966", "author": {"steamid": "76561199480257197", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 56, "playtime_last_two_weeks": 56, "playtime_at_review": 56, "last_played": 1736464294}, "language": "koreana", "review": "뭐라 말하긴 애매하지만  그냥 추천은 받을만 합니다.  만족하는 사람도 있고  불만족인 사람도 있겠지만요.   그냥 외계인한태 총쏘는 옛날 엑스컴 게임이구나~  하고 생각해야겠죠.   이 게임에 대한 비판등  많은게 당연할겁니다.  하지만 할인할때 돈이 남아돌면 할만한 옛날 게임.", "timestamp_created": 1736523830, "timestamp_updated": 1736523830, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185229694": {"recommendationid": "185229694", "author": {"steamid": "76561197965422061", "num_games_owned": 60, "num_reviews": 7, "playtime_forever": 283, "playtime_last_two_weeks": 0, "playtime_at_review": 283, "last_played": 1514946716}, "language": "english", "review": "Meh.", "timestamp_created": 1736483066, "timestamp_updated": 1736483066, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185142945": {"recommendationid": "185142945", "author": {"steamid": "76561198424136449", "num_games_owned": 50, "num_reviews": 9, "playtime_forever": 1168, "playtime_last_two_weeks": 170, "playtime_at_review": 1168, "last_played": 1736376410}, "language": "ukrainian", "review": "Мені не зовсім зрозуміло, що деякі вважають цю гру невдалою. Так, вона відрізняється від інших серій XCOM, проте це зовсім інший жанр. Зовсім інша механіка гри. Навпаки, тут відтворили гру зовсім з іншого боку і покрокова стратегія сюди б зовсім не лягла, оскільки втратився б її темп і емоції, які динаміка гри диктувала. Шикарна гра, з шикарним сюжетом, з різними кінцівками. Однозначно рекомендую до проходження, проте одразу раджу ставити складність вище за другу, оскільки за всю гру я впав лише двічі, тому якби було трохи важче, то мабуть це додало ще більше емоцій під час гри.", "timestamp_created": 1736376585, "timestamp_updated": 1736376585, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185101670": {"recommendationid": "185101670", "author": {"steamid": "76561198297518816", "num_games_owned": 0, "num_reviews": 112, "playtime_forever": 78, "playtime_last_two_weeks": 1, "playtime_at_review": 77, "last_played": 1736510322}, "language": "russian", "review": "С 1 января 2025 года эта пoмoйкa больше не запускается никаким из двух режимов, предлагаемых при старте игры. Кусок нерабочего мycopa, дepьмищe. При этом игра худо-бедно еще работала в декабре 2024-го. Ни в коем случае не покупайте ни за какие деньги. Это больше не работает. Из вишлистов тоже можете удалять спокойно.\n\nSince January 1, 2025, this gаrbаgе dumр will no longer launch in any of the two modes offered at launch. A piece of non-working thrash, piece of сrар. At the same time, the game worked in December 2024. Do not buy it under any circumstances, for any money. It's [u][b]do not work anymore[/b][/u]. You can also safely delete it from your wishlists.", "timestamp_created": 1736339451, "timestamp_updated": 1736339509, "voted_up": false, "votes_up": 21, "votes_funny": 1, "weighted_vote_score": "0.679431736469268799", "comment_count": 9, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false, "primarily_steam_deck": false}, "185093315": {"recommendationid": "185093315", "author": {"steamid": "76561198050696792", "num_games_owned": 414, "num_reviews": 28, "playtime_forever": 894, "playtime_last_two_weeks": 0, "playtime_at_review": 894, "last_played": 1432087384}, "language": "koreana", "review": "4.5/5\n\n본작만큼 재미있고, 본작보다 흥미로운 시대관과 스토리. 솔직히 얘들 외전을 더 잘만드는 듯.", "timestamp_created": 1736330325, "timestamp_updated": 1736330325, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184904424": {"recommendationid": "184904424", "author": {"steamid": "76561198795913212", "num_games_owned": 240, "num_reviews": 64, "playtime_forever": 78, "playtime_last_two_weeks": 0, "playtime_at_review": 78, "last_played": 1547486415}, "language": "english", "review": "In 2025, going back to The Bureau: XCOM Declassified feels like opening a time capsule from a different era of gaming. Originally released in 2013, this tactical third-person shooter set in the XCOM universe might have been divisive upon launch, but in hindsight, it deserves way more credit than it got.\n\nFirst off, the atmosphere is immaculate. The 1960s Cold War setting is rich with detail, from the retro-futuristic tech to the period-appropriate aesthetic in clothing and environments. The game blends its sci-fi alien invasion storyline with the paranoia and tension of the era, creating a world that feels unique even today.\n\nGameplay is where The Bureau truly shines if you’re a fan of tactical combat. The blend of real-time shooting and squad-based strategy might not be as deep as its XCOM siblings, but it offers a satisfying middle ground for players who want action with a layer of thoughtfulness. Issuing commands mid-battle – directing squadmates to flank enemies, set up turrets, or deploy special abilities – makes combat feel dynamic and rewarding. It’s especially gratifying when your well-executed strategy wipes out a tough group of Outsiders.\n\nThe story is surprisingly engaging, with a few twists that keep you hooked until the end. While Agent Carter isn’t the most charismatic protagonist ever, the voice acting and dialogue choices help flesh him out. Plus, the choices you make throughout the game subtly impact the outcome, giving you a reason to revisit it.\n\nYes, the game isn’t perfect. The cover mechanics can feel clunky, and the AI occasionally makes some hilariously poor decisions. But these quirks don’t overshadow the overall experience. Instead, they add to the charm of a game that wasn’t afraid to try something different within the XCOM franchise.\n\nIn 2025, The Bureau stands as a reminder that risk-taking in game design is worth it, even if it doesn’t hit perfectly. For fans of tactical shooters, XCOM enthusiasts, or anyone looking for a unique sci-fi story, it’s worth dusting off this title and giving it another shot. With its tactical depth, immersive atmosphere, and underrated narrative, The Bureau is a hidden gem that deserves its moment in the spotlight.", "timestamp_created": 1736146024, "timestamp_updated": 1736146024, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184702590": {"recommendationid": "184702590", "author": {"steamid": "76561198002636573", "num_games_owned": 551, "num_reviews": 94, "playtime_forever": 1528, "playtime_last_two_weeks": 0, "playtime_at_review": 573, "last_played": 1736113867}, "language": "english", "review": "Squads are more of a liability than an asset. Problem is, they're the whole game. Also, was this game made for a two button console in mind? Shift is the only other button there is, sorry. Their space and control keys must have been broken during development.", "timestamp_created": 1735960570, "timestamp_updated": 1736017457, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184649910": {"recommendationid": "184649910", "author": {"steamid": "76561198055506703", "num_games_owned": 200, "num_reviews": 13, "playtime_forever": 711, "playtime_last_two_weeks": 0, "playtime_at_review": 711, "last_played": 1735916791}, "language": "english", "review": "2K is trash, always has been with few exceptions. This game is no longer playable, even though everything on my end is up-to-date. Marin was closed, so the responsibility falls on the publisher.", "timestamp_created": 1735918391, "timestamp_updated": 1735918391, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.479873090982437134", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184549610": {"recommendationid": "184549610", "author": {"steamid": "76561198082363574", "num_games_owned": 0, "num_reviews": 163, "playtime_forever": 337, "playtime_last_two_weeks": 0, "playtime_at_review": 337, "last_played": 1735839199}, "language": "turkish", "review": "Oynamasanız da olur", "timestamp_created": 1735839248, "timestamp_updated": 1735839248, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.559661269187927246", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184434298": {"recommendationid": "184434298", "author": {"steamid": "76561198146171065", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 302, "playtime_last_two_weeks": 0, "playtime_at_review": 302, "last_played": 1702083610}, "language": "koreana", "review": "실행이 왜안되는건지 해결좀해줘라!!!!!!!!!!!", "timestamp_created": 1735742329, "timestamp_updated": 1735742329, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184417446": {"recommendationid": "184417446", "author": {"steamid": "76561198131923777", "num_games_owned": 1786, "num_reviews": 283, "playtime_forever": 590, "playtime_last_two_weeks": 0, "playtime_at_review": 590, "last_played": 1735728017}, "language": "schinese", "review": "重温通关，以前电脑配置不行的时候玩的感觉挺有意思的", "timestamp_created": 1735728213, "timestamp_updated": 1735728213, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.535452306270599365", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184230526": {"recommendationid": "184230526", "author": {"steamid": "76561197970330395", "num_games_owned": 0, "num_reviews": 136, "playtime_forever": 845, "playtime_last_two_weeks": 0, "playtime_at_review": 845, "last_played": 1390981454}, "language": "english", "review": "Nope", "timestamp_created": 1735574222, "timestamp_updated": 1735574222, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183846085": {"recommendationid": "183846085", "author": {"steamid": "76561198016535283", "num_games_owned": 0, "num_reviews": 167, "playtime_forever": 147, "playtime_last_two_weeks": 0, "playtime_at_review": 147, "last_played": 1735277000}, "language": "english", "review": "Crashed all the time til I disabled Phys X.  And yes people are having issues with it not running.  Set the Executable as administrator and just keep hitting play til it goes, it sucks but that's the only way to play.  Wish I could give a neutral review but, there's too many issues for it to be enjoyable.  Thanks 2k", "timestamp_created": 1735277172, "timestamp_updated": 1735277172, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.535383462905883789", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183787009": {"recommendationid": "183787009", "author": {"steamid": "76561198048405656", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 692, "playtime_last_two_weeks": 0, "playtime_at_review": 639, "last_played": 1735302581}, "language": "english", "review": "love it. wonderful fulfilling, masculine experience bro's", "timestamp_created": 1735242393, "timestamp_updated": 1735242393, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183666502": {"recommendationid": "183666502", "author": {"steamid": "76561198071825975", "num_games_owned": 0, "num_reviews": 75, "playtime_forever": 349, "playtime_last_two_weeks": 0, "playtime_at_review": 349, "last_played": 1719498477}, "language": "ukrainian", "review": "[b]Рецензія на \"The Bureau: XCOM Declassified\"[/b]\n\n\"The Bureau: XCOM Declassified\" – це спроба переосмислити франшизу XCOM, змістивши її з жанру покрокової стратегії у бік тактичного шутера. Результат вийшов неоднозначним: гра має кілька сильних сторін, але потерпає від низки проблем, які не дозволяють їй стати чимось більшим, ніж просто посереднім проєктом.\n\n[b]Сюжет і атмосфера[/b]\n\nПодії гри розгортаються в альтернативній версії 1960-х років, у розпал Холодної війни. У світі, де параноя, шпигунство та страх перед ядерною загрозою стали нормою, гравцеві належить взяти на себе роль Вільяма Картера – агента секретної організації XCOM, яка намагається врятувати людство від інопланетного вторгнення.\n\nСюжет починається багатообіцяюче, підкидаючи інтригу та відчуття глобальної змови, але чим далі, тим більше провисає. Герої залишаються поверхневими, їхній розвиток майже відсутній, а сама історія не пропонує достатньо несподіванок чи емоційної глибини, щоб захопити гравця до кінця. Попри це, атмосфера 60-х відтворена добре: стильні костюми, старі технології, автомобілі та загальний дух епохи додають грі шарму.\n\n[b]Геймплей[/b]\n\nГра намагається поєднати шутер від третьої особи з тактичними елементами. Ви керуєте невеликою групою агентів, кожен із яких має унікальні здібності, і можете видавати їм накази під час бою, використовуючи тактичну паузу. Це дозволяє розробляти стратегії для боротьби з ворогами, комбінуючи здібності команди та свої власні.\n\nНа папері це звучить цікаво, але на практиці система має значні недоліки. Штучний інтелект союзників часто діє нелогічно, змушуючи вас постійно контролювати їхні дії, щоб вони не потрапляли у смертельні пастки. Вороги не відзначаються великим різноманіттям, а тактика швидко зводиться до повторення одних і тих самих прийомів. Це створює відчуття одноманітності та знижує мотивацію до експериментів.\n\nЩодо стрілянини, вона виконує свою функцію, але не пропонує нічого видатного. Вогнепальна зброя відчувається стандартно, а самі перестрілки не такі напружені чи динамічні, як хотілося б.\n\n[b]Графіка і дизайн[/b]\n\nДля 2013 року графіка виглядає пристойно, але не більше. Дизайн локацій передає атмосферу епохи, але вони часто виглядають пустими та одноманітними. Анімації персонажів часом виглядають незграбно, особливо під час діалогів, що відволікає від занурення в сюжет.\n\n[b]Звук[/b]\n\nОдин із сильних аспектів гри – це звуковий дизайн. Музика добре підкреслює напруження та атмосферу 60-х років, а звукові ефекти додають битвам певної енергії. Озвучка персонажів виконує свою роботу, хоча деяким героям бракує емоційності.\n\n[b]Проблеми і недоліки[/b]\n\nГоловна проблема \"The Bureau\" полягає у її загальній посередності. Гра не достатньо тактична, щоб сподобатися фанатам класичного XCOM, і не настільки захоплююча як шутер, щоб конкурувати з іншими іграми цього жанру. Їй бракує різноманіття, глибини та полірування, що могло б зробити її видатною.\n\n[b]Вердикт[/b]\n\n\"The Bureau: XCOM Declassified\" – це гра, яка мала потенціал стати чимось унікальним, але не змогла реалізувати свої ідеї повністю. Вона може сподобатися фанатам атмосфери 60-х або тим, хто шукає щось нове у жанрі шутерів із тактичними елементами. Однак її недоліки роблять її скоріше доповненням до вашої бібліотеки, ніж обов’язковою покупкою.\n\nОцінка: 6/10. Хороша спроба, але не більше.", "timestamp_created": 1735144303, "timestamp_updated": 1735145413, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183564069": {"recommendationid": "183564069", "author": {"steamid": "76561197977738477", "num_games_owned": 444, "num_reviews": 58, "playtime_forever": 1191, "playtime_last_two_weeks": 0, "playtime_at_review": 1147, "last_played": 1735309051}, "language": "english", "review": "I totally understand why XCOM fans don't like this game. As most of the players, I remember the great trailers the game had very well. Look them up, the whole premise felt like somekind of a Fallout game set pre nuclear war. The looks changed drastically for some reason during the development. It's not a AAA banger, but it's a fairly good, yet clunky 3rd person squad shooter, serving as somekind of prequel to the 2K XCOM series. It plays like a Mass Effect clone set in the 60's with aliens. After 8 years I gave it another try and found it still to be entertaining, although the gameplay is pretty streamlined and dated, but the story is still pretty good and I vividly remember the well executed plot twist towards the end, So my current mood is pretty optimistic. If you're okay with clunky gameplay and want to experience a nicely written alien invasion story set in the 1960's, check it out, when it's in a sale. At the time I'm writing this review, it's on sale for 3.99 €, which is absolutely fine. Currently I'm playing it on a Windows 10 desktop PC and it didn't crash once.", "timestamp_created": 1735045344, "timestamp_updated": 1735045344, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183512577": {"recommendationid": "183512577", "author": {"steamid": "76561198130163832", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 598, "playtime_last_two_weeks": 0, "playtime_at_review": 352, "last_played": 1735528372}, "language": "english", "review": "I was drawn into this game when I first saw the alpha and beta teaser trailers in 2008.  I was intrigued by the setting, the Cold War, and how it was like a mix of Bioshock and Xcom.  When the game finally released and I had played through it in its entirety, I was left disappointed.  Unresolved plot elements, story segments that felt rushed and unfinished.  It definitely wasn't the Bioshock/Xcom mashup that I had first seen.  I really didn't like that fact that I had to micromanage my team in combat, let alone plan for one thing in real time just to have the enemy do something entirely different.  I feel Brothers in Arms executed this a little better as the mix of having to plan, micromanage my team, AND have to fight left me overwhelmed.  \r\nTo be honest, I really wanted to like this game.  One of my turn offs to the regular xcom games was the strategic elements.  I thought this one-off was going to try something new and different.  The live-action trailers definitely had me hooked.  This is just me though.  You'll have to try it out for yourself.", "timestamp_created": 1734988385, "timestamp_updated": 1734988385, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52173912525177002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183510387": {"recommendationid": "183510387", "author": {"steamid": "76561198129062272", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 1318, "playtime_last_two_weeks": 0, "playtime_at_review": 1170, "last_played": 1735775349}, "language": "english", "review": "its basically an xcom themed mass effect game. as long as youre clear on what to expect, it's a good game. keep in mind it's 11 years old.", "timestamp_created": 1734986550, "timestamp_updated": 1734986550, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.566666662693023682", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 8207, "total_negative": 3479, "total_reviews": 11686}, "cursors": {"AoJwv5SJ5Y8De6vF+gQ=": "Mon Jan 20 15:38:55 2025"}}
