{"reviews": {"185875742": {"recommendationid": "185875742", "author": {"steamid": "76561198360968339", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 520, "playtime_last_two_weeks": 522, "playtime_at_review": 258, "last_played": 1737319422}, "language": "english", "review": "Very sad to have found this game when I did (4.3 Hours of game play so far). This game is chock-full of player engagement with it's unique game play style. WASD movement, standard #s for skill Hotkeys, aim mouse pointer/click for standard attacks (non-target system), and No Auto features. I can see this game being amazing with it's PVP content considering it semi-bridges the gap between Action-MMORPG and a live-action fighter bringing very fast combat. Although under-populated and old: Aurcus Online has very similar combat and wanted to find a game with a similar game play style. This is like an advanced version of that game imo.\nI am running the game on my Low-quality Dell Laptop and it plays relatively smooth. I see Dragon Sword is on the horizon and it looks gorgeous! However, I sadly do not own a PC or have the Money to afford one to be able to play it... This game satisfies this old craving for a game of this nature and hope that it sticks around so I can experience this game for a while.\nI have been soloing since I have started and find that jumping to Level 99 as a new player leaves me lost (with a plethora of game/character building mechanics that was skipped and not \"warmed\" into having to do. Also, where to start that doesn't result in dying once out of the tutorial). Starting from Level 1 though has been easy... yet, a blast because of the game mechanics! Also, looks like fun if a friend wants to run quests with you in a party too.\nOnce again, although the beautiful Dragon Sword game is in development; I hope Eyedentity keeps this game around so I can have fun soloing/bringing friends along for the journey. I appreciate this awesome game A LOT!\n\nP.S.- Please put Cooler wing options in the Cash shop for purchase. I do like the stat bonuses the wing/tail costumes provide. However, I am not looking to look like a feminine wolf Pegasus.", "timestamp_created": 1737222133, "timestamp_updated": 1737222133, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185084834": {"recommendationid": "185084834", "author": {"steamid": "76561198031001203", "num_games_owned": 0, "num_reviews": 156, "playtime_forever": 263, "playtime_last_two_weeks": 155, "playtime_at_review": 263, "last_played": 1736320927}, "language": "english", "review": "This game feels like something built to be a TAB target game but they slapped Action combat on it for novelty, the attacks have no weight, you cant interrupt attacks with a dodge and boss type enemies don't flinch at all leading to what feels like a ton of unavoidable damage.", "timestamp_created": 1736321214, "timestamp_updated": 1736321214, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184821609": {"recommendationid": "184821609", "author": {"steamid": "76561198097686286", "num_games_owned": 142, "num_reviews": 31, "playtime_forever": 429, "playtime_last_two_weeks": 27, "playtime_at_review": 429, "last_played": 1736523982}, "language": "english", "review": "It could be (and apparently used to be) very very good. The combat feels fluid and I love the style of everything. The world felt nice but there is no one here anymore.\n\nThe only way to have fun now is to treat it as a single player adventure and enjoy the atmosphere. Even that is kind of difficult though, because at some point they completely destroyed the balance and you one hit everything. What I did to remedy this was find a good balance of removing gears and setting the dungeons on highest difficulty. \n\nI guess I will leave my review as positive because it's a free game that you can get some enjoyment out of with a little bit of work and balancing.", "timestamp_created": 1736070907, "timestamp_updated": 1737139046, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183749343": {"recommendationid": "183749343", "author": {"steamid": "76561198019957138", "num_games_owned": 273, "num_reviews": 11, "playtime_forever": 2264, "playtime_last_two_weeks": 0, "playtime_at_review": 2264, "last_played": 1644527230}, "language": "english", "review": "This game is as close to a legit scam as you can get, without actually being a true scam.\n\n\nHORRIBLE choices by increasingly greedy devs drove this once amazing game right into the ground in a messy fireball.\n\nThis is the prime example of a company caring more about money than their game.", "timestamp_created": 1735218900, "timestamp_updated": 1735218900, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.513524711132049561", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 1659, "total_negative": 633, "total_reviews": 2292}, "cursors": {"AoJ414jyjfsCe8qa8gI=": "Mon Jan 20 15:25:42 2025"}}
