{"reviews": {"184996706": {"recommendationid": "184996706", "author": {"steamid": "76561198410151510", "num_games_owned": 187, "num_reviews": 30, "playtime_forever": 949, "playtime_last_two_weeks": 227, "playtime_at_review": 774, "last_played": 1736341313}, "language": "schinese", "review": "第一个L", "timestamp_created": 1736233459, "timestamp_updated": 1736233459, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184743693": {"recommendationid": "184743693", "author": {"steamid": "76561198083983697", "num_games_owned": 216, "num_reviews": 121, "playtime_forever": 967, "playtime_last_two_weeks": 0, "playtime_at_review": 967, "last_played": 1735999921}, "language": "english", "review": "Solid shmup if a bit too easy compared to every other entry in the series.\r\nI'm not quite sure what happened here, after LoLK which was probably the hardest and most unbalanced entry in the series we have this game which is possibly the easiest and also with some of the most balanced shottypes. Pretty much every single combination of character + season is viable and interesting to play, some are better at easier difficulties and some are better for harder ones but overall still very pleasant to play as.\r\nThe gimmick of season release is probably the reason why this game is possibly the easiest Touhou game out there - it serves as additional DPS when charged and as a free bomb when released which greatly increases the amount of resources you have and makes the game much easier to bruteforce. Proper combination of character + season makes even lunatic relatively doable even for someone as low-skilled as me.\r\nGame being relatively easy doesn't make it bad however, it's definitely not as bland as TD and it's just easy compared to other games in the series, on it's own it's still challenging and you have to pay attention to what are you doing.\r\nMusic in this one is... weird. It's definitely good, but after playing it for a bunch of hours I still can barely recall any track, it's definitely not as memorable as previous entries. Something changed here and I cannot put my finger on what exactly but the tracks just don't stay in your memory for that long.\r\nStory and characters are both interesting, yeah it's yet another \"weather is weird - must be an incident\" plot that these games love to reuse and I'm not the biggest fan of Okina but it was still entertaining seeing all the story bits and interactions between the characters.\r\nOverall: solid entry, bit easy, worth playing but nothing too special other than relatively easy Luantic and probably the easiest Extra stage in the entire series to grab if anyone wants to for bragging rights.", "timestamp_created": 1736001946, "timestamp_updated": 1736001946, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184589515": {"recommendationid": "184589515", "author": {"steamid": "76561199137081963", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 580, "playtime_last_two_weeks": 258, "playtime_at_review": 309, "deck_playtime_at_review": 281, "last_played": 1737225620}, "language": "english", "review": "made it to the end of stage 6, beat okina and fucking lost by a single bullet while doing a 1cc", "timestamp_created": 1735870830, "timestamp_updated": 1735870830, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}, "184038365": {"recommendationid": "184038365", "author": {"steamid": "76561199016839210", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 770, "playtime_last_two_weeks": 0, "playtime_at_review": 721, "last_played": 1735501587}, "language": "english", "review": "This is by far my favourite touhou game. Not just the for the story, music, or visuals, but just how fun the gameplay is. The latest touhou games all seem to have lost the meaning of what popcorn is, but even if this one does not have popcorn, the stages are frantic and chaotic, but still possible to route. The bosses ? Some of the best in the series, I'd say. All of them explore very diffrent concept, culminating in the most interesting extra boss in the series.\r\nBut I think what takes the top for me is the scoring mechanic. If you've been playing without touching the C key, please try to use the seasonal releases at least once. The scoring system is simple, but the different subseasons you can choose give you a great versatility in how you can approach the many different situations. Will you go for the broad screen coverage of sub-spring ? The strategic immobility of sub-winter ? The whimsy of sub-summer ? Or maybe the frantic speed of sub-fall ? The choice is yours to take.", "timestamp_created": 1735426380, "timestamp_updated": 1735426380, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 9, "review_score_desc": "Overwhelmingly Positive", "total_positive": 4408, "total_negative": 67, "total_reviews": 4475}, "cursors": {"AoJwsti80P0CdZvMkgM=": "Mon Jan 20 20:01:59 2025"}}
