{"reviews": {"185609767": {"recommendationid": "185609767", "author": {"steamid": "76561198049305971", "num_games_owned": 1408, "num_reviews": 55, "playtime_forever": 421, "playtime_last_two_weeks": 421, "playtime_at_review": 421, "last_played": 1736879703}, "language": "spanish", "review": "Después de 7 horas, desbloquear la mayoría de localizaciones y llegar al nivel 25.\r\n\r\nEl Bucle jugable es muy simple, se alterna entre varios escenarios donde se jugara al minijuego de \"encuentra X cosa, varias veces\", en un pequeño mapa con zonas delimitadas. El otro minijuego que presenta son una variedad de puzzles lógicos para abrir los diferentes tiers de cofres del juego. Todo con mecánicas de barrera energía y generación de recursos por tiempos. Ya en el metagame se juega con los bundles de objetos a completar, que es simplemente mas grindeo. \r\n\r\nTodo en un intento de retener la atención del usuario, y freírlo a pop-ups de compras. Pues el juego hace un esfuerzo importante por cortarte el loop jugable con cartelitos de abrir cofres y comprar moneda del juego.\r\n\r\nPero el mayor problema del juego es que no hay progreso real. \r\nMe explico: El gameplay de la primera media hora no tiene diferencias con el gameplay de las 5 horas. Es todo el tiempo hacer la misma cosa y esperar a poder volver hacerla. \r\nToda la progresión del juego se enfoca desde las barreras para evitar agotar el \"contenido\", para alargar la experiencia.\r\nPero no hay evolución alguna. Ni aparecen nuevo tipos de minijuegos, ni nuevos enfoques o modos de juego. No hay variedad.\r\n\r\nSi tenéis curiosidad los primeros 20 minutos son muestra mas que suficiente de todo lo que tiene el titulo por ofrecer. Si buscáis algo con lo que abstraeros tenéis otras opciones muchísimo mas competentes y de largo recorrido, desde idle games (Melvor) hasta clickers ((the) Gnorp Apologue).\r\nNo perdáis mas el tiempo con el Lost Lands: A Hidden Object Adventure.", "timestamp_created": 1736894443, "timestamp_updated": 1736894443, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.537648618221282959", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185546021": {"recommendationid": "185546021", "author": {"steamid": "76561198351511189", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 107, "playtime_last_two_weeks": 107, "playtime_at_review": 77, "last_played": 1736998914}, "language": "english", "review": "It's any ok game.", "timestamp_created": 1736815074, "timestamp_updated": 1736815074, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185539943": {"recommendationid": "185539943", "author": {"steamid": "76561199248841413", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 541, "playtime_last_two_weeks": 541, "playtime_at_review": 26, "last_played": 1737343733}, "language": "english", "review": "fun but energy runs out fast", "timestamp_created": 1736806708, "timestamp_updated": 1736806708, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185497471": {"recommendationid": "185497471", "author": {"steamid": "76561198030784015", "num_games_owned": 10002, "num_reviews": 14691, "playtime_forever": 59, "playtime_last_two_weeks": 20, "playtime_at_review": 39, "last_played": 1736990273}, "language": "english", "review": "[quote]Warning: Microtransaction infested mobile app[/quote]\n\nLost Lands: A Hidden Object Adventure is one of thousands of nasty mobile apps infesting the \"free\" section of Steam, but it's not really free.\n\nThere's only a superficial \"game\" here.  a hidden object puzzle adventure like those massively overpriced Artifex Mundi puzzle games.  But it's not... there's no real lasting narrative or adventure, it's just endless rehashes of the same HOG puzzles. But that's not really what this is. \n\nIt's just a veneer wrapped around a nasty, predatory mobile app cash shop.\n\nThe true purpose of this mobile app is to get you to hand your credit card details to the greedy mobile devs so you can buy \"energy\" and other unlocks in the nasty cash shop... it's a mobile app cash harvester, and has no place in your game library.\n\nYou'll very quickly find you don't have enough \"energy\" to play more of the repetitive, samey mobile app HOG puzzles, so you have to pay the developers extortionate levels of money to keep playing... ugh.  It's cancerous monetisation... scamware, basically. \n\nBearing in mind that free games don't add +1 to your game collector count, should you bother adding this to your library and downloading it?\n\nNope.  This isn't worth downloading.  While this didn't cost me any money up front, I still feel ripped off.\n\nJust play an Artifex Mundi HOG if this is the kind of mobile app experience you're looking for.  They're shady too, but nowhere near as bad as this.", "timestamp_created": 1736754499, "timestamp_updated": 1736754543, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.568608641624450684", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185386793": {"recommendationid": "185386793", "author": {"steamid": "76561198822270822", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2813, "playtime_last_two_weeks": 2813, "playtime_at_review": 60, "last_played": 1737396206}, "language": "ukrainian", "review": "Не погана гра", "timestamp_created": 1736632367, "timestamp_updated": 1736632367, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185368690": {"recommendationid": "185368690", "author": {"steamid": "76561198053185264", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 734, "playtime_last_two_weeks": 734, "playtime_at_review": 122, "last_played": 1737348956}, "language": "english", "review": "I's a good chill vibe.  Overall I'm enjoying it.  The store is not intrusive.", "timestamp_created": 1736617875, "timestamp_updated": 1736617875, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185364657": {"recommendationid": "185364657", "author": {"steamid": "76561198240090042", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 329, "playtime_last_two_weeks": 292, "playtime_at_review": 139, "last_played": 1737312140}, "language": "english", "review": "if you like Hidden Object games, then you should like this Fantasy themed adventure. just be patient as it can be hard to see the hidden items sometimes, they blend in a lot of the time, as well as change positions.", "timestamp_created": 1736614743, "timestamp_updated": 1736614743, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185170212": {"recommendationid": "185170212", "author": {"steamid": "76561198049213193", "num_games_owned": 925, "num_reviews": 164, "playtime_forever": 2179, "playtime_last_two_weeks": 671, "playtime_at_review": 1652, "last_played": 1737401561}, "language": "english", "review": "Decent game.  It's the Hidden Object version of the Lost Lands Mahjong I've played on and off for years.  The energy refill can be annoying but, to me, makes it easier to do little bits now and then.   Don't stress about the timed missions, you'll get to them easier as you progress.  Story is alright.  I've not spent any money on this or the Mahjong version.  You can if you want but I don't feel it's pressured.  The popups of 'would you like to buy' are easily to ignore.", "timestamp_created": 1736414399, "timestamp_updated": 1736414399, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185026834": {"recommendationid": "185026834", "author": {"steamid": "76561198120032141", "num_games_owned": 8, "num_reviews": 1, "playtime_forever": 1309, "playtime_last_two_weeks": 1176, "playtime_at_review": 135, "last_played": 1737400409}, "language": "dutch", "review": "Nice between bigger games or while waiting.", "timestamp_created": 1736264144, "timestamp_updated": 1736264144, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184603058": {"recommendationid": "184603058", "author": {"steamid": "76561198128829339", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 61, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1736058357}, "language": "english", "review": "Fun game to just relax with!", "timestamp_created": 1735885382, "timestamp_updated": 1735885382, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184198854": {"recommendationid": "184198854", "author": {"steamid": "76561198991854808", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 146, "playtime_last_two_weeks": 74, "playtime_at_review": 14, "last_played": 1737363715}, "language": "english", "review": "It's a very fun and relaxing game. Highly recommend for fans of hidden object games.", "timestamp_created": 1735546315, "timestamp_updated": 1735546315, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183880392": {"recommendationid": "183880392", "author": {"steamid": "76561199070165953", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 67, "playtime_last_two_weeks": 0, "playtime_at_review": 30, "last_played": 1735310859}, "language": "german", "review": "Och ja, ganz nett, nur das man Energie zum Weiterspielen benötigt, ist doof.", "timestamp_created": 1735309472, "timestamp_updated": 1735309472, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183821800": {"recommendationid": "183821800", "author": {"steamid": "76561199737551973", "num_games_owned": 14, "num_reviews": 4, "playtime_forever": 2075, "playtime_last_two_weeks": 749, "playtime_at_review": 676, "last_played": 1737378287}, "language": "english", "review": "I will say, I can neither recommend this game nor not recommend it, bu, for the moment, it's recommend because it's what I was looking for. If I ever stop playing, I'll swap it back to not recommend, because, honestly, I wouldn't recommend it to anyone I know.\n\nPros: -I got what I was expecting: a free hidden object game in the style of I Spy instead of cartoon cats.\n-I can probably continue to play this as long as I want, as long as I put up with the restrictions.\n-I don't mind energy based games honestly, because it prevents me from hyperfocusing and spending hours on it without eating.\n-overall I am getting what I was looking for, so I'm willing to keep going.\n-although below I complain about the random people giving me quests and moving constantly, I do have to say that the more non-human the beings get, the better they are. The lizardsnakewhateverman has a very nice tail, all the things that walk around the map have markedly different walk and speed cycles in addition to being pretty interesting looking (maybe not the boar or kobold though), the ogre looks great, and the two dwarves are very dwarfy.\n\nNeutral: -I can already tell this is going to be the kind of game I'm supposed to grind for ages to get a lot of random things to complete quests.\n-Without the energy booster amulets, the energy recharge is actually really slow.\n-I'm probably missing out on experience by repairing stuff around the islands on my own but I would rather have the bonuses earlier than to wait on quests that may or may not appear.\n-I am unsure what the two different currencies are for besides, you know, pretending you can do buy things without real life money, but that just means I don't use them at all instead.\n\nCons: -my free mobile hidden object game on my iPhone 4 was better until it started forcibly updating and made it first a lot worse and then completely unable to run on iPhone 4. This game is making me miss that one, which is not a great start.\n-I cannot zoom in to things to examine them better. They get extraordinarily pixellated very quickly.\n-There's no way to tell what mode the puzzle is going to boot in. Unexpected \"oh now you can only see a tiny circle of the scene\" can be quite annoying.\n-Everything so far has exactly two places they're hidden. This makes everything more memorization than hidden object. EDIT after a bit longer: Apparently they do start being out of those two places eventually.\n-The early \"easier\" levels have too short a time limit when you're trying to learn what the objects you're looking for actually are and what they look like. This is especially true for bow (in three different scenes it's a longbow-style weapon, but one has a nice red ribbon instead).\n-The minigames for the chests are also super annoying. I'm here for I Spy, not sliding block puzzles or connect the nodes. There's guides for some of them, but that doesn't mean it doesn't frustrate me to have to do something else, especially since the first guide I found didn't have the solution for the one I was opening right then.\n-The intro video that plays every time you boot it up is annoying.\n-I really dislike all these constantly moving people trying to talk to me about random stuff. I especially don't like the scantily clad woman who is like the third person who showed up. The moving is very distracting to me. The weird variety in art styles also doesn't help. The farm halfling looks basically like Martin Freeman As Bilbo but just generic enough to be not sued, but then the first old man elf basically looks like the gif of Louisoix from Final Fantasy XIV, while the scantily clad supposedly leader elf lady is significantly less cartoony than the less scantily clad elf girl who showed up for the menagerie.\n-I didn't actually WANT a story. I am probably the only one in this boat though.\n-The merchant showing up whenever you reopen the game to peer pressure you into buying things with real life money, with timers counting down until he stops advertising to you, and then there are multiple of those, are REALLY annoying. I've been up to four at a time so far.\n-The steam achievements are completely broken, and some of the ingame ones are as well. Either they're not counting things right (like chests opened says 3/5 right now in steam, but I've probably opened ten by now) or they're not labelled correctly (i've also opened four different types of chests)\n-The timed quests are absolutely designed to make sure you can't complete them in the time limit. The ones that need you to get materials can be cancelled out of, at least, but the ones that want you to explore locations a number of times require you to close the game to avoid it.\n\nOverall, a lot of these cons are kind of petty and personal opinions, but it's likely that it'll eventually drive me away from playing. It is a free game, so the bar is pretty low for what you're offering, but that also means it's a lot easier to just go \"nah\" and walk away.", "timestamp_created": 1735257591, "timestamp_updated": 1735645733, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.559585452079772949", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183742702": {"recommendationid": "183742702", "author": {"steamid": "76561198137871587", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 25109, "playtime_last_two_weeks": 6645, "playtime_at_review": 14623, "last_played": 1737397263}, "language": "english", "review": "IF energy based games games do not bother you, Only then I'd recommend it to you... \r\n\r\nI admit struggling with waiting times for the energy to fill, But I really do like the art and characters. I like the variety of the chest puzzles BUT I'd love it if some of them gave us more time to think rather than panic and try stuff and hope it works..\r\n\r\nSo This is a mix bag, but I still have sound it captivating enough to keep going at it despite it's flaws, and the game is free so I shall give it a review that tilt quite a bit more to the positive side of things...", "timestamp_created": 1735213869, "timestamp_updated": 1735213869, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.534313738346099854", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 4944, "total_negative": 673, "total_reviews": 5617}, "cursors": {"AoJwtrHL4I0DcYq43QQ=": "Mon Jan 20 18:43:20 2025"}}
