{"reviews": {"185917900": {"recommendationid": "185917900", "author": {"steamid": "76561197992525979", "num_games_owned": 0, "num_reviews": 73, "playtime_forever": 277, "playtime_last_two_weeks": 0, "playtime_at_review": 277, "last_played": 1582228254}, "language": "english", "review": "Shogun: Total War isn’t just a game, it’s a time machine that transported me back to feudal Japan, igniting a love for strategy games and Japanese culture that still burns brightly. \r\nPlaying this gem back in the day was a revelation, and revisiting it now is like opening a treasure chest of nostalgia!\r\nSet in the tumultuous Sengoku Jidai period, Shogun: Total War masterfully captures the drama, strategy, and brutality of clan warfare.\r\nTaking control of one of the great clans, you must navigate the complex web of diplomacy, economics, and battlefield tactics to unite Japan under your banner. \r\nThe game’s campaign map, with its simple yet effective visuals, always felt like a living, breathing world, a sandbox where history was mine to rewrite.\r\nThe tactical battles are where Shogun truly shines. \r\nSeeing thousands of samurai, archers, and cavalry clash on beautifully rendered battlefields was nothing short of awe-inspiring at the time. \r\nEven today, the game’s attention to historical accuracy and detail remains impressive! \r\nThe ability to carefully position your units, plan ambushes, and use the terrain to your advantage made every skirmish feel like a thrilling puzzle.\r\nWhat elevated the experience for me was how steeped the game was in Japanese culture. \r\nFrom the elegant art style and authentic sound effects to the deeply strategic gameplay that mirrored the discipline of samurai warfare, Shogun immersed me in the world of feudal Japan like no other game could. \r\nThe poetic haikus accompanying end-of-turn summaries were a particularly lovely touch, adding atmosphere and gravitas to your decisions.\r\nOf course, by today’s standards, some mechanics feel dated, and the AI wasn’t always the sharpest tactician. \r\nBut these minor flaws are easily forgiven when considering the innovation and ambition Shogun brought to gaming in its time. \r\nFor anyone who loves strategy games or has a deep appreciation for Japanese history, Shogun: Total War is a classic worth cherishing. \r\nFor me, it’s more than a game, it’s a nostalgic journey to a time when I first discovered the thrill of commanding samurai armies and conquering Japan, one province at a time...", "timestamp_created": 1737267464, "timestamp_updated": 1737267464, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185305570": {"recommendationid": "185305570", "author": {"steamid": "76561197961873961", "num_games_owned": 91, "num_reviews": 212, "playtime_forever": 141, "playtime_last_two_weeks": 0, "playtime_at_review": 141, "last_played": 1729992010}, "language": "russian", "review": "На 2025 не играбельная дрянь. Я не понимаю зачем такое заливать в Стим, хотя бы ремастеред или ремейк сделали, тупо залили какая есть. А это для чего, кто в это будет в здравом уме играть? Перемещение по карте очень тяжёлое в освоении, управление войсками в битве вообще не подаётся контролю, пока переместишь отряд, бот уже триста раз сумеет обойти с фланга. Про экономику и строительство я вообще молчу. Существование игры в Стим для меня не понятно, да и ладно бы её бесплатно отдавали, но берут за неё почти 400 рублей, удивительно что дополнения на кровь или фракции не продают, это в их стиле. По хорошему такое старьё должны бесплатно отдавать, а если надумали продавать, то хорошо бы цена была чисто символической, а в игре были карточки для возможности её окупить или смайлы для коллекции заполучить, но ни чего этого нет. В случаи если надумали брать игру для коллекции, строго по скидке не менее 80%, в противном случаи нет смысла тратить на это деньги, едва вы зайдёте в неё и тем более будете играть.", "timestamp_created": 1736556648, "timestamp_updated": 1736556648, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.537537515163421631", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185192979": {"recommendationid": "185192979", "author": {"steamid": "76561198029774058", "num_games_owned": 10, "num_reviews": 1, "playtime_forever": 1008, "playtime_last_two_weeks": 1, "playtime_at_review": 1008, "last_played": 1736440595}, "language": "russian", "review": "Лучшая стратегия прошлых лет!", "timestamp_created": 1736440791, "timestamp_updated": 1736440791, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185004442": {"recommendationid": "185004442", "author": {"steamid": "76561198000813885", "num_games_owned": 0, "num_reviews": 234, "playtime_forever": 370, "playtime_last_two_weeks": 59, "playtime_at_review": 370, "last_played": 1736239436}, "language": "english", "review": "i give this game in 2025 : 0/10.\r\n===\r\ni played medieval total war 2 a lot when i was a kid, and i really enjoyed it.\r\ni never played this one as a kid, but i imagine that even if i did i would not have enjoyed it even back then !\r\nmedieval total war 2 was made 6 years after this one but it's miles better than this one.\r\nthe UI is bad, the controls are bad, the AI is bad, basically the whole thing is very bad.\r\nI can imagine that people who played it back then might have enjoyed it because there was nothing like it.\r\nhonestly i think big companies should make games this old FREE for everyone since it is UNPLAYABLE now.\r\nthese kind of games should be called MUSEUM games and be free for all to try.\r\ni just wanted to see where the total war games started from, which i did.\r\ni finished one campaign in like 4 hours and it is really not fun nor entertaining.\r\ni was basically TOLERATING the whole thing just to see what it is like.\r\neven if you played this very game as a kid i don't think you will enjoy it.\r\nif you buy this game it is like you are paying to be annoyed, lol.\r\n===\r\nreviewed by IMMORTALEADER\r\nif you read this until here i made a game for iOS called \"FatHatBoy\" please check it out <3", "timestamp_created": 1736240001, "timestamp_updated": 1736240001, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.482014387845993042", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184972720": {"recommendationid": "184972720", "author": {"steamid": "76561198089825342", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1402, "playtime_last_two_weeks": 223, "playtime_at_review": 1386, "last_played": 1737226020}, "language": "brazilian", "review": "Baum", "timestamp_created": 1736204748, "timestamp_updated": 1736204748, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184966060": {"recommendationid": "184966060", "author": {"steamid": "76561198407765660", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 461, "playtime_last_two_weeks": 0, "playtime_at_review": 461, "last_played": 1732749126}, "language": "brazilian", "review": "Gosto muito. Sou suspeito, pois tem muita nostalgia falando. Quando era pequeno, jogava incansavelmente esse jogo, então existe muito afeto nele e acho divertido até hoje. Eu sempre achei dificil liderar as tropas quando criança então eu jogava ( e ainda jogo assim hahaha) como se fosse um jogo de tabuleiro, colocando os combates no automático. Ainda assim, me divirto pra caramba. Eu não sou um jogador de TOTAL WAR, apenas jogando esse título, então fica aqui meu cometário de um jogador apaixonado pelo jogo e pela nostalgia.", "timestamp_created": 1736198963, "timestamp_updated": 1736198963, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184156002": {"recommendationid": "184156002", "author": {"steamid": "76561199684786815", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 2055, "playtime_last_two_weeks": 656, "playtime_at_review": 369, "last_played": 1736726227}, "language": "spanish", "review": "Con este juego comienza toda la saga totalwar... es un clasico", "timestamp_created": 1735507998, "timestamp_updated": 1735507998, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183648063": {"recommendationid": "183648063", "author": {"steamid": "76561198127194484", "num_games_owned": 81, "num_reviews": 12, "playtime_forever": 403, "playtime_last_two_weeks": 0, "playtime_at_review": 403, "deck_playtime_at_review": 321, "last_played": 1720698912}, "language": "english", "review": "My first 3D strategy game, played all the way in 2000. And it has aged beautifully. If at the time I looked at those rolling hills and rain storms and thought \"wow so realistic\" now I can admire and say \"wow so minimalist\". \n\nI still find this to be the most immersive Total War experience. The only game where even the strategic map makes you feel like a general, moving pieces around. The \"realism\" of later Total War games ruined it.  Everything, from the music to the AI to the graphics, was decades ahead of its time, and still a joy today.\n\nPS If you're playing on the Steam Deck, just use Proton Experimental and it works fine.", "timestamp_created": 1735130822, "timestamp_updated": 1735130822, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": true}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 885, "total_negative": 119, "total_reviews": 1004}, "cursors": {"AoJ4xvKLu4kDdcrMnwQ=": "Mon Jan 20 18:06:46 2025"}}
