{"reviews": {"186006147": {"recommendationid": "186006147", "author": {"steamid": "76561197969542195", "num_games_owned": 0, "num_reviews": 26, "playtime_forever": 321, "playtime_last_two_weeks": 321, "playtime_at_review": 321, "last_played": 1737366658}, "language": "german", "review": "Kurzweiliger Spaß, es versprüht eine gewisse Magie. Die Erzählstimme und die Musik geben dem Ganzen eine schöne Atmosphäre.", "timestamp_created": 1737366870, "timestamp_updated": 1737366870, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185903192": {"recommendationid": "185903192", "author": {"steamid": "76561198048233164", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 109, "playtime_last_two_weeks": 9, "playtime_at_review": 109, "last_played": 1737247393}, "language": "english", "review": "Pretty straightforward concept for a game, however, this game is beautiful and really fun. It's also the right level of challenging for me, and I love trying to beat my typing speed stats. Highly recommend for anyone interested in typing games and something that you can pick up and jump right into!", "timestamp_created": 1737248329, "timestamp_updated": 1737248329, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185889881": {"recommendationid": "185889881", "author": {"steamid": "76561198006552855", "num_games_owned": 361, "num_reviews": 36, "playtime_forever": 300, "playtime_last_two_weeks": 300, "playtime_at_review": 300, "last_played": 1737234138}, "language": "french", "review": "Un jeux au gameplay different et bien fait (faites chauffer vos clavier). Style visuel en mode origami très sympas.", "timestamp_created": 1737234169, "timestamp_updated": 1737234169, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185801978": {"recommendationid": "185801978", "author": {"steamid": "76561198037839153", "num_games_owned": 329, "num_reviews": 357, "playtime_forever": 849, "playtime_last_two_weeks": 570, "playtime_at_review": 849, "last_played": 1736571098}, "language": "polish", "review": "[b]Przygoda z pisaniem[/b]\nEpistory - Typing Chronicles to \"gra\" niezwykła. Z jednej strony, mamy tu typową przygodę, w której odkrywamy kolejne poziomy i zdobywamy doświadczenie ulepszając swoją postać, mamy też walkę urozmaiconą czterema rodzajami \"magii\" z momentami obrony przed nadciągającymi falami wrogów. Z drugiej strony, wszystko na czym się ta rozgrywka opiera, to swoiste zaklęcia - słowa. Nie licząc poruszania się po planszy, wszelkie przeciwności pokonywać będziemy tu za pomocą zwykłego pisania (na klawiaturze). Pisanie to podstawowa obecnie umiejętność, a więc w czym tkwi problem?\n[b]Z papieru, z papieru świat[/b]\nZanim odkryję swoje karty, muszę przyznać, że styl artystyczny wręcz zniewala. Ta baśniowa kraina jest żywcem wyrwana z kart zbioru opowiadań (w przenośni jak i dosłownie). Wraz z prowadzoną narracją, świat który eksplorujemy, poszerza swoje granice rozkładając na planszy kolejne papierowe elementy - otwiera się przed Nami jak gdyby kolejne karty księgi. Treści wypisywane na planszy (przy odpowiednio dobranych efektach dźwiękowych) pozostają, świadcząc nie tylko o Naszych postępach, ale będąc również swoistym przypomnieniem odkrywanych kolejno momentów. Sama lektorka też wykonuje kawał dobrej roboty uwypuklając, potrafiącą poruszyć emocje, ścieżkę dźwiękową. Do tego wszystkiego gra ma naprawdę sporą różnorodność lokacji pozostając przy tym równie czytelną przez całą rozgrywkę.\n[b]Czytam meni piszę MENU[/b]\nTo co jest kolejnym, niezwykle mocnym punktem Epistory, to jej konsekwencja. Skoro rozgrywka opiera się na pisaniu, to czemu w menu mielibyśmy korzystać z myszki? Oczywiście można, ale skoro menu gry również opisane jest słowami, to Twórcy postarali się o to, by każda z tych opcji również reagowała na \"zaklęcia\", więc jak chcesz zobaczyć np. swoje statystyki, to zamiast wędrować kursorem w odpowiednio opisany obszar, można po prostu wpisać STATYSTYKI - cudowne :D \n[b]Tak to się składa[/b]\nGra jest odpowiednio złożona. Mamy podstawową planszę, która rozszerza się wraz z Naszymi postępami określanymi przez poziom doświadczenia. Mamy mniejsze, tematyczne poziomy (osobne plansze) i mamy przyjemne zagadki środowiskowe, które właściwie kierują Naszych bohaterów po ustalonym przez Twórców torze. Samo doświadczenie zdobywamy za każdym słowem, które wprowadzimy z klawiatury, a że mamy tu mnożnik, to warto wpisywać widoczne słowa regularnie. Najczęściej będziemy \"przeklinać\" przeciwników, ale w utrzymaniu bonusu za \"zaklęcia\" pomagają wszelkiego rodzaju blokady (np. drzewa czy skały zalegające na planszy), kwietniki czy przygotowane specjalnie pod konkretny rodzaj magii obiekty. Tu również warto pochwalić Twórców, że większość stałych elementów krajobrazu ma ograniczoną, ale dopasowaną pulę słów. I tak: drzewa usuwamy wpisując TOPOLA, DĄB czy PIEŃ; kwiatki sadzimy wystukując RÓŻA, AZALIA czy TULIPAN; ogień rozpalimy słowami STOS, POŻAR czy ŁATWOPALNY; skrzynie otworzymy korzystając z takich słów jak ŁUPY, POJEMNIK czy NIESPODZIANKA; i tak dalej. No ale niestety, zdarzają się również mniej pasujące słowa, czy nawet słowa, które w słowniku języka polskiego nie występują - tu prym wiedzie sekcja \"wiatrów\", np. AELAT, BREVA, GREGALE, RESHABAR czy VENDAVELES, a przecież polskich nazw wiatrów nie brakuje.\n[b]Tak to się rozwija[/b]\nCałość eksploracji zadowala do momentu, gdy nie musimy się gdzieś wrócić czy przebiec na drugą stronę mapy, bo np. brakuje Nam doświadczenia by odblokować najbliższą Nam część (odkrywanie kolejnych części mapy jest uzależnione od zdobytego doświadczenia). Jak w każdej grze, gdy wypełnimy pasek \"expa\", możemy ulepszyć to i owo. Choć zakres rozwijanych umiejętności oceniam jako zadowalający, to niestety nie czuć tych bonusów (patrząc na różnicę pomiędzy jednym punktem a wszystkimi danej kategorii). Kampania również ogranicza dostęp do mocy. Wypalanie ogniem, mrożenie lodem, rażenie piorunami i wymiatanie siłą wiatru stopniowo pozwala Nam odblokowywać specjalne mechanizmy, pomagając dotrzeć do kresu Naszej podróży, ale również utrudniają stawiane Nam wyzwanie. Wraz ze zdobyciem określonej mocy, każde słowo może również zostać nasycone danym elementem. O ile w eksploracji jest to fajny zabieg bo np. zamrażanie ścieżek na wodzie można wykonać tylko zaklęciem przy aktywnej mocy lodu, tak podczas starć, takie rotowanie aktywną mocą (oczywiście przez wpisywanie odpowiednio przypisanych słów kluczy) staje się dosyć uciążliwe.\n[b]Czas na grę w otwarte karty[/b]\nBędąc zupełnie szczerym, gra zawodzi na polu rozrywki. Mechanika walki jest zupełnie niedopracowana i przez to niezwykle wymagająca. Starcia wyglądają tak, że stojąc w magicznym kręgu, bronimy się przed falami nadchodzących w różnym tempie i z różną wytrzymałością (określoną przez ilość i długość słów) wrogów. Nad każdym wrogiem widnieje słowo, które trzeba wpisać by obniżyć jego wytrzymałość. Tu mamy pierwszy błąd, bo ze względu na ukształtowanie terenu i przygotowany przez Twórców kadr, słowa mogą być przysłaniane przez elementy otoczenia, przeciwnicy mogą się tłoczyć, a co za tym idzie, słowa mogą nachodzić na siebie czyniąc je mało czytelnymi. Co więcej słowa mogą się powtarzać na wielu przeciwnikach, co skutkuje często niezrozumiałym posłaniem ciosu w zupełnie nie zagrażającego Nam robala. Ulepszając \"atak z odepchnięciem\" na pewno też zdarzy Nam się, że przeciwnik zostanie wypchnięty poza kadr i w związku z tym, nie będziemy mogli go dalej atakować. Do zaburzenia płynności walki dochodzi również przez to, że słowa klucze (służące do zmiany aktywnej mocy) blokują ataki - przykłady rozpoczęcia zmiany mocy zamiast wykonania ataku: G[b]ŁÓD[/b] (LÓD), Ż[b]WI[/b]R (WIATR), Ż[b]O[/b]NA (OGIEŃ). Od razu zaznaczę, że wynika to ze specyfiki polskiego języka, bo czasem wystarczy wcisnąć L zamiast Ł by zaliczyć dane słowo a dodatkowo, jeżeli słowo zaczyna się od znaku diakrytycznego, to zamiast zaczernić literkę, ta jest wyszarzana, czyli niby jest zaliczone jak pociągniemy dane słowo, ale jednak nie na tyle, by inne słowo wynikające z rozpoczęcia się kolejną literą nie było sprawdzane :( I to jeszcze nie wszystko, bo mechanika walki danym elementem obejmuje przypisany do niego bonus. OGIEŃ wypala kolejne w kolejce danego robala słowo, LÓD zamraża przeciwnika wstrzymując go na moment, PIORUN potrafi usunąć dodatkowe słowa z pobliskich robali a WIATR znacząco odpycha atakujących z danego kierunku. Niby fajnie ale w kontekście pisania bardzo niepraktyczne - jak w grze opartej o szybkość wpisywania pojawiających się słów można zareagować gdy nagle coś Nam znika?! \n[b]Drwina czy motywator?[/b]\nTo jest gra, w której każdy kontakt z wrogiem powoduje Naszą porażkę. Żeby nie było zbyt miło, każda porażka jest okraszona planszą z krótkim zdaniem które.. no właśnie nie wiem co miało Nam przekazać. Przykładowo dostajemy tego typu podsumowania: [i]Na serio? To najlepsze co potrafię?[/i], [i]Ej nie tak miało być[/i], [i]Tak nie da rady - może tak![/i], [i]Nie... nie tak[/i], [i]Nie, nie, nie tak[/i] Przyznam, że w żadnym momencie nie poczułem się zmotywowany a przy trudniejszych walkach wręcz podsycało to moją irytację. I nie miałbym nic przeciwko, gdyby to faktycznie odpowiadało jakiemuś progresowi, ale niestety niezależnie od tego jak daleko zajdziemy, jak wysoki mnożnik uzyskamy czy cokolwiek innego, porażka będzie tak samo, negatywnie oceniona :(\n[b]Słowem podsumowania[/b]\nGra jest na jakieś 7 godz. + 14 godz. mielenia areny dla osiągnięć, bo kampania (z powtarzaniem walk) daje dużo mniej niż połowę wymaganych ubić i wypisanych wyrazów. Mam wrażenie, że poziom trudności jest ustalony dla ludzi piszących przynajmniej 30 słów na minutę, więc raczej przystępna, ale na pewno nie dla każdego. Mimo świetnego pomysłu i bajecznego wykonania nie mogę polecić (choć z wielu względów chciałbym), bo wiem, że to nie jest \"zabawne\". Epistory to niestety \"tylko\" wyrafinowany test szybkości pisania na klawiaturze z elementami zagadek środowiskowych.", "timestamp_created": 1737140611, "timestamp_updated": 1737140611, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.545454561710357666", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185800088": {"recommendationid": "185800088", "author": {"steamid": "76561198156619113", "num_games_owned": 285, "num_reviews": 3, "playtime_forever": 58, "playtime_last_two_weeks": 58, "playtime_at_review": 58, "last_played": 1737138725}, "language": "schinese", "review": "玛德怪跑的极快，单词又长，一来就3个3个的来，死了无数次，这游戏不适合我。", "timestamp_created": 1737138828, "timestamp_updated": 1737138828, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185683068": {"recommendationid": "185683068", "author": {"steamid": "76561197966509778", "num_games_owned": 0, "num_reviews": 41, "playtime_forever": 112, "playtime_last_two_weeks": 112, "playtime_at_review": 98, "last_played": 1737300893}, "language": "english", "review": "It's alright.\nGot this in a bundle. \nThere's a demo if you're on the fence.\nIf you think it'll make you a better typist, Probably not. \nIf you like typing being part of your game experience, this is alright.\n", "timestamp_created": 1736991953, "timestamp_updated": 1736991953, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185609860": {"recommendationid": "185609860", "author": {"steamid": "76561198097566871", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 252, "playtime_last_two_weeks": 42, "playtime_at_review": 252, "last_played": 1736894394}, "language": "ukrainian", "review": "Це саме те, чим воно видається - клавіатурний тренажер. Якщо хочеться побавитися із новопридбаною клавіатурою, може й зайде, інакше - навряд, \"гри\" тут дуже мало.", "timestamp_created": 1736894568, "timestamp_updated": 1736894568, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185597682": {"recommendationid": "185597682", "author": {"steamid": "76561198048977195", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 418, "playtime_last_two_weeks": 264, "playtime_at_review": 418, "last_played": 1736880997}, "language": "english", "review": "Came for the typing practice on my new mechanical keyboard, stayed for the story. A classic indie gutpunch at the end... highly recommend.", "timestamp_created": 1736881908, "timestamp_updated": 1736881908, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185572799": {"recommendationid": "185572799", "author": {"steamid": "76561198155860616", "num_games_owned": 0, "num_reviews": 11, "playtime_forever": 382, "playtime_last_two_weeks": 0, "playtime_at_review": 382, "last_played": 1628348841}, "language": "english", "review": "Very Good", "timestamp_created": 1736857337, "timestamp_updated": 1736857337, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185465699": {"recommendationid": "185465699", "author": {"steamid": "76561197986797815", "num_games_owned": 686, "num_reviews": 199, "playtime_forever": 1004, "playtime_last_two_weeks": 1004, "playtime_at_review": 1004, "last_played": 1736709618}, "language": "english", "review": "Ok game to train your typing, but it doesn't really teach you how to do it faster, which was my initial assumption.\nCreative and nice art, however gameplay and especially fighting gets repetitive quickly, as well as fights being way too imbalanced on normal / adaptive difficulty, should probably set manual hard difficulty in options, or it will be way too easy and boring from mid to late game when you traveled half the world or already got half or more of your skills unlocked, there was one arena / bug nest relatively early in the game or at least in mid-game in the south-western forest or grassland which was difficult, after that it just got way easier because I then had all the skills unlocked already and no fight was even close to a challenge to someone typing with 2 fingers and who has to look where the keys are, so imagine how bored and underwhelmed someone would have been who already knows typing or is more skilled in it than I am, unfortunately I had forgotten that you can just change the difficulty in the options at any time, I'd advise against using adaptive difficulty which I used but clearly didn't adapt much or function well.\nOk game if you don't expect to learn how to type well and fast from it and not much else either, would definitely not recommend spending full price on it or its sequels or other games from Fishing Cactus, IMO.\nAlso, the last and hardest achievement was just waaay too grindy and took too long (beat 10 000 monsters), thankfully there is a workshop mod to help you with it if you don't want to spend an additional 10 hours or whatnot just for that.\nI'm probably gonna play the 2 Sequels in the typing story Franchise (nanotales and outshine by the same DEVs) as well.", "timestamp_created": 1736712602, "timestamp_updated": 1736712602, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185398296": {"recommendationid": "185398296", "author": {"steamid": "76561198066915149", "num_games_owned": 318, "num_reviews": 9, "playtime_forever": 457, "playtime_last_two_weeks": 428, "playtime_at_review": 195, "last_played": 1736729036}, "language": "english", "review": "Charming, unusual control scheme, appropriate challenge level.", "timestamp_created": 1736643635, "timestamp_updated": 1736643635, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185361565": {"recommendationid": "185361565", "author": {"steamid": "76561198158189116", "num_games_owned": 147, "num_reviews": 2, "playtime_forever": 1563, "playtime_last_two_weeks": 1144, "playtime_at_review": 1388, "last_played": 1737332227}, "language": "english", "review": "Very useful game to gamify typing practice. It is forgiving but adjusts to the needs of the typist.\r\n", "timestamp_created": 1736612353, "timestamp_updated": 1736612353, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185254279": {"recommendationid": "185254279", "author": {"steamid": "76561198069473383", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 2069, "playtime_last_two_weeks": 368, "playtime_at_review": 2069, "last_played": 1736511561}, "language": "english", "review": "Epistory – Typing Chronicles is a well-presented game with a story about growth and self-discovery that really hits home, especially for those who’ve left the nest. The game explores personal growth and finding your own path and resonates deeply with anyone who’s gone through major life changes. The typing-based controls are easy to pick up, making the game accessible for all players, from beginners to seasoned typists. As you progress, the difficulty ramps up, keeping things challenging. While double-ups in typing can cause minor hiccups, they don’t take away from the overall experience. 8/10.\n\n\n\n", "timestamp_created": 1736512494, "timestamp_updated": 1736512494, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185181573": {"recommendationid": "185181573", "author": {"steamid": "76561198371424803", "num_games_owned": 6, "num_reviews": 2, "playtime_forever": 539, "playtime_last_two_weeks": 227, "playtime_at_review": 539, "last_played": 1736429128}, "language": "schinese", "review": "我基本不写游戏评论，但这个游戏真的非常推荐，是它让我的打字速度进步飞快，而且剧情也挺不错的。", "timestamp_created": 1736429348, "timestamp_updated": 1736429348, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185180452": {"recommendationid": "185180452", "author": {"steamid": "76561198319461965", "num_games_owned": 80, "num_reviews": 2, "playtime_forever": 607, "playtime_last_two_weeks": 607, "playtime_at_review": 411, "last_played": 1736606703}, "language": "schinese", "review": "神经啊，进副本完全不给提示，进去了也出不来，明明还想探图莫名其妙就进副本然后打完就通关了？", "timestamp_created": 1736428040, "timestamp_updated": 1736428040, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185013084": {"recommendationid": "185013084", "author": {"steamid": "76561198835036703", "num_games_owned": 349, "num_reviews": 53, "playtime_forever": 486, "playtime_last_two_weeks": 250, "playtime_at_review": 264, "last_played": 1737233329}, "language": "english", "review": "Immensely fun game with simple combat idea (typing words to shoot). My poor typing habits are deeply ingrained at this point (25 wpm RIP), but it is definitely still very playable, even if you technically suck.", "timestamp_created": 1736251173, "timestamp_updated": 1736251173, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184820199": {"recommendationid": "184820199", "author": {"steamid": "76561198060402169", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1648, "playtime_last_two_weeks": 1220, "playtime_at_review": 60, "last_played": 1737375607}, "language": "english", "review": "thank you", "timestamp_created": 1736069388, "timestamp_updated": 1736069388, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184807790": {"recommendationid": "184807790", "author": {"steamid": "76561198104197630", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 469, "playtime_last_two_weeks": 0, "playtime_at_review": 469, "last_played": 1736055116}, "language": "english", "review": "Liked the art and story, while some words rotated, they used many new and when a monster had a big word there weren't very many of them. My typing was already pretty good but definitely think it improved, though I made many typos and while i'm happy there wasn't a penalty for that, due to the speed of the monsters, no penalty definitely didn't improve my typo making. Overall would recommend and not only for those that want to improve their typing speed", "timestamp_created": 1736055339, "timestamp_updated": 1736055339, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184786113": {"recommendationid": "184786113", "author": {"steamid": "76561199122478339", "num_games_owned": 130, "num_reviews": 14, "playtime_forever": 339, "playtime_last_two_weeks": 0, "playtime_at_review": 339, "last_played": 1735954535}, "language": "english", "review": "   I'd like to start by saying that the game is artistically wonderful, and fun to play- If you're really fast at typing- but the game has a few issues.\r\n\r\n   The story is nice. Easy to follow, and I wasn't expecting the ending.\r\n   There's a problem related to the story, though. In the game, each area has a chunk of the story in it, shown through dialogue, or through a collectible picture you get in pieces from treasure chests. The four areas where you get your new abilities are labeled as chapters 1, 2, 3, and 4... but there are 8 areas. The final area isn't labeled as a chapter. You don't get a new ability in it, so I guess it's sticking to the rule, but it's a bit of an odd choice not to label the finale, when you've labeled the other \"significant\" ones. I guess those other 3 could be seen as extra or bonus areas, but they contain chunks of the story- And some pretty significant parts of it, too. I don't think areas with significant chunks of the story should be in hidden bonus areas. I say hidden because the game doesn't guide you towards these areas, and I had trouble figuring out how to get into two of them. In fact, halfway through the final chapter, I went through a portal that I didn't know would send me back to the start of it, for some reason. By then, I'd realized from context that this was the final act, and backtracked to do the other three areas. Thankfully, in the very back of the final area, the narrator warns you where the point of no return is, so you can backtrack if you want to.\r\n   That's the biggest issue with the game though. Just parts of the way it's designed. Let's get to the good parts!\r\n\r\nThe art. Amazing, beautiful. How do you make rocks look like they're rocks, but also made of paper? They have this cool unfolding paper animation for loading new chunks of the map. Waterfalls, since they're a sheet of blue paper, end in little curls of paper strips. The enemy design is cool. The papery look adds a lot of personality to the game.\r\n\r\nThe gameplay. Good! You type the right words to whittle down the health of your enemies. The pacing is definitely fast enough to create a sense of urgency, especially since you'll die if they hit you just once. There is no health bar here. Thankfully, the checkpoints aren't very far from where you died.\r\nThe gameplay does have one thing that's less of a problem for the player, and more of a design issue. You get different elemental abilities, such as fire, wind, ice, and electricity. Each of them does something different, and each attack looks different when shot off, and that's cool. The problem is, fire is the best one to use, to the point where I rarely used the others in battle. The game kind of has to force you to use the other abilities, by making some enemies only take damage from one of the other elements. Also, the spark ability is actually a little disadvantageous. It's kind of long to explain, but essentially, it hits multiple enemies, so when you're typing a word for an enemy you didn't aim for, the word can just disappear halfway through, because the spark branched out and hit that enemy. It only wastes a few seconds, but those seconds and breaking your flow state like that can mess you up in the later battles. Seriously, you have to type lightning quick for those.\r\n\r\nAnyway, overall, the game is gorgeous, has a nice story, and is pretty dang fun.", "timestamp_created": 1736033645, "timestamp_updated": 1736033645, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184729090": {"recommendationid": "184729090", "author": {"steamid": "76561199765330952", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 419, "playtime_last_two_weeks": 0, "playtime_at_review": 405, "last_played": 1735990789}, "language": "english", "review": "it makes typing fun but doesn't teach sentences.", "timestamp_created": 1735989459, "timestamp_updated": 1735989459, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184689880": {"recommendationid": "184689880", "author": {"steamid": "76561197995775517", "num_games_owned": 0, "num_reviews": 72, "playtime_forever": 54, "playtime_last_two_weeks": 0, "playtime_at_review": 27, "last_played": 1735949710}, "language": "english", "review": "Dont even consider buying this game!!!\n\nPros:\n- The story, can likely be, a good adventure.\n- the simplicity of it is nice\n- The fox is a nice thing\n\nCons:\n- you have to press space every time you want to write - IE you have to guess where to type\n- whoever has made this game, has no idea of colours - when you work in the firery underground, making some of the words ORANGE LIKE THE P*SSING LAVA is a bad idea!\n- Are you a bit behind, the letters burn black - which is again not easy to see in the underground where half is organge, half is black - so, words turn into a guessing-game\n- The latest message I notated was a demotivating message, after I died, something along \"maybe start over\"\n\nOverall, the idea is fine, but the execution of it is just a bl**dy mess! Do not come near!", "timestamp_created": 1735948065, "timestamp_updated": 1735948065, "voted_up": false, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.349220544099807739", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184573640": {"recommendationid": "184573640", "author": {"steamid": "76561198199355503", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 2344, "playtime_last_two_weeks": 0, "playtime_at_review": 2236, "last_played": 1736113962}, "language": "french", "review": "Exellent jeu, je le recommande vivement.", "timestamp_created": 1735856395, "timestamp_updated": 1735856395, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184543180": {"recommendationid": "184543180", "author": {"steamid": "76561199051506207", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1572, "playtime_last_two_weeks": 0, "playtime_at_review": 1572, "last_played": 1735440696}, "language": "english", "review": "I wanted a typing game and this delivered. Gameplay is fun and difficulty increases at a challenging but not overwhelming pace. The aesthetic is fun, and the world is engaging to explore. My one complaint is that the story feels very unfulfilling at the end, but i wasn't playing it for the story so that's not a detractor for me.", "timestamp_created": 1735834679, "timestamp_updated": 1735834679, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184455153": {"recommendationid": "184455153", "author": {"steamid": "76561198038648269", "num_games_owned": 174, "num_reviews": 10, "playtime_forever": 1680, "playtime_last_two_weeks": 0, "playtime_at_review": 1416, "last_played": 1736064633}, "language": "english", "review": "great game for getting better at typing and learning new keyboard layouts", "timestamp_created": 1735757346, "timestamp_updated": 1735757346, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184340692": {"recommendationid": "184340692", "author": {"steamid": "76561198095308662", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 447, "playtime_last_two_weeks": 0, "playtime_at_review": 447, "last_played": 1735660577}, "language": "english", "review": "Very pretty to look at, fun and relaxed to play", "timestamp_created": 1735660614, "timestamp_updated": 1735660614, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184208757": {"recommendationid": "184208757", "author": {"steamid": "76561198022640299", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 806, "playtime_last_two_weeks": 0, "playtime_at_review": 693, "last_played": 1735566797}, "language": "english", "review": "I played this with a new ortho keyboard and decided to learn the Workman layout with it.\nNow I know what old people feel like when you ask them to type something.\n\nGameplay-wise, it's very poorly optimized, you need much better hardware than\nthe mentioned minimal requirements.\n\nExcept for that, it's an indie masterpiece.", "timestamp_created": 1735556698, "timestamp_updated": 1735556698, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.566473960876464844", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184201938": {"recommendationid": "184201938", "author": {"steamid": "76561199040602980", "num_games_owned": 65, "num_reviews": 2, "playtime_forever": 377, "playtime_last_two_weeks": 0, "playtime_at_review": 377, "last_played": 1735548888}, "language": "english", "review": "Such a unique and exciting approach to gameplay. I had so much fun playing and finished the game in one sitting. I also found myself in awe at the artstyle, music, level design, and so on. Finishing fights felt rewarding and worthwhile, and the story narration felt so true to the \"storybook\" aesthetic. Overall, I thoroughly enjoyed, and found myself eager to overcome the word battles rather than feel daunted and frustrated. Challenging, but within reason. Absolutely loved!", "timestamp_created": 1735549739, "timestamp_updated": 1735549739, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184049068": {"recommendationid": "184049068", "author": {"steamid": "76561198033433636", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 542, "playtime_last_two_weeks": 0, "playtime_at_review": 481, "last_played": 1735503401}, "language": "english", "review": "Fun game to work on your typing skills. It also has some nice problem solving games as well.", "timestamp_created": 1735434983, "timestamp_updated": 1735434983, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184016906": {"recommendationid": "184016906", "author": {"steamid": "76561198050074078", "num_games_owned": 0, "num_reviews": 55, "playtime_forever": 375, "playtime_last_two_weeks": 0, "playtime_at_review": 375, "last_played": 1735411584}, "language": "english", "review": "Super cute little gem.", "timestamp_created": 1735411641, "timestamp_updated": 1735411641, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183582428": {"recommendationid": "183582428", "author": {"steamid": "76561199072775895", "num_games_owned": 552, "num_reviews": 124, "playtime_forever": 512, "playtime_last_two_weeks": 0, "playtime_at_review": 512, "last_played": 1735060104}, "language": "schinese", "review": "[h1]10/10[/h1]\r\n本来是来练习打字的，结果故事以外的有趣。", "timestamp_created": 1735060162, "timestamp_updated": 1735060162, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 6156, "total_negative": 344, "total_reviews": 6500}, "cursors": {"AoJ4vvq/zY4DcJrv6QQ=": "Mon Jan 20 18:43:54 2025"}}
