{"reviews": {"185918715": {"recommendationid": "185918715", "author": {"steamid": "76561197992525979", "num_games_owned": 0, "num_reviews": 73, "playtime_forever": 128, "playtime_last_two_weeks": 0, "playtime_at_review": 128, "last_played": 1697337972}, "language": "english", "review": "Crysis 2 set out to take everything that made its predecessor a technical marvel and refine it into a more accessible, fast-paced shooter. \r\nAnd while it certainly delivers some thrilling moments and impressive visuals, it doesn’t quite recapture the open-world jungle stealth that made the first game so iconic.\r\nThe change in setting from the jungle to an urban environment is a bold shift, but it introduces a more linear structure that feels somewhat restrictive, especially for those who loved the sandbox-style freedom of the first game. \r\nNew York itself is a beautifully detailed war zone, but it’s a far cry from the lush, expansive jungles of Crysis.\r\nOne of the standout features of Crysis 2 is, unsurprisingly, its visual fidelity. \r\nThe game is absolutely stunning, with some of the best lighting and detailed textures of its time. \r\nThe city’s towering skyscrapers and desolate streets look phenomenal, with dynamic weather and destruction adding to the immersion. \r\nIf you’re playing it on a capable machine, it’s easy to get lost in the beauty of it all.\r\nThe Nanosuit still provides a range of abilities, but this time, combat is much more action-focused. \r\nThe addition of a more streamlined experience, including quicker movements, tight corridors, and intense firefights, turns Crysis 2 into a more traditional first-person shooter. \r\nWhile the cloak and armor abilities are still enjoyable, the focus on tighter levels and less open-ended gameplay doesn’t give you the same sense of power or freedom as the first game did. \r\nThe game feels more like a \"shoot 'em up\" than the strategic, stealth-based experience that Crysis offered.\r\nCombat itself is solid, with well-designed weapons and enemy AI that offers a decent challenge. \r\nThe alien enemies, while interesting and varied, don’t evoke the same awe as the ones in the first game, and their repetitive design often makes encounters feel formulaic. \r\nThe inclusion of human enemies, however, brings a decent level of variety to the action.\r\nUnfortunately, the narrative doesn’t do much to elevate the experience. \r\nThe plot feels like a typical alien invasion story, and the characters, including Alcatraz, are flat and lack the emotional depth that would have made the stakes feel more meaningful.\r\nAll in all, Crysis 2 is a game with plenty of technical polish and high-octane action, but it falls short of recapturing the magic of the original. \r\nThe switch to a more linear structure, coupled with a less captivating story, makes it feel more like a solid shooter than the genre-defining experience the first game was.\r\nIf you're in it for the action and beautiful visuals, Crysis 2 delivers. \r\nBut if you were hoping for the same kind of immersive, open-world stealth and freedom that made the original such a standout, you may find yourself a bit disappointed.\r\nA visually stunning, action-packed shooter that doesn't quite live up to its predecessor's legacy.", "timestamp_created": 1737268577, "timestamp_updated": 1737268577, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185907907": {"recommendationid": "185907907", "author": {"steamid": "76561198001154111", "num_games_owned": 262, "num_reviews": 29, "playtime_forever": 3689, "playtime_last_two_weeks": 488, "playtime_at_review": 3410, "deck_playtime_at_review": 553, "last_played": 1737348836}, "language": "english", "review": "Nathan Gould is annoying.", "timestamp_created": 1737254145, "timestamp_updated": 1737254145, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185869949": {"recommendationid": "185869949", "author": {"steamid": "76561198040901407", "num_games_owned": 510, "num_reviews": 3, "playtime_forever": 565, "playtime_last_two_weeks": 380, "playtime_at_review": 565, "last_played": 1737216826}, "language": "german", "review": "This game is just so much worse than the original Crysis in every aspect imaginable.\nI also ran into game breaking bugs that are known and unfixed for more than a decade.\nI have no idea what EA means with \"Maximum Edition\", apparently the maximum is still far below acceptable.\n\nI really, really tried to give this game a chance. But Crysis 2 is where gaming turns into a chore.", "timestamp_created": 1737217328, "timestamp_updated": 1737217429, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185722465": {"recommendationid": "185722465", "author": {"steamid": "76561198043632912", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 243, "playtime_last_two_weeks": 6, "playtime_at_review": 239, "last_played": 1737046873}, "language": "german", "review": "Macht einfach Spass", "timestamp_created": 1737046588, "timestamp_updated": 1737046588, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185717256": {"recommendationid": "185717256", "author": {"steamid": "76561198012098088", "num_games_owned": 225, "num_reviews": 48, "playtime_forever": 160, "playtime_last_two_weeks": 76, "playtime_at_review": 160, "last_played": 1737041049}, "language": "english", "review": "14 years later, this game still looks good, with nice mechanics. Downside is the gameplay is sometime buggy (struggle to go through a window) or the way is not clearly indicated (eg. finding the way to the subway at the beginning of the game).\n30€ for a 14 years old game is not acceptable though.\n\n\n---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☑ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☑ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☐ Minor bugs\n☑ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n", "timestamp_created": 1737041606, "timestamp_updated": 1737041606, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185687271": {"recommendationid": "185687271", "author": {"steamid": "76561197981904390", "num_games_owned": 391, "num_reviews": 3, "playtime_forever": 973, "playtime_last_two_weeks": 370, "playtime_at_review": 952, "last_played": 1736999466}, "language": "english", "review": "+ Intense combat, aliens are convincing, the theme of continuing to pursue mission at all costs\r\nsuit mechanics intriguing \r\n- poor AI, some dullness in environments, a little cliched? \r\noverall a very good experience", "timestamp_created": 1736998197, "timestamp_updated": 1736998197, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185436973": {"recommendationid": "185436973", "author": {"steamid": "76561198383397634", "num_games_owned": 301, "num_reviews": 62, "playtime_forever": 983, "playtime_last_two_weeks": 0, "playtime_at_review": 983, "last_played": 1645190337}, "language": "turkish", "review": "[b]Genel Bakış[/b]\r\n\r\n\r\nCrysis 2 Maximum Edition, serinin şehir ortamına taşıdığı devrimsel ikinci adımı temsil ediyor. İlk oyundaki tropikal adalardan ayrılarak New York'un çarpıcı şehir harabelerinde Nano Suit yeteneklerimi kullanarak düşmanlarla savaşmak beni oldukça heyecanlandırdı. Çıkış yaptığı dönem için görsel ve teknik açıdan etkileyici olan oyun, güçlü atmosferi ve hikâye anlatımıyla adından söz ettiriyor. Maximum Edition, birkaç ek içerik ve güncelleme ile daha geniş bir deneyim sunmayı başarıyor.\r\n\r\n[b]Oynanış Mekanikleri[/b]\r\nOyunun mekanikleri, Nano Suit'in gelişmiş versiyonuyla önceki oyundaki mekaniklere benzer şekilde çalışıyor. Zırh, hız, güç ve görünmezlik yetenekleri ile farklı oyun tarzlarına uyum sağlamak mümkün. Özellikle şehir ortamındaki düşman üslerini dilediğim gibi aşma özgürlüğü ve gizlilik ile aksiyon arasında geçiş yapma imkanı oldukça eğlenceli.\r\n\r\nYeni ortam, savaş alanında daha dikey bir tasarım sunuyor. Çatılarda, enkazlarla dolu sokaklarda veya metruk binalarda, savaş stratejilerimi dilediğim gibi uyarlayabildim. Ancak zamanla oynanış döngüsü biraz monotonlaşabiliyor; genelde çatışma veya belli bir noktaya ilerleme arasında gidip geliyorsunuz.\r\n\r\nUzaylı düşmanlarla mücadele etme dinamiği hoş bir değişiklik sağlarken, bazen insan düşmanlarına karşı çatışmaların verdiği o gerçekçi gerilim hissini alamadım.\r\n\r\n[b]Grafikler ve Ses[/b]\r\nCrysis 2, çıkış döneminde görsel kalite çıtasını belirleyen bir oyundu ve Maximum Edition ile bu kalite güncellenmiş bir hâlde hala etkileyici görünüyor. New York'un yıkık binaları, ışıklandırmaları ve atmosferi, şehrin çöküş hissini oldukça iyi yansıtıyor. Ancak bazı mekan tasarımları birbirine oldukça benzer, bu da uzun oturumlarda görselliğin monoton hissettirmesine yol açabiliyor.\r\n\r\nSes tasarımı, savaş alanındaki çatışma ve çevresel detayların hakkını veriyor. Özellikle Hans Zimmer’in bestelediği soundtrack oyun boyunca muhteşem bir atmosfer yaratıyor. Ancak silah sesleri biraz daha güçlü olabilirdi; bazı anlarda o vurucu hissi alamadım.\r\n\r\n[b]Zorluk ve Derinlik[/b]\r\nOyun, oyunculara hem agresif hem de gizli ilerleme fırsatı tanıyor. Ancak gizlilik odaklı yaklaşımlar genelde çok kolay olduğu için aksiyon sekanslarının heyecanını biraz törpülüyor. Düşman yapay zekası, kimi zaman şaşırtıcı derecede akıllı, ancak bazı bölümlerde belirli saldırı senaryolarına takılıp kalabiliyor.\r\n\r\nHikaye derinliği önceki oyuna göre biraz daha gelişmiş, ancak özellikle uzaylı tehditi ele alındığında daha fazlasını görmek isterdim. Çatışma mekaniklerinin sunduğu çeşitlilik harika olsa da görev tasarımları zamanla kendini tekrar etmeye başlıyor.\r\n\r\n[b]Pozitif:[/b]\r\n\r\n-Zırh yeteneklerinin sunduğu farklı oyun tarzları\r\n-Çarpıcı görsel tasarım ve atmosfer\r\n-Hans Zimmer’in etkileyici müzikleri\r\n-Şehir ortamındaki dikey keşif ve stratejik özgürlük\r\n\r\n[b]Negatif:[/b]\r\n\r\n-Yapay zekanın zaman zaman tutarsız olması\r\n-Görev tasarımlarının kendini tekrar etmesi\r\n-Hikayede uzaylı tehditi konusunda eksiklikler\r\n-Ses tasarımı, silahlarla ilgili daha vurucu detaylar içerebilirdi\r\n\r\n[b]Genel Değerlendirme[/b]\r\n\r\nOynanış: 8/10 (Nano Suit mekaniği hâlâ etkileyici, ancak döngü biraz monotonlaşabiliyor.)\r\nGrafikler: 9/10 (Zamanı için devrim niteliğinde görsellik, Maximum Edition ile hala dikkat çekici.)\r\nSes: 8/10 (Müzikler mükemmel, ancak ses efektlerinde daha fazla vuruculuk olabilirdi.)\r\nHikaye: 7/10 (Derinlik önceki oyuna göre artmış, ancak daha fazlasını beklerdim.)\r\n\r\nGenel: 8/10\r\n\r\n[b]Sonuç[/b]\r\nCrysis 2 Maximum Edition, hem nostaljik bir yolculuğa çıkmak isteyenler hem de FPS türüne yeni adım atan oyuncular için harika bir tercih. Şehir ortamına taşınan açık dünya oynanışı ve Nano Suit'in sunduğu stratejik derinlik, oyunun güçlü yanlarını oluşturuyor. Görsel açıdan hala oldukça tatmin edici olan oyun, zayıf hikaye derinliği ve tekrar eden görev tasarımları gibi noktalarda biraz geride kalıyor. Buna rağmen, bilim kurgu ve aksiyon sevenler için denemeye değer.", "timestamp_created": 1736688054, "timestamp_updated": 1736688054, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185334531": {"recommendationid": "185334531", "author": {"steamid": "76561199005484653", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1329, "playtime_last_two_weeks": 545, "playtime_at_review": 1329, "last_played": 1736585740}, "language": "tchinese", "review": "I enjoyed it very much and have completed the full collection. \n我很享受的完成了全收集，并且全流程十九章远远超过三代全流程的七章，容量很满足，缺点是地图指引比较差，很容易迷路，地图也无法展开，标记需要手动标记，三代优化了标记且放大了图标增加黑客入侵。ceph步兵太肉了，尤其是重装甲兵和隐形潜行者，重装兵明显比三代更肉。装甲兵低难度敌人数量较少，且警觉度较低。超人士兵难度敌人较多，包含呼叫增援，找掩体，列阵型且警觉度较高。三代复合弓是bug武器，从章节开始用到结束。应该调换到二代解决火力不足问题。三代重装备是二选一，且火箭筒为一次性，二代最高携带至六枚。最强重装备连发火箭筒（二代无介绍），单兵武器脉冲狙击枪（无弹药补充），三连发步枪延续到三代。建议购买重制版包含成就，点数商店，旧版不包含且额外内容为线上。", "timestamp_created": 1736588241, "timestamp_updated": 1736588241, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185324649": {"recommendationid": "185324649", "author": {"steamid": "76561198133691416", "num_games_owned": 41, "num_reviews": 13, "playtime_forever": 1140, "playtime_last_two_weeks": 0, "playtime_at_review": 1140, "last_played": 1472056676}, "language": "english", "review": "Crysis 2 - Maximum Edition is an absolute gem! The game offers a fantastic mix of action, stunning visuals, and an open world that completely immerses you. The story is gripping, and post-apocalyptic New York is beautifully crafted.\n\nWhat I love most is the flexibility and options provided by the NanoSuit. You can go invisible or focus on raw power – each mission feels different and incredibly fun.\n\nThe graphics are still breathtaking, and the action sequences will keep you on the edge of your seat. Crysis 2 is a perfect blend of technical excellence and thrilling gameplay.\n\n9/10 – If you love action and high-quality shooters, this game will definitely not disappoint!", "timestamp_created": 1736576098, "timestamp_updated": 1736576098, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185250068": {"recommendationid": "185250068", "author": {"steamid": "76561198194157614", "num_games_owned": 40, "num_reviews": 11, "playtime_forever": 805, "playtime_last_two_weeks": 641, "playtime_at_review": 805, "last_played": 1736507116}, "language": "czech", "review": "Zo začiatku to bolo všelijaké, myslel som že predchádzajúce 2 diely boli lepšie,  ale tak po krátkej dobe ma to úplne pohltilo. Možnosti nanoobleku, viac zbraní, ťažší mimozemsky nepriatelia... Celkovo to hodnotím veľmi dobre a určite niekedy zapnem aj posledný diel tejto ságy. 90%", "timestamp_created": 1736507670, "timestamp_updated": 1736507823, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185166184": {"recommendationid": "185166184", "author": {"steamid": "76561198133073511", "num_games_owned": 0, "num_reviews": 57, "playtime_forever": 2526, "playtime_last_two_weeks": 0, "playtime_at_review": 2526, "last_played": 1634389973}, "language": "russian", "review": "[h1]Маскировка активирована[/h1]\nИ говорить нечего, однозначно к покупке!\n\n", "timestamp_created": 1736407865, "timestamp_updated": 1736407865, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185033532": {"recommendationid": "185033532", "author": {"steamid": "76561199155506647", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 1333, "playtime_last_two_weeks": 117, "playtime_at_review": 1333, "last_played": 1736269598}, "language": "german", "review": "is geil", "timestamp_created": 1736269622, "timestamp_updated": 1736269622, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184922584": {"recommendationid": "184922584", "author": {"steamid": "76561198013541173", "num_games_owned": 1534, "num_reviews": 325, "playtime_forever": 61340, "playtime_last_two_weeks": 0, "playtime_at_review": 61340, "last_played": 1730384675}, "language": "english", "review": "░░░░░░░░░░░░░░░░░░░░░░█████████\n░░███████░░░░░░░░░░███▒▒▒▒▒▒▒▒███\n░░█▒▒▒▒▒▒█░░░░░░░███▒▒▒▒▒▒▒▒▒▒▒▒▒███\n░░░█▒▒▒▒▒▒█░░░░██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██\n░░░░█▒▒▒▒▒█░░░██▒▒▒▒▒██▒▒▒▒▒▒██▒▒▒▒▒███\n░░░░░█▒▒▒█░░░█▒▒▒▒▒▒████▒▒▒▒████▒▒▒▒▒▒██\n░░░█████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██\n░░░█▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒██\n░██▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒██▒▒▒▒▒▒▒▒▒▒██▒▒▒▒██\n██▒▒▒███████████▒▒▒▒▒██▒▒▒▒▒▒▒▒██▒▒▒▒▒██\n█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒████████▒▒▒▒▒▒▒██\n██▒▒▒▒▒▒▒▒▒▒▒▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██\n░█▒▒▒███████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██\n░██▒▒▒▒▒▒▒▒▒▒████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█\n░░████████████░░░█████████████████\n\nCrysis 2: Maximum Edition is not just a game, but a real adventure in the world of science fiction and intense combat. Having spent over 1,000 hours in it, I can say with confidence that this part of the series has left an indelible impression.\n\nThe plot of Crysis 2 takes place in a post-apocalyptic New York City, invaded by alien invaders. Millions of residents are dying, the streets are plunged into chaos, and only Nanosuit 2 technology can save humanity from total annihilation. You will have to assume the role of the wearer of this powerful suit and engage in an unequal battle with the aliens.\n\nThe atmosphere of the game is exciting from the very first minutes. Destroyed skyscrapers, burning streets and the constant threat from aliens create a unique environment that keeps you in suspense throughout the passage.\n\nOne of the main features of Crysis 2 is the ability to use Nanosuit. This costume grants the player superhuman abilities such as invisibility, enhanced armor, and increased speed. These abilities allow you to adapt to different combat situations and find unique solutions for each task.\n\nThe combat system in the game is diverse and offers many options for approaching each opponent. You can choose between stealth tactics, the use of shelters and open combat encounters. This makes each battle unique and requires the player to think strategically.\n\nCrysis 2: Maximum Edition includes all Limited Edition materials, as well as two downloadable add—ons - \"Extermination\" and \"Retribution\". In addition, the set includes nine additional maps for the collective game mode, two new weapons (FY71 Assault Rifle and M18 Smoke Grenade), additional experience points, a unique design for the SCAR rifle and a nozzle with a holographic module. The set also includes unique platinum medallions that are not included in the base version of the game.\n\nThese additional materials significantly enhance the gaming experience by adding new maps and team play options, making Maximum Edition especially appealing to fans of the series.\n\nThe graphics in Crysis 2 are amazing in their detail and quality. The destructible environment, dynamic lighting and shadows create an incredibly realistic picture. The soundtrack is also excellent: from the sounds of footsteps to powerful explosions, every aspect of the sound design is flawlessly executed.\n\nConclusion:\n\nThis is a great game that offers an exciting storyline, varied gameplay and impressive graphics. Having spent more than 1,000 hours in it, I can confidently say that this part of the series has become one of the best in the genre. If you are looking for a rich and dynamic shooter with elements of science fiction, Crysis 2 is your choice.", "timestamp_created": 1736165068, "timestamp_updated": 1736165068, "voted_up": true, "votes_up": 15, "votes_funny": 0, "weighted_vote_score": "0.611169517040252686", "comment_count": 5, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184823099": {"recommendationid": "184823099", "author": {"steamid": "76561198121020740", "num_games_owned": 1905, "num_reviews": 325, "playtime_forever": 519, "playtime_last_two_weeks": 0, "playtime_at_review": 519, "last_played": 1736066376}, "language": "schinese", "review": "①孤岛危机2是经典显卡危机系列的第二部，也是小时候玩过的第一部显卡危机作品。游戏承接第一部灵山岛事件的故事，将背景转移至纽约，依然是cell ceph换着打个不停，并不断接触纳米服背后的真相。游戏作为当年的显卡摧毁者，虽然是14年前的游戏了，但是游戏材质仍然很能打，尤其是在白天场景下的远观场景仍然充满质感。但是毕竟是老游戏了，游戏的光照还是差了点，尤其是后半段大部分的夜间场景和地下场景，黑漆漆一片什么都看不清。（不知道是不是bug，游戏设置里调节亮度没有用）而且游戏的枪械手感自然跟现在的射击游戏没法比，还有一些场景的卡脚bug，还有双屏频繁切换为窗口模式的bug，毕竟是老游戏了应该也不会修复了。另外游戏部分场景，尤其是高低差的地图，指引有些差，有时候图标在上面下面根本找不到路，玩得多的人知道找电梯间去互动，但是本身没提示，着实不太好找。\r\n\r\n②游戏整体流程打下来还是很爽的，就是那种很经典的美式主旋律打打杀杀拯救世界的剧情，然后顺便黑黑政府和大公司，那个年代的游戏很多都这一套。不过游戏的23代跟一代不是一个编剧，而我还是先玩了一代重置和三代（小时候2代只玩了一半）所以一套流程玩下来还是发现不少槽点，尤其是没脑子的美国军方，经典核平美利坚自由每一天。一代灵山岛都核弹给章鱼充过一次电了，这二代还在这丢核弹呢，甚至前面还炸水坝要淹死章鱼。。。。除了坑主角外一点作用没有，整体来讲剧情算是三部曲里最差的。而且游戏从二代开始有点往潜行方向发展，纳米装甲战力比一代战力差远了，后面外星人敌人堆怪严重，战力还强，基本都是潜行一路躲过去的。\r\n\r\n③不过总的来说，现在来体验本作的基本都是系列情怀玩家，玩的都是一个情怀回忆，更何况游戏作为一款14年前的作品，画面材质依旧很能打，也不可能把gameplay和现在的游戏来对比。我来玩本作也是为了把三部曲的体验补齐，并且填补小时候只打了一半流程的遗憾，开了装甲模式往下一跳，那感觉直接回来了。最近看到工作室也公布了显卡危机4的开发消息，真的很期待这个经典系列新的延续。", "timestamp_created": 1736072524, "timestamp_updated": 1736072524, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.582212746143341064", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184741748": {"recommendationid": "184741748", "author": {"steamid": "76561198316450417", "num_games_owned": 298, "num_reviews": 49, "playtime_forever": 431, "playtime_last_two_weeks": 0, "playtime_at_review": 430, "last_played": 1736000604}, "language": "english", "review": "Decent enough shooter. The story was much more interesting in the original games, but the gunplay is superior here. Stupid checkpoint system and you cant save your progress at will, so you might have to replay certain sections. Overall, not too bad. Experienced minor visual glitches but that might have been my hardware.", "timestamp_created": 1736000464, "timestamp_updated": 1736000464, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184681991": {"recommendationid": "184681991", "author": {"steamid": "76561198149474720", "num_games_owned": 752, "num_reviews": 223, "playtime_forever": 610, "playtime_last_two_weeks": 0, "playtime_at_review": 544, "last_played": 1735944790}, "language": "russian", "review": "/", "timestamp_created": 1735941338, "timestamp_updated": 1735941338, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184673746": {"recommendationid": "184673746", "author": {"steamid": "76561199140810511", "num_games_owned": 38, "num_reviews": 7, "playtime_forever": 632, "playtime_last_two_weeks": 0, "playtime_at_review": 632, "last_played": 1653066675}, "language": "russian", "review": "ЕБАЛ ХУЙНЮ ЗДОРОВУЮ\r\n", "timestamp_created": 1735934997, "timestamp_updated": 1735934997, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184592443": {"recommendationid": "184592443", "author": {"steamid": "76561199064878476", "num_games_owned": 305, "num_reviews": 18, "playtime_forever": 1279, "playtime_last_two_weeks": 633, "playtime_at_review": 645, "last_played": 1736982341}, "language": "latam", "review": "Juegazo <3", "timestamp_created": 1735873766, "timestamp_updated": 1735873766, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184550974": {"recommendationid": "184550974", "author": {"steamid": "76561197995866271", "num_games_owned": 372, "num_reviews": 27, "playtime_forever": 34, "playtime_last_two_weeks": 0, "playtime_at_review": 34, "last_played": 1735839431}, "language": "english", "review": "This version has a refresh rate and fps cap issue. Refresh rate gets stuck to a low setting and cannot be run above 60 fps without v-sync turned off which then introduces screen tearing. Even at 60 fps with v-sync engaged the game is difficult to enjoy/play as it does not feel smooth because of the possible refresh rate bug causing frame-times to be wildly inconsistent. \n\nSome of the animations and effects can also be noticeably seen to run around at a lower frame-rate which further does not help this version age well unfortunately. The visual colours depending on individual preferences and some lighting choices are better than the remaster imo but overall the remastered version apart from choice of colour grading is improved.", "timestamp_created": 1735840207, "timestamp_updated": 1735842838, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184173389": {"recommendationid": "184173389", "author": {"steamid": "76561198127158652", "num_games_owned": 1134, "num_reviews": 94, "playtime_forever": 102, "playtime_last_two_weeks": 0, "playtime_at_review": 102, "last_played": 1587325681}, "language": "czech", "review": "Tato hra má nádhernou grafiku, která vypadá při hraní opravdu úchvatně. Kdo má rád akční hry, tak můžu rozhoně doporučit. Hrajete za vojáka, který získá superschopnosti a ty ve hře na plno využijete. Hra obsahuje i oficiální češtinu, což je určitě plus. :)", "timestamp_created": 1735521560, "timestamp_updated": 1735521560, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.52436363697052002", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184048201": {"recommendationid": "184048201", "author": {"steamid": "76561197968267113", "num_games_owned": 0, "num_reviews": 34, "playtime_forever": 1130, "playtime_last_two_weeks": 0, "playtime_at_review": 1130, "last_played": 1734903660}, "language": "english", "review": "This game is still as fun to play as it was back in it's day, what I am even more impressed with is how much better the game plays and feels on an non windows based system to the point you really don't need windows 10 or 11 OS to play games, these days there are better options.\n\nRuns fantastic on Bazzite-deck OS (PC)", "timestamp_created": 1735434244, "timestamp_updated": 1736614311, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183974210": {"recommendationid": "183974210", "author": {"steamid": "76561199224555625", "num_games_owned": 429, "num_reviews": 55, "playtime_forever": 565, "playtime_last_two_weeks": 0, "playtime_at_review": 565, "last_played": 1735382680}, "language": "russian", "review": "Crysis 2 - это не просто красивая игра, а идеальное сочетание технологий, динамики и увлекательного сюжета. Нанокостюм открывает невероятную свободу: можно ворваться в бой напролом, полагаясь на силу и броню, или играть скрытно, используя невидимость.\n\nСюжет погружает в борьбу за выживание в разрушенном Нью-Йорке, а графика и музыка создают атмосферу, от которой невозможно оторваться. Каждый бой ощущается как сцена из голливудского блокбастера, где важно не только мастерство, но и стратегия. Игру советую к прохождению.", "timestamp_created": 1735383194, "timestamp_updated": 1735425118, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.544988155364990234", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183924360": {"recommendationid": "183924360", "author": {"steamid": "76561198063240834", "num_games_owned": 0, "num_reviews": 79, "playtime_forever": 835, "playtime_last_two_weeks": 0, "playtime_at_review": 835, "last_played": 1735338871}, "language": "german", "review": "Good", "timestamp_created": 1735338874, "timestamp_updated": 1735338874, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183886465": {"recommendationid": "183886465", "author": {"steamid": "76561198414134862", "num_games_owned": 0, "num_reviews": 48, "playtime_forever": 762, "playtime_last_two_weeks": 0, "playtime_at_review": 762, "last_played": 1653051230}, "language": "schinese", "review": "好，好，好", "timestamp_created": 1735313375, "timestamp_updated": 1735313375, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183883679": {"recommendationid": "183883679", "author": {"steamid": "76561199006668991", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 50, "playtime_last_two_weeks": 0, "playtime_at_review": 50, "last_played": 1628032663}, "language": "turkish", "review": "güzel la alın işte\n", "timestamp_created": 1735311761, "timestamp_updated": 1735311761, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183852295": {"recommendationid": "183852295", "author": {"steamid": "76561199187267593", "num_games_owned": 113, "num_reviews": 125, "playtime_forever": 467, "playtime_last_two_weeks": 0, "playtime_at_review": 467, "last_played": 1735283223}, "language": "turkish", "review": "Selfler kesinlikle gay", "timestamp_created": 1735283302, "timestamp_updated": 1735283302, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183841290": {"recommendationid": "183841290", "author": {"steamid": "76561198959767024", "num_games_owned": 117, "num_reviews": 22, "playtime_forever": 38, "playtime_last_two_weeks": 0, "playtime_at_review": 38, "last_played": 1735233531}, "language": "russian", "review": "Максимум потужности", "timestamp_created": 1735272753, "timestamp_updated": 1735272753, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.519841313362121582", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 11556, "total_negative": 2007, "total_reviews": 13563}, "cursors": {"AoJwzKD/0JADeKH5hgU=": "Mon Jan 20 15:56:45 2025"}}
