{"reviews": {"186021059": {"recommendationid": "186021059", "author": {"steamid": "76561198088076629", "num_games_owned": 746, "num_reviews": 168, "playtime_forever": 1617, "playtime_last_two_weeks": 89, "playtime_at_review": 1617, "last_played": 1737385767}, "language": "english", "review": "This game is a big load of nothing. Ignore the 26 hours on record, 25 is that from card idling. 1 hour of actual playtime and I just sat there being mildly annoyed by the ridiculous amount of textboxes, sluggish controls (controller might make it marginally better) and general lack of... game? It feels empty, nothing, meaningless. Every step to solving a puzzle felt more like a chore than solving a puzzle and playing a game. It's not helped by 20 text boxes coming through to explain 'jump and then press control to slam'.\n\nIt's less helped by how eye-bleedingly ugly the whole thing is. It looks like it came out in 2007, not 2017. Sound design is also a big load of nothing.", "timestamp_created": 1737386106, "timestamp_updated": 1737386106, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185972155": {"recommendationid": "185972155", "author": {"steamid": "76561197987211630", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 1287, "playtime_last_two_weeks": 514, "playtime_at_review": 1287, "last_played": 1737312683}, "language": "english", "review": "Me and my wife really like it. ⭐️⭐️⭐️⭐️⭐️", "timestamp_created": 1737321075, "timestamp_updated": 1737321075, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185945494": {"recommendationid": "185945494", "author": {"steamid": "76561199519986621", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 710, "playtime_last_two_weeks": 681, "playtime_at_review": 642, "last_played": 1737310579}, "language": "german", "review": "a Lizzard and a bat that dont wear a hat 🤯", "timestamp_created": 1737298113, "timestamp_updated": 1737298113, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185816808": {"recommendationid": "185816808", "author": {"steamid": "76561198041094877", "num_games_owned": 741, "num_reviews": 84, "playtime_forever": 1662, "playtime_last_two_weeks": 1425, "playtime_at_review": 1531, "last_played": 1737323284}, "language": "english", "review": "Banjo Tooie was my childhood. I absolutely loved that game, and still do to this day. There is just something inherently fun about collecting and unlocking stuff that seems to have translated into my love for metroidvania games today. So back when I head that a spiritual successor was in the works, I was absolutely stoked. Of course I bought it first chance once it came out, played it and... got so frustrated with the game that I stopped playing in world 2.\n\nNow I wanted to give this game a fair chance again, and actually play through it. And not just that, but 100% complete it. And exactly that I did. So now, after having seen everything that the game has to offer, I have to say that I do not like it. Near the end it really hit me, realizing how so many things in the game are just unfinished. \n\nThere is too much wrong with this game for me to put into words here, but I will try to give a quick summary.\nNow, not everything in this game is bad. There were things in this game I genuinely enjoyed, and a bunch of pagies were actually fun to get. But all that is quickly drowned out by the issues that you do run into. It sadly does not really matter if 90% of a game is great when 10% of it is utterly frustrating.\n\nHere are (most of) my issues:\n1. The Camera. My god, the camera. This is definitely the biggest issue. The autocam is... not good, so I quickly switched to manual cam, which is better. Sadly often times your camera is stuck in auto cam anyway, for instance while you are flying. Other times the camera object just clips through a wall or the ground and gets stuck there, giving you a super weird viewing angle. And that happens often. I want to be able to look around as I am exploring, and see more than just the character. The camera is generally too close to the character as well.\n2. The controls. The game feels really weird to control. It is genuinely hard to explain it, but a lot of mechanics just feel strange to control, almost like you are on ice or something. Flying especially is weird, where steering left and right just turns your character left and right, instead of making you fly in the direction you are pointing in. Walking is fine but pretty much everything else feels unsatisfying or even frustrating in some way.\n3. Now, this is something that I don't even know how to address, but I struggled with knowing where my character was in relation to other things, especially while in the air. The dropshadow seems hard to see a lot of the time, and when you are in the air it is really hard to tell if you are in front of, behind or directly above something. This was not super bad, generally, but a lot of moments of a little bit of frustration still add together quickly.\n4. Some pagies are really, really frustrating to get. Such as stuff that is reliant on the game's weird physics, especially while on a strict timer. Some of them just take too long to get, like the race in the last world. The minecart levels are also really frustrating in later worlds, to a point where I just cheated my way through the last one because I wanted to get it over with.\n5. Speaking of cheating, the only other time I cheated in the game was during the last boss fight. Now, I would consider myself a pretty calm guy. But... my god, that fight is just plain bad. By which I mean that it is just genuinely terribly designed. Nothing about it is fun. Especially with the issues I mentioned before, where it is hard to tell where you are in relation to other things + the terrible camera. I also had wished to see a fight that would cleverly use the mechanics that you already ran into during the game in a satisfying way, where you'd have to use a bunch of them in different ways to deal with the boss. That would have been super satisfying. But instead it's just a couple of phases of mostly the same stuff, where it is also strangely unclear what you even have to do. They also, for some reason, decided to make that bossfight WAY, WAY harder than the entire rest of the game. \n6. The game does not respect your time. There are no warp points or anything. So if you want to go anywhere in the game, you have to walk. No teleport to certain worlds, and no teleport to certain areas within worlds. There are also certain points where dying means you have to start from the very beginning again. Having additional respawn points would be very nice (which is an issue I had with Banjo Tooie as well). Some collectibles are also absurdly hard to find. Like, really, hiding a couple of quills right at the entrance of the world, which you have to break free with the transformation, which you can access at the other side of the world? It is just a waste of time and does not feel satisfying. Overall the game should have made sure there were less moments that felt like \"Ugh, finally I found it, jesus christ\" and more like \"Hey, there it is! Nice!\". It is also beyond me why the progress in worlds is not saved with a lot of things. If you collect a pagie, that is saved of course. But if you, for instance, collect a pagie piece, that is not saved. Collecting a ghost writer is saved, but then doing part of a bigger task, like giving one of five snowman their hat, is not saved.\n7. This is a bit of a strange issue, but the worlds feel... too big? I'd rather have smaller worlds that are interesting and easy to traverse than a huge world where I spend a full hour circling around trying to find that last quill that someone decided to hide somewhere in a hidden nook around the edge of the map. May be a bit nitpicky though\n\nI have seen they are working on a remake of this, and that did look somewhat promising so far. At least they are adding warp points, and it sounds like they did make some good changes in regards to causing less frustration and wasting the player's time less. So... if you were thinking about getting this game right here... maybe wait for the remake?\n\nIf all you want to do is casually stroll through the worlds, get what you want and not worry about everything else, and never ever fight the final boss, then this game is pretty decent and I am sure you will have fun with it. If you want to do anything else, maybe keep your hands off of this one, and see if the remake is any better.", "timestamp_created": 1737155792, "timestamp_updated": 1737155792, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185700573": {"recommendationid": "185700573", "author": {"steamid": "76561198026403147", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 144, "playtime_last_two_weeks": 0, "playtime_at_review": 144, "last_played": 1633652288}, "language": "english", "review": "YouTubers are unnecessarily harsh to Yooka-Laylee. I didn't have Banjo on N64, growing up, and have no nostalgia for it. Some friends who did seemed to enjoy this game. I don't \"hate\" YL, but I've now exhausted every angle without being able to have fun or get lost in it. As someone who accidentally plays through platformers in one night out of sheer excitement, that's not an encouraging sign. I tried again on a couple other platforms, even years apart, mostly out of superstition, hence my Steam hours. \"Maybe it's not the same on PC, and a console with a well-tested controller and uniform specs will feel more streamlined?\"\n\nThe turning point was tonight, when I finally played Banjo-Kazooie for the first time on my actual N64. Even despite technically being a \"Europlatformer,\" a category often reviled in certain retrogaming circle, Banjo-Kazooie is all-around an excellent platformer in any way I can measure. I nerd out over collision response, I try to break things, I play games with an active interest in how they work at the low level. Yooka-Laylee has already been dissected at exhausting length by its naysayers, but I want to focus solely on this divergence, and why I think you should instead play BK, if you've not yet tried either game. It's available on Xbox, you can find it for N64, I'm sure there's other ways. Banjo isn't as free-flowing or athletic as a sliding and diving platformer like Mario 64, but the way it moves and animates was tested and tuned to near perfection. You'll never find yourself asking, \"how did the developers expect me to interpret this?!\" Rather, \"What hint is the game giving me?\" Every once in a while, you're stumped for just a few minutes, only to suddenly feel like a smartypants for progressing again. It's that feeling you remember from playing games growing up. Not just an artifact of nostalgia, but designers and programmers who are good at combining riddles and reflexes.\n\nCollecting goodies, which is monotonous in any inferior collectathon, does not feel like virtual chores. The sounds the pickups make, their distinct looks, and their immediate usefulness will even tempt you. It's sometimes hard to resist grabbing honeycombs even when Banjo's health is topped off. Contrarily, Yooka-Laylee as a collectathon does not give me that same weird, irrational satisfaction. The long walks, slow cooldowns, and sprawling to-do list of ever-increasing quotas feels like a single-player interpretation of the worst elements seen in a freemium MMO. I'm not collecting Pagies, I'm combing the world for Chore Points. Just another hour of this, and I can get a change of scenery!\n\nThe deeper technical side fares no better. YL's equivalent to Kazooie's slope-running drains the dreaded ability meter, where BK's could be used freely without being broken or obsoleting your other moves. The way your more extreme abilities in BK are limited is carefully coordinated with the levels, and how pickups and objects are arranged. Running out of consumables does not feel like hitting a wall. Where Banjo's single point of floor contact is great at making it clear if you're on a steep slope or not, and whether you're falling or grounded (See also: Super Mario 64, Mystical Ninja, Corn Kidz 64) Yooka-Laylee uses capsulloidal collision. This is no problem, even with the potential to be a great improvement. Many modern platformers use spheres, capsules and axis-aligned cylinders (Pac-Man World 2, Super Mario Odyssey, Kirby and the Forgotten Land) with the oldschool method arguably being a trade of accuracy for performance, or even a result of collective programmer inexperience with 3D games. Glover, a later N64 game, has pretty sophisticated floor/wall collision, as does Rocket: Robot on Wheels. But in Yooka-Laylee, I can feel that \"Lean Unity\" tutorial seeping through. The Rextro minigames exemplify it even more. The whole thing does not feel as homegrown as I had hoped.\n\nA ton of people were able to enjoy this game, so it can stand on its own. If the review scores on Steam are any indication, you'll likely be one of them. But if the meticulously tuned joy of the Banjo titles, even sans-nostalgia, are what get you excited, you could end up feeling let down. If this were typed 30 years ago, I'd conclude with \"Rent, before you buy!\"", "timestamp_created": 1737021447, "timestamp_updated": 1737021447, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.510328054428100586", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185628245": {"recommendationid": "185628245", "author": {"steamid": "76561198114593311", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 5685, "playtime_last_two_weeks": 0, "playtime_at_review": 5685, "last_played": 1624085746}, "language": "french", "review": "Un bon jeu plateforme 3D très fun", "timestamp_created": 1736921867, "timestamp_updated": 1736921867, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185353057": {"recommendationid": "185353057", "author": {"steamid": "76561197989270856", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 3125, "playtime_last_two_weeks": 559, "playtime_at_review": 2906, "last_played": 1737402067}, "language": "english", "review": "I think the game is definitely worth considering in its own right 80% is about right on score, but enjoyment is definitely higher. It captures some of the magic from Banjo Kazooie: music, character designs, jokes, puzzles, maneuvers, etc....as the original developers of that game worked on this game too. If you enjoyed that series you will probably enjoy this series. I'm really glad they brought this to PC, instead of heading over to the console only route. Game runs well and looks good overall. The 'Cashino' is hands down the best book world in the game!\n\nThe remake is coming in the near future and based on all the Dev commentary it is shaping up to be a pretty good expanded and revised game. I appreciated their candor and responsibility when talking about some of the issues this game has...so I was kind of aware of some of that before buying.\n\nCons: camera angles/lack of control, lack of custom keybindings, swimming and flying mechanics are bad, not having skills will block game progression quite a bit as a limited number of worlds total does not give player anywhere else to go to try their luck if they end up stuck on a challenge. Not enough environmental variety (these are still very large worlds to their credit...but if you don't like swamps you might have to deal with it for a bit lol. Quizzes block game progression (no quiz = no access to the next world), quills lose their purpose once you have all skills (with a small quota exception at the end), Scale of game is sizable but is not fully filled with challenges, collectibles, etc. sometimes you really feel like the devs wanted to put something at a location but decided not to...perhaps in favor of time or focus elsewhere...example: there is an entire water area that you will move through in the ice book world that has next to nothing going on save for some alien jelly fish and a few access points to special areas...exploration feels a bit fruitless in those situations...but you know I still feel like doing it anyway lol.\n\nAltogether I understand why the Developers want a second crack at the game, and I wanted to support that development. I am confident they will have an excellent remake this time around. Mind you, I still enjoyed the game for what it was, cheers! Whether you wait for the remake or not is up to you.", "timestamp_created": 1736605600, "timestamp_updated": 1736839551, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185297037": {"recommendationid": "185297037", "author": {"steamid": "76561198260908914", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 1549, "playtime_last_two_weeks": 1185, "playtime_at_review": 519, "last_played": 1737338426}, "language": "brazilian", "review": "Gostei muito.", "timestamp_created": 1736548326, "timestamp_updated": 1736548326, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185280696": {"recommendationid": "185280696", "author": {"steamid": "76561199755295952", "num_games_owned": 59, "num_reviews": 15, "playtime_forever": 583, "playtime_last_two_weeks": 572, "playtime_at_review": 201, "last_played": 1736701463}, "language": "english", "review": "banjo-kazooie but better", "timestamp_created": 1736534719, "timestamp_updated": 1736534719, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.456431567668914795", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185142283": {"recommendationid": "185142283", "author": {"steamid": "76561198022596016", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 567, "playtime_last_two_weeks": 17, "playtime_at_review": 550, "last_played": 1736382394}, "language": "english", "review": "shity game has a lot of bugs I would not reccomend", "timestamp_created": 1736375788, "timestamp_updated": 1736375788, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.46875", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184925791": {"recommendationid": "184925791", "author": {"steamid": "76561198241416688", "num_games_owned": 0, "num_reviews": 25, "playtime_forever": 1261, "playtime_last_two_weeks": 0, "playtime_at_review": 1261, "last_played": 1736167829}, "language": "brazilian", "review": "Excelente \"sucessor\" do banjo-kazooie", "timestamp_created": 1736167985, "timestamp_updated": 1736167985, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184899331": {"recommendationid": "184899331", "author": {"steamid": "76561198218194508", "num_games_owned": 0, "num_reviews": 46, "playtime_forever": 902, "playtime_last_two_weeks": 0, "playtime_at_review": 902, "last_played": 1522458560}, "language": "english", "review": "I'm reviewing this before Yooka-Replaylee comes out and the wave of (justified) angry fans make my opinion be marked as bomb review. \n\nThe devs did a very poor job on this game. I had to use a game save file just to skip the intro because it crashed the game every time I tried to play. The graphics are generic at best, the puzzles kinda boring but the main issue is the lack of enemies. Most of the maps feel like a barren wasteland and 90% of the enemies are the same with different skin. Even the first levels on BK had more diverse enemies. How about enemies that:\n\n-throw projectiles\n-fly\n-come from the grownd\n-charge at you at full speed from far away\n-use elemental attacks to hit you\n\nSee? Is no that hard to think some variety. \n\nI bought this game pre-release, and even bought the sountrack expecting to hear that blessful tune calle jungle challenge from David Wise, but they didn't bother to include it.\n\nI put my hopes an dreams on this company back in the day and I got nothing but dissapointment. Now the devs are going to re-launch the game with some improvements and charge full price for it. They say the original owners will get a dicount but what's the point? Graphical improvements, better animation and more puzzles won't make the maps feel less sterile.\n\nI own many games on steam which had some relaunches and remastered versions over time including small indie devs that trully care for their playerbase and put said re-releases for free to all their game owners. And then you have playtonic, expecting you to pay for the same boring game once again. \n\nIf you really want a true platform experience check a hat in time, frog gun, or even some small but fun N64 like platforms that are avalibe, because the Rare we all loved died long time ago. It's spirit isn't at the current Rare or at Playtonic...", "timestamp_created": 1736138716, "timestamp_updated": 1736138862, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.491803258657455444", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184491739": {"recommendationid": "184491739", "author": {"steamid": "76561198116398259", "num_games_owned": 0, "num_reviews": 12, "playtime_forever": 66, "playtime_last_two_weeks": 0, "playtime_at_review": 66, "last_played": 1735785176}, "language": "english", "review": "Game just isn't fun. Movement is sluggish, levels feel both large and barren, most jokes don't really land, most character designs are boring, etc.", "timestamp_created": 1735786280, "timestamp_updated": 1735786280, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.489397615194320679", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184251039": {"recommendationid": "184251039", "author": {"steamid": "76561198880910384", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 902, "playtime_last_two_weeks": 0, "playtime_at_review": 793, "last_played": 1735636853}, "language": "english", "review": "Loved it!!!", "timestamp_created": 1735589107, "timestamp_updated": 1735589107, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183922052": {"recommendationid": "183922052", "author": {"steamid": "76561199368482832", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 3563, "playtime_last_two_weeks": 0, "playtime_at_review": 3440, "last_played": 1735851576}, "language": "english", "review": "its better with a controller or just playing on an xbox fyi\r\npc is good too", "timestamp_created": 1735337300, "timestamp_updated": 1735337300, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183832998": {"recommendationid": "183832998", "author": {"steamid": "76561198183754341", "num_games_owned": 0, "num_reviews": 24, "playtime_forever": 1393, "playtime_last_two_weeks": 0, "playtime_at_review": 1393, "last_played": 1735264348}, "language": "german", "review": "Sehr gutes Spiel mit kleinen Schönheitsfehlern.\r\n\r\nSolche 3d Jump and Run mit offenen Welten gibt es leider fast nicht mehr. Deshalb würde ich mich freuen mehr davon zu sehen.\r\n\r\nDas Spiel ist wie die alten Spiele aufgebaut. Überall sind kleine Sachen die stören wie Kamera und Steuerung usw. aber alles in allem ein gutes Spiel. Einzig das Level Design ist nicht so gut meiner Meinung nach. Zu grosse Welten und wenig miteinander verknüpft. \r\n\r\nWürde mich auf ein drittes Spiel in der Art freuen, das zweite ist ja ein 2D Spiel geworden.", "timestamp_created": 1735266086, "timestamp_updated": 1735266086, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183698644": {"recommendationid": "183698644", "author": {"steamid": "76561199467281125", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 515, "playtime_last_two_weeks": 0, "playtime_at_review": 204, "last_played": 1735703281}, "language": "english", "review": "i love chameleons and bats", "timestamp_created": 1735168502, "timestamp_updated": 1735168502, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.525862038135528564", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183571315": {"recommendationid": "183571315", "author": {"steamid": "76561199106340657", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 1996, "playtime_last_two_weeks": 0, "playtime_at_review": 1996, "last_played": 1735011557}, "language": "spanish", "review": "Si te gustan los plataformeros clásicos en 3D, tipo collectatoon, te va a gustar. No es una revolución, pero tampoco busca serlo.", "timestamp_created": 1735051354, "timestamp_updated": 1735051354, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 3889, "total_negative": 1295, "total_reviews": 5184}, "cursors": {"AoJw89X4zo8Dd/LJ+AQ=": "Mon Jan 20 18:13:12 2025"}}
