{"reviews": {"185924817": {"recommendationid": "185924817", "author": {"steamid": "76561198330009705", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 106, "playtime_last_two_weeks": 106, "playtime_at_review": 106, "last_played": 1737273808}, "language": "english", "review": "A decent VR game with some fun combat, but is dragged down a bit by some clunky movement and a short length. Cool for Doom fans, but not necessary for casuals.", "timestamp_created": 1737276755, "timestamp_updated": 1737276755, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185797620": {"recommendationid": "185797620", "author": {"steamid": "76561198072755717", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 38, "playtime_last_two_weeks": 38, "playtime_at_review": 38, "last_played": 1737132861}, "language": "french", "review": "Le jeu ne se lance pas, il cherche a démarrer en boucle quand je clique sur lancer, j'ai réinstallé le jeu mais maintenant malgré qu'il soit indiqué come exclusivement VR il se lance enfin mais en jeu ''normal'' donc injouable en VR avec mes manettes et sur un écran ''plat'', je verrais plus tard si j'arrive à le lancer, mais cela devrait fonctionner directement du premier coup sans bricoler pendants des heures", "timestamp_created": 1737136468, "timestamp_updated": 1737136468, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185661904": {"recommendationid": "185661904", "author": {"steamid": "76561199154782691", "num_games_owned": 271, "num_reviews": 141, "playtime_forever": 25, "playtime_last_two_weeks": 0, "playtime_at_review": 25, "last_played": 1735758039}, "language": "russian", "review": "Думал будет лучше. Лагающее дерьмо.", "timestamp_created": 1736965884, "timestamp_updated": 1736965884, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185472037": {"recommendationid": "185472037", "author": {"steamid": "76561198052033507", "num_games_owned": 3232, "num_reviews": 319, "playtime_forever": 200, "playtime_last_two_weeks": 200, "playtime_at_review": 200, "last_played": 1736711175}, "language": "russian", "review": "Вам может показаться, что VR-игра на основе DOOM 2016 прозвучит как что-то гениальное. И правда, я представлял себе что-то по истине великое, ну а получилось - как получилось.\n\nНачало интригует: главный герой сразу умирает и получает вторую жизнь в виде разума в  роботе, который имеет тот же арсенал оружия, что и Думслеер. Но почему я не могу ходить? Об этом нам расскажет обучение. Оно предлагает нам делать телепортацию в выбранную точку или… двигаться рывками, у которых звук двойного прыжка из DOOM 2016. Тут я сразу поставил на паузу и полез в настройки, не найдя способа нормально двигаться. Посмотрев гайды понял, что нужно изменить раскладку контроллера, взяв её от сообщества. После установки мы начали нормально двигаться. Все демоны такие же, их поведение идентично. После пары выстрелов вижу, что демон готов к зверскому добиванию. Нажимаю на кнопку телепортации и демон просто разлетается на куски. Забудьте о брутальных добиваниях, особенно если вы хотели сделать это собственными руками (хотя в режиме берсерка можно бить кулаками). Ощущения от оружия никакого нет, держится оно в одной руке, даже если это пулемёт или пушка Гауса. Демоны шустрые, потому что ведут себя по логике DOOM 2016. Для балансировки сил нам дали телепорт, который замедляет время, пока мы выбираем точку. Также можем отталкивать от себя врагов, видимо, мощным пердежом (извините). Похоже, разработчики думали, что нам будет удобно постоянно вертеть головой, чтобы расправляться с демонами. Вот вы сделали телепортацию, чтобы оказаться позади демона, но вы не будете смотреть ему в спину. А пока вы реально развернётесь, условный пинки тоже будет смотреть на вас и удивляться тому, почему разработчикам было так пофиг. Конечно, порой получалось успевать стрелять в спину врагу, но чаще случались конфузы. Даже на нормальной сложности вы вполне можете умереть, потому что справляться с большими волнами врагов не всегда просто. \n\nОднако, мне понравилось, что секреты тут есть. Можно находить аргент-шарики и улучшать здоровье, боезапас и запас замедления времени при телепорте. Можно находить улучшения для альтернативного огня (у каждого оно одно, переключаться нельзя). Ну и конечно можно находить фигурки морпехов. Чтобы вы в конец не задушились на больших аренах, на них можно взять бонусы по типу берсерка или 4х урона. Бензопилу отняли, но зато появилось новое оружие. Сначала в левой руке у вас будет граната. Чуть позже уже будет гранатомёт. А под конец появится тот же гранатомёт, но с зелёными элементами дизайна. Он выпускает BFG-заряд, который работает примерно так же, как и сам BFG. \n\nУровней тут не очень много, а длятся они и того меньше. Побегаем по знакомым местам ОАКа на Марсе, а под конец в аду. Некоторые моменты будто специально взяты из DOOM 2016, когда было неприятно большое количество противников. Только там мы были крутым и нормально подвижным Думслеером, а здесь мы инвалид с телепортациями. Благо дали аналог BFG, чтобы зачищать особенно неприятных манкубусов и прочих. \n\nМожет быть я не разобрался с настройками, но если без махинаций и правда нельзя нормально передвигаться без рывков и телепортов, то я не представляю, как люди это проходили. Видимо, никак, потому что одними из самых редких достижений в Steam являются отправка в ад (чуть дальше середины) и прохождение игры. Искренне не понимаю, как так криво можно было сделать управление. Да и стрельба тоже странная. Если вы стоите вплотную к демону и стреляете, то с большой вероятностью можете промахнуться. Почему? Кибердемон его знает. Поэтому лучше стрелять на небольшом расстоянии. Менять оружие тоже неудобно, для этого нужно нажать на стик, замедлится время и вы можете после этого крутить стиком для выбора оружия, в общем, консольщина. Как вы понимаете, здесь нет абсолютно никакого VR интерактива. Есть мини-игра, где вы вовремя нажимаете на кнопку. Ещё есть мини-игра, в которой даже ошибиться нельзя, просто крутите шарики руками. Никакого взаимодействия с окружением, никакой физики. Просто стреляете и радуетесь, что льётся кровь. Среди всего оружия лучше всего разобрать хитбокс можно только у плазменной пушки. \n\nКак я уже и говорил, мы играем за человека, который находится в теле робота, примерно как Хайден. Мы даже умеем разговаривать, но все монологи сводятся к описанию того, что нам нужно делать дальше. Герой почти ни на что не реагирует, никак не комментирует. Но было удивительно в игре серии DOOM слышать хоть какие-то слова от главного героя. Сюжет движется параллельно с историей DOOM 2016, а требуется от нас закрыть портал в ад. Я возможно что-то упустил, но не очень понимаю, почему тут несколько порталов в ад, несколько Кибердемонов и так далее. Может специалисты по лору мне объяснят, почему история дублирует историю DOOM 2016, что мы тоже отправляемся в ад и тоже побеждаем Кибердемона. \n\nК музыке претензий нет, старый добрый Мик Гордон. Ничем не отличается от DOOM 2016. Так же хорошо.\n\nГрафика вроде неплохая, а вроде и мыльцом отдаёт. Возможно у меня какие-то личные конфликты с id Tech в VR. Поэтому не буду брать на себя компетенцию в описании графики. По сути, как в DOOM 2016.\n\nВот вроде игру не хочется называть плохой, но спорных решений довольно много. Ощущается, как VR-мод от энтузиастов за 2 пачки сухариков и баночку кока-колы. Разок пройти можно для общего развития, но притрагиваться повторно совсем не хочется. Если бы можно было поставить среднюю оценку, то именно её и выбрал.\n\nПлюсы:\n- музыка из DOOM 2016\n- главный герой умеет разговаривать\n- есть секреты, как в DOOM 2016\n\nМинусы:\n- геймплей реализован так, будто это VR-мод от бедных студентов\n- придётся дополнительно настраивать игру, чтобы можно было нормально передвигаться\n- противники из DOOM 2016, поэтому они агрессивные, носятся по всей карте, а вы инвалид с телепортацией\n- непонятный сюжет, будто дублирующий DOOM 2016, но вместо Думслеера другой персонаж\n", "timestamp_created": 1736718743, "timestamp_updated": 1736718779, "voted_up": true, "votes_up": 24, "votes_funny": 0, "weighted_vote_score": "0.766122698783874512", "comment_count": 3, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185314877": {"recommendationid": "185314877", "author": {"steamid": "76561198097835398", "num_games_owned": 2559, "num_reviews": 100, "playtime_forever": 7, "playtime_last_two_weeks": 7, "playtime_at_review": 7, "last_played": 1736564683}, "language": "english", "review": "No left hand support.", "timestamp_created": 1736567104, "timestamp_updated": 1736567104, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.510638296604156494", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185088576": {"recommendationid": "185088576", "author": {"steamid": "76561199481675060", "num_games_owned": 20, "num_reviews": 35, "playtime_forever": 91, "playtime_last_two_weeks": 0, "playtime_at_review": 91, "last_played": 1723242114}, "language": "russian", "review": "К сожалению, в игре не чувствуется физики, не чувствуется окружения, не чувствуется сила монстров.\nТупо как будто видео на ютубе смотришь.. Скучно! =(", "timestamp_created": 1736326118, "timestamp_updated": 1736326118, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185086065": {"recommendationid": "185086065", "author": {"steamid": "76561199099256117", "num_games_owned": 45, "num_reviews": 1, "playtime_forever": 37, "playtime_last_two_weeks": 37, "playtime_at_review": 37, "last_played": 1736322398}, "language": "english", "review": "Pretty fun once you get it working. I just had to follow this guide to get it to work on quest, works perfectly. https://steamcommunity.com/sharedfiles/filedetails/?id=2736094459\n\nits really easy to fix the jank in the controls just by using the steam vr controller binds modifier", "timestamp_created": 1736322782, "timestamp_updated": 1736322782, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.54356849193572998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185030478": {"recommendationid": "185030478", "author": {"steamid": "76561197970306456", "num_games_owned": 101, "num_reviews": 3, "playtime_forever": 230, "playtime_last_two_weeks": 45, "playtime_at_review": 230, "last_played": 1736249785}, "language": "german", "review": "German \r\nIch habe DOOM 2016 geliebt und jetzt die VR-Version des Spiels mit der modifizierten Steuerung gespielt (siehe Links unten), es lief absolut gut auf einer RTX 2070 super und sieht toll aus. Ich empfehle diese Version jedem, der eine ordentliche Umsetzung von DOOM in VR spielen will, etwas VR-Erfahrung hat und eine geringe Neigung zur Motion Sickness. Ich habe die Quest 3 erst vor einem Monat gekauft und hatte bisher keine Probleme damit. Es ist zwar etwas kurz und hat nur einen Endgegner, aber einen Höllenbaron oder einen Höllenritter in VR zu bekämpfen und dessen Größe  zu sehen, ist absolut fantastisch. Versucht das Spiel im Sonderangebot zu kaufen, ich denke, dass alles bis zu 10 Euro in Ordnung ist.  Man wird etwa 4 Stunden Spaß haben und kann das Spiel auf einem schwierigeren Schwierigkeitsgrad erneut spielen.  Die Waffenhandhabung ist gut gemacht (mit der modifizierten Steuerung), das Teleportieren ist gut umgesetzt und es gibt auch eine Option für freie Fortbewegung. \r\n-----------------\r\n\r\nEnglish\r\nI loved DOOM 2016 and now played the VR version of the game with the modded controls (see links below), it ran absolutely fine on a RTX 2070 super and looks great.  I recommend this version to anyone who wants to play a proper implementation of DOOM in VR, has some VR experience and a low tendency to motion sickness. I just picked up Quest 3 a month ago and have had no problems with it. It is a bit on the short side and only has one boss, but fighting a Baron of Hell or a Hell Knight in VR and seeing the scale of them is absolutely fantastic.  Try to pick up the game in a sale, I think anything up to 10 bugs is fine.  You will have about 4 hours of fun and can replay the game on a harder difficulty.  The weapon handling is well done (with the modded controls, teleporting is implemented in a good way and there is also an option for free locomotion. \r\n\r\n", "timestamp_created": 1736267161, "timestamp_updated": 1736267161, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184972345": {"recommendationid": "184972345", "author": {"steamid": "76561198276257547", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 205, "playtime_last_two_weeks": 0, "playtime_at_review": 205, "last_played": 1736184459}, "language": "italian", "review": "Adrenalinico, ottima la grafica, peccato la campagna non è troppo longeva", "timestamp_created": 1736204397, "timestamp_updated": 1736204397, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184925353": {"recommendationid": "184925353", "author": {"steamid": "76561198244835418", "num_games_owned": 567, "num_reviews": 17, "playtime_forever": 9, "playtime_last_two_weeks": 0, "playtime_at_review": 9, "last_played": 1736054872}, "language": "schinese", "review": "不适配Quest3", "timestamp_created": 1736167606, "timestamp_updated": 1736167606, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184581113": {"recommendationid": "184581113", "author": {"steamid": "76561198048852002", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 23, "playtime_last_two_weeks": 0, "playtime_at_review": 23, "last_played": 1735678038}, "language": "brazilian", "review": "Pessima experiencia vr, super datado... Bethesda nao sabe fazer nada sem a comunidade de modders. Guarda seu dinheirinho e pega outro jogo.", "timestamp_created": 1735862907, "timestamp_updated": 1735862907, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184503991": {"recommendationid": "184503991", "author": {"steamid": "76561197993343391", "num_games_owned": 0, "num_reviews": 114, "playtime_forever": 459, "playtime_last_two_weeks": 0, "playtime_at_review": 459, "last_played": 1735767561}, "language": "english", "review": "I liked playing through this game, a lot. it was challenging, fast paced, and visually beautiful. The weapons of Doom are second to none, and this iteration of the game is no exception. The Telefrag feels SO good in VR! I prefer games to have no cutscenes, and Doom got close.\n\nBut the fucking controls are unbelievable on the index. It is absolutely crazy go nuts bad. They should've put in support for keybindings for index, and fuck them for not doing it. The weapon wheel is horrible to use. It sucks so much. The teleportation is crucial, and so frustrating on index. The touchpad on my left controller stopped working while I was making my way through Doom. None of the games in my heavy rotation use that control, so I'm 95% sure I broke it trying to make Doom VFR's teleport work reliably.\n\nIf you really really want to play Doom in VR, then you should definitely play this at a deep discount. May god have mercy on your soul.", "timestamp_created": 1735797410, "timestamp_updated": 1735797410, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184489767": {"recommendationid": "184489767", "author": {"steamid": "76561199129177045", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 403, "playtime_last_two_weeks": 0, "playtime_at_review": 403, "last_played": 1735784320}, "language": "english", "review": "The buggiest game I've ever played. If I can get the sound working then the game just quits. Sheesh what drek.\r\n", "timestamp_created": 1735784480, "timestamp_updated": 1735784480, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.47826087474822998", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184480641": {"recommendationid": "184480641", "author": {"steamid": "76561198290241474", "num_games_owned": 0, "num_reviews": 35, "playtime_forever": 27, "playtime_last_two_weeks": 0, "playtime_at_review": 27, "last_played": 1735775961}, "language": "english", "review": "Two big problems:\n\n1. The game doesn't work out of the box\n\nI needed to decrease the resolution just for it to not constantly crash, at first the game would load properly but just stutter every time you moved your head until it got to a point where I had to take off my headset just to close the game.\n\n2. The game is extremely clunky and not fun\n\nWhat's the point of getting the game to work when the game itself plays like ass? The controls just aren't optimised for anything modern like a Quest or PSVR2, the feedback is next to non-existent, whenever I would get hit the game would make the edges of the screen slightly red which is easy to completely miss so it just feels like you're tanking everything until the game boots you out because you died, whenever I died in Doom 2016/Eternal I could tell I was getting eviscerated, in here it just feels like nothing's happening. Don't buy.", "timestamp_created": 1735776471, "timestamp_updated": 1735776471, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.519685029983520508", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184436218": {"recommendationid": "184436218", "author": {"steamid": "76561198072702246", "num_games_owned": 863, "num_reviews": 83, "playtime_forever": 185, "playtime_last_two_weeks": 0, "playtime_at_review": 185, "last_played": 1735741396}, "language": "english", "review": "Although gameplay alone is absolutely fun (though very short - finished in around 3 hours), I can not recommend buying this. Rarely can you see a game this bugged and unfinished. Crashing constantly.", "timestamp_created": 1735743641, "timestamp_updated": 1735743641, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184228154": {"recommendationid": "184228154", "author": {"steamid": "76561198150206858", "num_games_owned": 156, "num_reviews": 27, "playtime_forever": 316, "playtime_last_two_weeks": 0, "playtime_at_review": 240, "last_played": 1735598316}, "language": "english", "review": "TLDR: Its rushed trash.\n\nNow to the actual review:\nThere are many things wrong with this game, my main problem being the controls, locomotion just feels rushed and you cant even turn properly. The weapon select wheel doesnt work and sometimes gets stuck which is extremely annoying in tense situations and all of that combined with the fact that the story is a thing that, even without having played the game before, you can play through in a day, just dont make it worth 15 bucks.\n\nFor point of reference, my, at the time of writing this, 4 hours playtime include playing the campagin multiple times and getting every achievement except for the dollhouse achievement which i would assume would take another hour to complete if you take your time.", "timestamp_created": 1735572561, "timestamp_updated": 1735572915, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.476190477609634399", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184187075": {"recommendationid": "184187075", "author": {"steamid": "76561198289531298", "num_games_owned": 81, "num_reviews": 6, "playtime_forever": 224, "playtime_last_two_weeks": 0, "playtime_at_review": 224, "last_played": 1735532168}, "language": "brazilian", "review": "É Doom 2016 em VR, só que sem as execuções gloriosas (o que tira muito a graça do jogo pra ser sincero). Se for jogar, não esqueça de ativar (de qualquer forma que conseguir, se vira ai) os comandos de virar a câmera no controle direito, melhora 1000X o jogo. Lembrando que esse jogo saiu no comecinho do VR, então não espere um jogo super mega blaster imersivo e interativo, isso não é Boneworks e sim uma \"experiência\".\n\nO jogo é BEM curtinho, parece mais uma demo do original, eu demorei 30 mins pra achar uma forma de ativar a virada da cãmera e 1 hora pra achar todos os segredos das 8 (9 se contar o \"lobby\") fases; da pra zerar a campanha tranquilamente em 1 hora (1h 40 min se vc for um pateta) e ainda pegar o reembolso marotinho, o que eu fortemente recomendo pros mela cueca que falam mal desse jogo. Como eu sou um mlk edgy, eu gosto de doom, por isso eu fiz 100% do jogo o que demorou 3 horas kkkkkk.\n\n7/10", "timestamp_created": 1735533576, "timestamp_updated": 1735533576, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184098765": {"recommendationid": "184098765", "author": {"steamid": "76561197970580632", "num_games_owned": 0, "num_reviews": 4, "playtime_forever": 19, "playtime_last_two_weeks": 0, "playtime_at_review": 19, "last_played": 1735424880}, "language": "english", "review": "I tried to get it running with my Meta Quest 3s, but the game starts without being streamed to the Meta Quest. I’ve tried all possible graphic settings, but nothing worked. Looking at all the other issues in forums, I’ve lost the motivation to keep trying. I can’t recommend a game that doesn’t work.", "timestamp_created": 1735480044, "timestamp_updated": 1735480044, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.456431567668914795", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184042918": {"recommendationid": "184042918", "author": {"steamid": "76561198011488513", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 161, "playtime_last_two_weeks": 0, "playtime_at_review": 59, "last_played": 1735497989}, "language": "english", "review": "This game is trash.  Beating my head against a wall for an entire day trying to get the right stick to work on a Quest 3.  Finally got it working but that was the least of my problems.  When I start the game I'd say about 20% of the time I get no audio.  20% of the time I get no video.  40% of the time the controllers don't work at all.  Basically I have to start the game a good 5 times EVERY TIME before I get a working run.  Then I'm lucky to get an hour worth of play time before the battery dies.  AMD 3970X / ASUS 4090, so yeah, it's not my computer!", "timestamp_created": 1735429894, "timestamp_updated": 1735429894, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.434343427419662476", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184026856": {"recommendationid": "184026856", "author": {"steamid": "76561199427349091", "num_games_owned": 0, "num_reviews": 2, "playtime_forever": 11, "playtime_last_two_weeks": 0, "playtime_at_review": 11, "last_played": 1735416451}, "language": "english", "review": "I tried to play this with my oculus quest 2, and when i started the game the company intros had sound and etc. but the rest of the game was completely mute (I checked every setting, restarted the game 5 times, but nothing). As the controls, only the triggers was functional, the rest of them didn't responded.\n\nI do not recommend to anybody, unless they have that VR hardware that the developers had on thought when they made this game.", "timestamp_created": 1735418113, "timestamp_updated": 1735418113, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183863217": {"recommendationid": "183863217", "author": {"steamid": "76561197960336697", "num_games_owned": 0, "num_reviews": 96, "playtime_forever": 10, "playtime_last_two_weeks": 0, "playtime_at_review": 10, "last_played": 1735294340}, "language": "english", "review": "You cannot turn with the controller. You can only turn physically. So I had to refund it.", "timestamp_created": 1735294603, "timestamp_updated": 1735294603, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.439706861972808838", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183851501": {"recommendationid": "183851501", "author": {"steamid": "76561197966409460", "num_games_owned": 0, "num_reviews": 8, "playtime_forever": 147, "playtime_last_two_weeks": 0, "playtime_at_review": 147, "last_played": 1735282320}, "language": "english", "review": "Definitely worth a buy on sale. If you have an Oculus / Quest headset then it is easiest to just use a gamepad.", "timestamp_created": 1735282519, "timestamp_updated": 1735282541, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.518072307109832764", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183825959": {"recommendationid": "183825959", "author": {"steamid": "76561199809033027", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 142, "playtime_last_two_weeks": 1, "playtime_at_review": 57, "last_played": 1736726410}, "language": "english", "review": "very awesome game pretty difficult tho", "timestamp_created": 1735260649, "timestamp_updated": 1735260649, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183794212": {"recommendationid": "183794212", "author": {"steamid": "76561198045345200", "num_games_owned": 1503, "num_reviews": 573, "playtime_forever": 299, "playtime_last_two_weeks": 0, "playtime_at_review": 207, "last_played": 1735313129}, "language": "czech", "review": "Záhuba Virtuální Zkurvená Realita, to je celkem tvrdej název pro hru, no ne? A hra tvrdá fakt je. Masakrovat démony ve VR z povrchu Marsu až do samotného Pekla je zábava. Hře nemám až na pár ojedinělých pádů co vyčíst. Graficky na datum vydání ujde, soundtrack peckovej a hratelnost ideál pro možnosti VR. Mrzí mě, že vidím tolik negativních recenzí jen na základě \"nekompatibility\" VR headsetů, což ale není úplně pravda. Na začátku hry si musíte podstatně nakonfigurovat nastavení, a to jak ve hře, tak i ve SteamVR. Na internetu je ale hromada návodů, takže s tím by neměl být problém. Za zmínku stojí i to, že některé VR controllery neumí standardně otáčet postavu joystickem. Já se smířil s tím, že se budu pohybovat fyzicky, ale jinak i to je možné donastavit pár příkazy do konfiguráků hry a vývojářské konzole.", "timestamp_created": 1735247536, "timestamp_updated": 1735247536, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183713221": {"recommendationid": "183713221", "author": {"steamid": "76561198441873111", "num_games_owned": 465, "num_reviews": 70, "playtime_forever": 41, "playtime_last_two_weeks": 0, "playtime_at_review": 41, "last_played": 1735174378}, "language": "spanish", "review": "Los controles de movimiento son lo mas asqueroso que puede haber, ademas de que sus opciones de armas son con \"L3\" y \"R3\" mientras los botones normales son de adorno.\n\n\nDenle la medalla de mediocridad al que hizo los controles.", "timestamp_created": 1735182494, "timestamp_updated": 1735182494, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183656764": {"recommendationid": "183656764", "author": {"steamid": "76561199031836132", "num_games_owned": 0, "num_reviews": 31, "playtime_forever": 27, "playtime_last_two_weeks": 0, "playtime_at_review": 27, "last_played": 1734979607}, "language": "english", "review": "Not the greatest Doom game, a bit difficult to play without a Vive, and it's hard to look around in game, but it isn't the worst game ever. Definitely not underrated, but overhated.", "timestamp_created": 1735137404, "timestamp_updated": 1735137404, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.558676064014434814", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 5, "review_score_desc": "Mixed", "total_positive": 1659, "total_negative": 1378, "total_reviews": 3037}, "cursors": {"AoJwyfHRl44Dfv3X4wQ=": "Mon Jan 20 19:56:08 2025"}}
