{"reviews": {"185872197": {"recommendationid": "185872197", "author": {"steamid": "76561198045658278", "num_games_owned": 0, "num_reviews": 5, "playtime_forever": 5454, "playtime_last_two_weeks": 1, "playtime_at_review": 5454, "last_played": 1737218947}, "language": "french", "review": "90h de jeu cumulé sur ce soft par le passé mais impossible de le relancer. ça plante au démarrage. :(", "timestamp_created": 1737219128, "timestamp_updated": 1737219128, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185708587": {"recommendationid": "185708587", "author": {"steamid": "76561198090207752", "num_games_owned": 149, "num_reviews": 16, "playtime_forever": 2574, "playtime_last_two_weeks": 1774, "playtime_at_review": 2574, "last_played": 1737033160}, "language": "brazilian", "review": "Se eu pudesse reembolsaria facil, jogo parece que simplesmente foi abandonado, comprei no acesso antecipado a muito tempo atras e tinha até gostado finalmente um concorrente para terraria, com coisinhas diferente, e ai do  nada veio a versão 1.0 onde parece que o jogo ta mais bugado que na versão antecipada, recomendo fortemente que nunca comprem jogo com acesso antecipado ainda mais joguinho assim, não vale nada, e o motivo da minha avaliação agora é justamente eu finalmente consegui capturar um bixo raro la com a gema lv 4 peguei o item e quando eu fui usar para transforma o item simplesmente sumiu do meu inventario, o craft do jogo é muito limitado, estava jogando na dificuldade pesadelo e o jogo é muito facil, mapa pequeno, os bosses muito fracos e muitos bugs, não recomendo", "timestamp_created": 1737033316, "timestamp_updated": 1737033316, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185560356": {"recommendationid": "185560356", "author": {"steamid": "76561198051443142", "num_games_owned": 0, "num_reviews": 50, "playtime_forever": 3060, "playtime_last_two_weeks": 1436, "playtime_at_review": 3060, "last_played": 1736836224}, "language": "brazilian", "review": "Come on devs, where is the tech suit? Where is all that work, so many fancy animations to not even make it to full release. I'm truly sad, the battlesuit was this game whole marketing for me.", "timestamp_created": 1736837763, "timestamp_updated": 1736837763, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185400334": {"recommendationid": "185400334", "author": {"steamid": "76561198354024031", "num_games_owned": 0, "num_reviews": 6, "playtime_forever": 521, "playtime_last_two_weeks": 86, "playtime_at_review": 521, "last_played": 1736645936}, "language": "english", "review": "Oyun zaman kaybı oynayıp paranızı boşa harcamayın.", "timestamp_created": 1736646081, "timestamp_updated": 1736646081, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.436885267496109009", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185323069": {"recommendationid": "185323069", "author": {"steamid": "76561198150821363", "num_games_owned": 176, "num_reviews": 62, "playtime_forever": 624, "playtime_last_two_weeks": 0, "playtime_at_review": 624, "last_played": 1735206621}, "language": "english", "review": "the game itself is fun, but the problem only on the UX side.", "timestamp_created": 1736574095, "timestamp_updated": 1736574095, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185133512": {"recommendationid": "185133512", "author": {"steamid": "76561198870355928", "num_games_owned": 0, "num_reviews": 19, "playtime_forever": 2682, "playtime_last_two_weeks": 0, "playtime_at_review": 2682, "last_played": 1735607826}, "language": "english", "review": "A Terraria like inspired platformer with Farming, Customize your own spells, Monster catching/breeding, Dungeon based progress system for crafting weapons and armor\r\nCan't wait to see future updates!\r\n*Review as of 1.0 Release", "timestamp_created": 1736366573, "timestamp_updated": 1736366573, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184952457": {"recommendationid": "184952457", "author": {"steamid": "76561198176693253", "num_games_owned": 147, "num_reviews": 6, "playtime_forever": 180, "playtime_last_two_weeks": 0, "playtime_at_review": 180, "last_played": 1736188338}, "language": "russian", "review": "Incomprehensible, may god have mercy on the dev's wretched soul", "timestamp_created": 1736188671, "timestamp_updated": 1736188671, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184859077": {"recommendationid": "184859077", "author": {"steamid": "76561198034725167", "num_games_owned": 146, "num_reviews": 10, "playtime_forever": 2998, "playtime_last_two_weeks": 0, "playtime_at_review": 2979, "last_played": 1736101972}, "language": "russian", "review": "Игра звезд с неба не хватает, но в своем жанре она ближе к хорошей игре, к тому же весь потенциал разработчиками еще не реализован несмотря на выход версии 1.0.\nИз явных плюсов это хорошая приятная графика, расширенная боевая система и магия, а так же большой простор для кастомизации своего дома.\nИз явных минусов это периодические вылеты, система Магических технологий работающая на душах(резисторы, транзисторы, логические схемы и тд, я считаю это перебором ), неочевидность работы некоторых механик игры и перевод на русский (он не полный, иногда и смысл искажен).\nВ общем если вы прошли Террарию и Старбаунд вдоль и поперек, поиграйте, несколько десятков часов игра у вас займет.\nИ где черт побери мой трансформер или механический шагоход?!!!", "timestamp_created": 1736101792, "timestamp_updated": 1736101792, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184665083": {"recommendationid": "184665083", "author": {"steamid": "76561198103270489", "num_games_owned": 0, "num_reviews": 14, "playtime_forever": 10887, "playtime_last_two_weeks": 0, "playtime_at_review": 10887, "last_played": 1733954768}, "language": "german", "review": "The Game had huge potential and has lots of cool mechanics you won't find in other games of this genre at this time but it got officially abandoned and oly will get some bug fixes.\nI'll leave the listing of cons to other people and tell you about the nice things as the 1.0 release was sad enough:\n\ngood things:\n\n-you can re-role weapon stats and even upgrade them and and their abilitys!\n-you can add runes to armor and weapons in case they have slots for runes, if not you can grin and dismantle other weapons to rerole rune slots on weapons and armors too!\n-you can use 1 weapon and armor for the rest of the game because you can upgrade it after every boss or up to epic level with normal re-rolling !\n-they recently added wings!(teasered 8 years ago)\n\nIf you like this game maybe you also like Terraria or Corekeeper or if you like the space theme and want a mostly space themed story check out Starbound.\n\nI had very high hopes for this game and now i am just sad.\n", "timestamp_created": 1735928430, "timestamp_updated": 1735928430, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184495266": {"recommendationid": "184495266", "author": {"steamid": "76561198057783809", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 853, "playtime_last_two_weeks": 57, "playtime_at_review": 531, "last_played": 1736693920}, "language": "english", "review": "Fun game, crazy deep if you're a completionist.\r\n\r\nAll monsters spawn with a rarity modifier and random passives which can be absolutely busted, you can catch them, ride them, breed them, have them fight for you or power your machines palworld-style. Every weapon and armor comes with a damage type or element, a level of rarity, enchantments, runes and glyphs that can level up or be rerolled. You can build your own custom spells by picking an element of your choice, then add effects, movement patterns, adjust the damage and range (in exchange for manacost). You're also strongly encouraged to build factories, there's a whole system with cogs, pipes and power sources that can be used to automate food crafting I think? Havent touched it yet. There's a crap ton of ingredients and meals, crops to be grown, and eating each of them for the first time is how you increase your max HP. Also you get a skill tree and your inventory is infinite.\r\n\r\nThat was the good part.\r\n\r\nThe bugs... JESUS christ. 2016 Ark Survival Evolved looked like a finished, well polished AAA game compared to this mess. The amount of times I've had items fall through the world or just vanish from my inventory, the weird hitboxes, the crashes every 2h and then you lose your last 10 minutes of progress..... shameful. 15 minutes in my new game and my character just keeps dying and respawning at high speed, my buddy says he sees a fire animation on my character? Oh but I'm not losing any essence (basically xp), im actually gaining a lot of it! Great, I guess I found an infinite xp glitch? 15 minutes in? \r\n\r\nSometimes I cant interact with blocks that I placed, in MY house for no apparent reason, but closing and reopening my world fixes it. Sometimes my friends can see mobs and I cant, sometimes its the other way around. Sometimes dungeons spawn without loot, or with challenge instructions that only some people can see.\r\n\r\nEnough shitting on the crappy programming; the DESIGN:\r\n\r\nHow can anyone think that you want to get BLASTED with the intro music at 10000 Db when you open the game for the first time is beyond me, but even better: the title screen doesnt even have an \"options\" option. Thats only in the ingame interface. And that interface... oh boy.... have fun opening your inventory and have it take 8/10th of the screen (cant be resized btw), in a game where you're gonna be opening the menu every 2 seconds, thats just terrible. And scrolling in your inventory (or any menu for that matter, be it the skill window or the tutorial) also scrolls your hotbar, same for clicking. I mustve set my base on fire at least 6 times because I was unknowingly scrolling to a fire staff/spell (that I couldnt see, see comment about the huge inventory) and clicked on a menu item which made me shoot a fireball in my chicken coop.\r\n\r\nThe loot is so unbalanced my friend and I found these crystals in a chest, 48 of them in the same chest. Using them sends us to the SAME dungeon, every time. We cleared it, it keeps sending us there. We now have 600 of those crystals. You also get crystals to upgrade your gear to a certain level. 1h in and I had 20 of those crystals.... 2 of them are enough to max out any piece of late game gear....... but hey you wanna max the RUNES on your gear? LOL that'll take 4 to the power 7 (16,384) runes of the same type, ideally you'll also want 3 runes per piece of gear. And they also need to be the same TYPE of rune (out of like 13 types ive found so far, there's probably more). These runes have a drop rate of about 1/200. Enjoy.\r\n\r\nNot to mention the absolute absence of guidance, need a blue orb to upgrade your anvil? Alright have fun looking for that lol (its dropped by the green monkeys in the jungle(wtf)). Oh hey, here's a random gate that'll cost you 2000 essence. I looked everywhere, there's nothing beyond the gate, just an empty prairie. Wanna go home? 2000 essence.\r\n\r\nThe NPCs dont do anything, dont even bother trying.\r\n\r\nI first played this game 7 years ago on my brother's computer and thought it had a lot of potential.\r\n\r\n2 weeks agoI saw it released for good and bought it but.... this is the same game I played 7 years ago... wtf did the devs do since 2017??\r\n\r\n10000/10 concept, very ambitious, lots to do (especially when you keep losing your stuff to bugs), 3/10 for the execution.\r\n\r\nI still enjoy it, I think.", "timestamp_created": 1735789433, "timestamp_updated": 1735789433, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184453275": {"recommendationid": "184453275", "author": {"steamid": "76561198055623095", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 55513, "playtime_last_two_weeks": 0, "playtime_at_review": 55513, "last_played": 1735757640}, "language": "brazilian", "review": "bom", "timestamp_created": 1735756079, "timestamp_updated": 1735756079, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184226365": {"recommendationid": "184226365", "author": {"steamid": "76561198071110686", "num_games_owned": 144, "num_reviews": 3, "playtime_forever": 2040, "playtime_last_two_weeks": 0, "playtime_at_review": 1802, "last_played": 1735898270}, "language": "russian", "review": "Обычно я не оставляю отзывы, но в этот раз я согласен с другими игроками: игра ещё не доработана. Многие функции, такие как сон или ожидание ночи, отсутствуют. Также нет чёткого сюжета.\n\nЯ считаю, что этот проект требует доработки. Локализация оставляет желать лучшего, есть проблемы с окнами: текст выходит за их пределы. Масштабирование фиксированное, и нет возможности настроить удобное отображение HUD. В остальном проект вполне играбельный.\n\n\nI don't usually leave reviews, but this time I agree with other players: the game is not finalized yet. Many functions, such as sleeping or waiting for the night, are missing. There is also no clear plot.\n\nI believe that this project requires further development. Localization leaves much to be desired, there are problems with windows: the text goes beyond their limits. The zoom is fixed, and there is no way to set up a convenient display of the HUD. Otherwise, the project is quite playable.\n", "timestamp_created": 1735571270, "timestamp_updated": 1735571270, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184186973": {"recommendationid": "184186973", "author": {"steamid": "76561197990188583", "num_games_owned": 0, "num_reviews": 231, "playtime_forever": 1222, "playtime_last_two_weeks": 0, "playtime_at_review": 1222, "last_played": 1735532456}, "language": "english", "review": "Has... had potential, but left early access as incomplete/unpolished/buggy 1.0 release with all its cons.\n\n+ Terraria-like\n+ Music\n\n- Bugs\n- Unfinished\n- Unpolished\n- Lack of ingame-info, tooltips are very generic\n- The tutorial system (aka quests) feels: a) stupid (lots of work for nothing) b) useless (not informative, unhelpful most of time)\n- The action bar is weird with that switching/exchanging to have both mouse buttons assigned\n- Lack of hotkeys (e.g. 4 hotkeys for left/right skills)\n- The progression is poorly balanced, I could find [spoiler]bronze hammer needed to upgrade anvil to craft bronze items[/spoiler] while already got iron and steel one\n- The variety of enemy buffs is ridiculous, the easy enemy suddenly become OP with health regen or some nasty periodically cast spells\n\nCan't tell a single thing about this game what makes it outstanding compared to other Terraria-like games.\n\nAvoid, even on discount. The game is boring.\n\nP.S.: another wasted early access tittle..\n", "timestamp_created": 1735533443, "timestamp_updated": 1735533443, "voted_up": false, "votes_up": 18, "votes_funny": 0, "weighted_vote_score": "0.68906867504119873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183943921": {"recommendationid": "183943921", "author": {"steamid": "76561198073629871", "num_games_owned": 356, "num_reviews": 32, "playtime_forever": 1652, "playtime_last_two_weeks": 0, "playtime_at_review": 1539, "last_played": 1735362395}, "language": "brazilian", "review": "[h1]Bonito, mas pura tristeza[/h1]\n\nA sensação é que os devs fazem o possível para que a gente não goste do jogo.  \nEstou esperando suporte real para controle até hoje. Quase dois anos.\n\n[h2]O que não gostei:[/h2]\n\n[b] - Controle:[/b] Existe, mas não aparece no jogo, nem para configurar, nem para dizer o que os botões fazem (copiei abaixo os comandos. Boa sorte).\n  \n[b] - Sombras horríveis:[/b] Fazem a tela ficar piscando nas extremidades.  \n\n[b]-  Sem suporte real para Full HD (1920x1080):[/b] O modo janela tem bordas, e você nunca vai conseguir jogar de um jeito bom. [b]4K?[/b] Você não vai conseguir ler nada.\n  \n[b] - Telas de configuração e opções ultrapassadas:[/b] Parecem ter sido feitas há 10 anos e esquecidas. Mudou a configuração e quer voltar para a anterior?       \"[i]— Muahauahuah, não.[/i]\" \n\n[b] - Poucas mudanças:[/b] Não mudou quase nada da versão anterior para a versão que saiu no 1.0, inclusive os controles.  \n\n[b] - Funcionalidades avançadas sem propósito:[/b] O jogo permite coisas super avançadas como criar magias próprias, fazer automação com almas e usar energia. Seria fantástico, mas isso não serve para nada no jogo em si. Faltou o principal: o jogo em si.  \n\n[b] - Dungeon com fantasmas:[/b] Quando você morre em uma dungeon com fantasmas, eles vão te perseguir pela eternidade e matar todos os NPCs da sua base. Sim, eles atravessam paredes, terreno e o que mais aparecer, e matam os NPCs.\n\n[h2]O que gostei:[/h2]\n\n[b] - Animações bonitas:[/b]  \n[b] - Boas ideias de movimentação e ações do personagem:[/b] Depois que você aprende a usar o controle (até lá, dor e sofrimento).\n\n[hr][/hr]\n\n[h3]Controles:[/h3]  \nOs controles estão em uma publicação antiga no Steam:  \n[url=https://steamcommunity.com/games/385380/announcements/detail/3700312518393325123]Link para os controles[/url]\n\nBindings:  \n- Back: Menu  \n- Start: Inventory  \n- L1 + Start: Craft  \n- R1 + Start: Tutorial  \n- R1 + Back: Toggle minimap\n\n- L1 + R1: Switch L & R items  \n- L1: Hotbar move cursor left  \n- R1: Hotbar move cursor right  \n- LT: Use item 1  \n- RT: Use item 2  \n- R1 + LT: Use skill 1  \n- L1 + RT: Use skill 2  \n- DPAD-L: Switch Skill 1  \n- DPAD-R: Switch Skill 2  \n- DPAD-U: Set blocks on front  \n- DPAD-D: Set blocks on back  \n- DPAD-L (ui-navigation): Experimental: move cursor to previous item (hotbar)  \n- DPAD-R (ui-navigation): Experimental: move cursor to next item (hotbar)\n\n- Y: Interact  \n- X: Dash  \n- A: Jump  \n- B: Potion slot\n\n- X (ui-navigation): equivalent of right click  \n- A (ui-navigation): validate / click  \n- B (ui-navigation): cancel / esc\n\n- L1 + Y: Toggle directional mode  \n- R1 + Y: Toggle cursor control  \nIf enabled you can move the virtual cursor with R-Stick\n\n- L-Stick pressed: Toggle Run  \n- R-Stick pressed: Throw item\n\n- L-Stick: Move  \n- R-Stick: Aim\n\n- L-Stick (ui-navigation): Move cursor  \n- R-Stick (ui-navigation): Scroll", "timestamp_created": 1735355004, "timestamp_updated": 1735355423, "voted_up": false, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.543859660625457764", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183910813": {"recommendationid": "183910813", "author": {"steamid": "76561199124994394", "num_games_owned": 0, "num_reviews": 9, "playtime_forever": 797, "playtime_last_two_weeks": 53, "playtime_at_review": 225, "last_played": 1737322338}, "language": "english", "review": "it is so fun but don't burn your house!!!!!!!", "timestamp_created": 1735329789, "timestamp_updated": 1735329789, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183873746": {"recommendationid": "183873746", "author": {"steamid": "76561198149709485", "num_games_owned": 82, "num_reviews": 2, "playtime_forever": 699, "playtime_last_two_weeks": 0, "playtime_at_review": 699, "last_played": 1636291706}, "language": "russian", "review": "Максимально не рекомендую брать это говно я играл в пиратку решил поддержать проект по своей глупости надеясь что разработчиком не насрать на свое детище как же я ошибся игру просто похоронили да и в принципе учитывая внутренностн там максимум рублей на 35 потянет или лучше бесплатно все ровно проект мертв игра у меня уже больше 2 лет не единого изменения нет просто глухой проект для выкачивания бабок не берите скачайте лучше так и поймете о чем реч поддерживать тут некого ! Проект мертвый разрабом спать на него и делать тут нечего всем удачи и играйте только в хорошие игры", "timestamp_created": 1735304150, "timestamp_updated": 1735304150, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.519293010234832764", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183695746": {"recommendationid": "183695746", "author": {"steamid": "76561198031708070", "num_games_owned": 141, "num_reviews": 3, "playtime_forever": 54, "playtime_last_two_weeks": 0, "playtime_at_review": 54, "last_played": 1699844294}, "language": "english", "review": "Releasing the 1.0 version of a game is to say \"yes, all the features and functionality for the base game have been completed and implemented\". Nowadays, there is of course the potential for extra features to be added later via updates, but the point of a 1.0 version is for all purposes, a finished game the way it was intended.\n\nNot the case here. This game is being pushed to version 1.0 missing many features intended for the base game. This is being done for the sake of \"increasing sales\". The developer said so. The developer has stated that the missing features are planned to be implemented eventually. Even if this is the case, pushing an unfinished game to version 1.0 and out of early access like this is just plain wrong, no exceptions.", "timestamp_created": 1735165990, "timestamp_updated": 1735165990, "voted_up": false, "votes_up": 39, "votes_funny": 0, "weighted_vote_score": "0.768585085868835449", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183686327": {"recommendationid": "183686327", "author": {"steamid": "76561199075307204", "num_games_owned": 20, "num_reviews": 4, "playtime_forever": 1773, "playtime_last_two_weeks": 140, "playtime_at_review": 1614, "last_played": 1736286437}, "language": "english", "review": "Kinda barebones but thats expected for a 1.0 version, really fun and i have high expectations for future updates. Some sprites and sound effects could get some touch-ups, and the UI needs some major redesign. The game has a fun concept and the content in the game are fun to explore, ranging from biomes to dungeons with bosses that have unique attacks.\r\n\r\n7/10, big fun and big expectations for this game. Might even come close to something like Terraria! (or even surpass it..?)", "timestamp_created": 1735158717, "timestamp_updated": 1735158717, "voted_up": true, "votes_up": 3, "votes_funny": 1, "weighted_vote_score": "0.457541525363922119", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183596727": {"recommendationid": "183596727", "author": {"steamid": "76561199434370201", "num_games_owned": 0, "num_reviews": 1, "playtime_forever": 5423, "playtime_last_two_weeks": 1, "playtime_at_review": 3306, "last_played": 1736293694}, "language": "english", "review": "very fun and involved leveling system, plenty of enemies, interesting stat leveling system, all around great experience.", "timestamp_created": 1735072971, "timestamp_updated": 1735072971, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.518072307109832764", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183564596": {"recommendationid": "183564596", "author": {"steamid": "76561199008460212", "num_games_owned": 0, "num_reviews": 10, "playtime_forever": 281, "playtime_last_two_weeks": 0, "playtime_at_review": 182, "last_played": 1735104866}, "language": "english", "review": "The game is pretty fun but really hard to get started", "timestamp_created": 1735045841, "timestamp_updated": 1735045841, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.490494310855865479", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 1621, "total_negative": 413, "total_reviews": 2034}, "cursors": {"AoJwo4qTtYkDcKaBnwQ=": "Mon Jan 20 18:37:26 2025"}}
