{"reviews": {"185975610": {"recommendationid": "185975610", "author": {"steamid": "76561197990406921", "num_games_owned": 0, "num_reviews": 1125, "playtime_forever": 655, "playtime_last_two_weeks": 655, "playtime_at_review": 6, "last_played": 1737380737}, "language": "english", "review": "like all neptunia games, too slow for me", "timestamp_created": 1737324487, "timestamp_updated": 1737324487, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185375382": {"recommendationid": "185375382", "author": {"steamid": "76561198131981413", "num_games_owned": 169, "num_reviews": 20, "playtime_forever": 3081, "playtime_last_two_weeks": 454, "playtime_at_review": 3081, "last_played": 1736622774}, "language": "english", "review": "I [i]really[/i] want to say I enjoyed this game, but I just didn't.\r\n\r\nThere was a lot of potential for this game to be great: The story was promising, Nepgear really got a boost in her character, jumping actually does something now, and there are some fun new gimmicks that can be used in the dungeons.\r\n\r\nUnfortunately, when playing the game for the first time, I ran into a lot of difficulty spikes, and then afterwards, grinding to get the good ending seemed like such a chore. I have to say the experience wasn't worth it.", "timestamp_created": 1736623042, "timestamp_updated": 1736623042, "voted_up": false, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.509433984756469727", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185336265": {"recommendationid": "185336265", "author": {"steamid": "76561198060708529", "num_games_owned": 884, "num_reviews": 67, "playtime_forever": 2795, "playtime_last_two_weeks": 1503, "playtime_at_review": 2638, "last_played": 1736607524}, "language": "russian", "review": "Лучшая часть серии. Теперь я понимаю почему продолжения так до сих пор и нет, а только спин-оффы\r\nСделать что то настолько же хорошое будет действительно сложно.\r\nВсе истории прошлых частей с отсылками на персонажей и события из прошлых частей показали, новых персов ввели, жаль всех старых убрали и оракулы других стран так и не вернулись.\r\nNG+ и выход на истинную концовку как всегда стоили потраченного времени.\r\nЕсли будете играть обязательно купите ultimate weapon pack с ним игра проходиться на много быстрее и проще", "timestamp_created": 1736590190, "timestamp_updated": 1736590190, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "185299294": {"recommendationid": "185299294", "author": {"steamid": "76561198085514359", "num_games_owned": 171, "num_reviews": 52, "playtime_forever": 10304, "playtime_last_two_weeks": 1065, "playtime_at_review": 10304, "last_played": 1736549759}, "language": "french", "review": "Mieux que Rebirth;3 sur presque tous les points.\nL'histoire est toujours aussi bonne que dans mes souvenirs, et les combats sont plus dynamiques.\nLe jeu réussit à trouver le juste équilibre entre un gameplay trop facile et une difficulté \"Difficile\" qui demande de grinder.\n\nLes stratégies mises en place lors des combats sont déjà plus importantes que dans les jeux précédents.\nLe système de scout est beaucoup plus intéressant : il permet de buffer (ou debuffer) les donjons, mais aussi d'en découvrir des cachés.\n\nPour ce qui est du 100 %, il demandera plus de temps, et pour certains succès, une dose de RNG (Fugg you CPU chips).\nSinon, dans l'ensemble, il est plutôt simple, il demandera juste un peu de temps.", "timestamp_created": 1736550355, "timestamp_updated": 1736601090, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184889595": {"recommendationid": "184889595", "author": {"steamid": "76561199189266678", "num_games_owned": 2375, "num_reviews": 571, "playtime_forever": 345, "playtime_last_two_weeks": 0, "playtime_at_review": 345, "last_played": 1736079261}, "language": "schinese", "review": "不推荐，公式nep，和前几部一样，而且迷宫更复杂了", "timestamp_created": 1736127449, "timestamp_updated": 1736127449, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184873458": {"recommendationid": "184873458", "author": {"steamid": "76561198095458130", "num_games_owned": 0, "num_reviews": 7, "playtime_forever": 4230, "playtime_last_two_weeks": 4, "playtime_at_review": 4226, "last_played": 1736597972}, "language": "english", "review": "I will preface this by saying: I'm aware this is a review for a game that's been out for approaching a decade now. Most people who were going to play this game have already done so at this point. With that being said, I'll still give my piece.\n\nAs a Neptunia game, it definitely deserves the title of best Neptunia game. The story is incredibly good and engaging, and numerous characters get their own turn to shine. If you've played other Neptunia games and enjoyed them, you'll definitely enjoy this. Uzume, the new character we met, ended the story as possibly one of my favourite neptunia characters of the entire franchise. The antagonists are pretty interesting in their own right, ignoring the usual returnee of Arfoire who feels like she's only in because its Arfoire.\nThe story itself is split into three distinct arcs. The first is set in Zero Dimension, which was a very strong story from start to finish, with good character interactions.\nThe second part, by far the longest section, was itself split into 5 parts, one in each nation with a different CPU as the lead, and the last all together. The characters were slightly more scattered, but still very good. Each storyline in here felt different enough from each other to not feel samey\nThe last part is back to Zero Dimension and by far the shortest. It was pretty good, gave a lot of closure to the various plot points and had some very good speeches and touching moments\n\nMy problems with the game are two-fold:\n1: Random encounters. Navigating around the map involves your characters 'walking' on routes to various dungeons or other locations. These roads have 'nodes' where you have a chance to encounter a monster. The problem is that this chance is far too high, and when it happens, it entirely ruins the flow of the story. I had a cutscene, needed to travel a couple nodes over to see the second part of that cutscene, but every single node triggered an encounter, forcing me to fight some monsters. I already have to fight monsters in the dungeons and bosses, I shouldn't be forced to fight monsters on what should be fast-travel. \nMost annoyingly, NG+ actually gives an item that prevents these encounters. I used it, and the second playthrough was SIGNIFICANTLY more enjoyable. And they obviously knew it would be or they wouldn't have included that item. In which case, just get rid of those encounters in the first place.\n2; My other problem with the game; actually getting the True Ending. It is so incredibly frustrating to learn , 60 hours into my playthough, that because I had missed a single, time limited, unmarked, missable quest 20 hours ago, I was locked out of the True Ending with no way to reverse that without replaying 20 hours of game. Then my second playthrough, now actively on the lookout for those quests, I STILL managed to miss one of them because I didn't check the Guild Tab in the exact right transition. Again I didn't know until I got to the end. This is especially eggresious since the only reason I'd do that quest originally is to get Shares, but I had already maxed them, so I had NO reason to do this unmarked random quest among a dozen other identical quests that in no way hinted it was critical to the story in any way. \nTL:DR, if you want the True End, use a guide. Don't just try doing everything you see, because miss even a single thing and you're screwed. And then you've wasted 60 hours of careful gameplay.\n\nOverall story rating: 9.5 out of 10\nOverall gameplay rating: 4 out of 10", "timestamp_created": 1736112129, "timestamp_updated": 1736113246, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52651512622833252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184819518": {"recommendationid": "184819518", "author": {"steamid": "76561198094113202", "num_games_owned": 1194, "num_reviews": 64, "playtime_forever": 4328, "playtime_last_two_weeks": 0, "playtime_at_review": 4328, "last_played": 1736056049}, "language": "english", "review": "SEGA Dreamcast's tragedy could not be better told. Umio DLC is a must imho.", "timestamp_created": 1736068649, "timestamp_updated": 1736068649, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184617674": {"recommendationid": "184617674", "author": {"steamid": "76561199164189818", "num_games_owned": 25, "num_reviews": 6, "playtime_forever": 2707, "playtime_last_two_weeks": 0, "playtime_at_review": 2707, "last_played": 1735857421}, "language": "russian", "review": "[h1]Megadimension Neptunia VII[/h1] \nлучшее что создали Idea Factory на 2016 год [b]НО[/b] со своими проблемами. \nЯ могу рассказать о всех плюсах игры но ни в одном положительном отзыве не говорят о проблемах, а их ОЧЕНЬ много\n[list]\n  [*]Игра сырая, разработчики делали игру с нуля\n  [*]Практически все новые механики бесполезны и даже токсичны\n  [*]У игры плохая оптимизация\n  [*]У игры много критических багов\n[/list]\n[b]игра сырая, разработчики делали игру с нуля[/b]\n\nПри прохождение VII было стойкое ощущение что я играю в бетку, разработчики добавили слишком много нового даже не подумав, нужно ли оно?\n\n[b]Практически все новые механики бесполезны и даже токсичны[/b]\n\nЕсли сравнивать Megadimension с трилогией Hyperdimension то разница в игровом геймплее огромна. Например - механика передвижений на карте ужасна, расстояния в игре огромны и случайные битвы будут появляться в самые неподходящие моменты. Это - плохая механика, а есть просто бесполезные, например - новая боевая система. А точнее система обычных, быстрых и сильных ударов. Они не наносят урона, их комбо нелогичны и не работают как задумано, а главная их механика в поломке щита противника что бы в дальнейшем ударить способностью - отсуствует. [quote=Суйх Уй Вынь] Кто кого больше заспамит тот и победит [/quote] \n\n[b] У игры плохая оптимизация [/b]\n\nНачиная с этой части на актуальном железе [i]I3 12100 rx6600[/i] были проседания фпс. Процессор не был загружен в 100%, а видеокарта и вовсе даже вентиляторы не включила. Это связано с неумением игры использовать мощность твоего компьютера.\n\n[b]У игры много критических багов[/b]\n\nСамое ужасное, четвертая часть приключений Непко имеет небольшую особенность ввиде [b]протечки ОЗУ[/b]. Да, именно так. При сворачивание игры, ее потребление оперативной памяти бесконтрольно растет. Среднее потребление ОЗУ - 700мб, у меня доходило до 2.5гб. При превышение этой планки - игра крашилась, а весь несохраненный контент, пропадал. А так же при загрузке сложных сцен даже небольшое превышение среднего потребления оперативной памяти грозит вылетом. \n\n[h3]Это все ужасно, но мой обзор положительный. Почему? [/h3]\nОтвет простой - сюжет и персонажи прекрасны. Мне было крайне интересно за ними наблюдать и ДА, я советую эту игру к покупке, и прохождению даже с таким количеством проблем.", "timestamp_created": 1735902013, "timestamp_updated": 1735902239, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184491683": {"recommendationid": "184491683", "author": {"steamid": "76561199047054371", "num_games_owned": 0, "num_reviews": 20, "playtime_forever": 476, "playtime_last_two_weeks": 282, "playtime_at_review": 194, "last_played": 1737160914}, "language": "english", "review": "‎", "timestamp_created": 1735786229, "timestamp_updated": 1735786229, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184086660": {"recommendationid": "184086660", "author": {"steamid": "76561198199598763", "num_games_owned": 315, "num_reviews": 67, "playtime_forever": 6349, "playtime_last_two_weeks": 0, "playtime_at_review": 6349, "last_played": 1725208512}, "language": "english", "review": "Imo the best Nepnep game with Rebirth 1, the 3 games idea is really fun even tho it makes the game the hardest game of the series so far\n\nThe story is extremly good, the ost is hardly Dreamcast style which means its rock and metal and i love it, Uzume became my new fav Character and lot of elements that made Rebirth 3 so bad was removed and improved.\n\nMy fav Nepnep game and i loved the living shit out of it even tho the RNG Card achivment was hell, If you love Nepnep i 100% recommend it", "timestamp_created": 1735470187, "timestamp_updated": 1735470187, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184018785": {"recommendationid": "184018785", "author": {"steamid": "76561198822090824", "num_games_owned": 49, "num_reviews": 38, "playtime_forever": 1323, "playtime_last_two_weeks": 0, "playtime_at_review": 1017, "last_played": 1735745966}, "language": "english", "review": "anime girls kil random bs", "timestamp_created": 1735412855, "timestamp_updated": 1735412855, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.52651512622833252", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "183975520": {"recommendationid": "183975520", "author": {"steamid": "76561199498839589", "num_games_owned": 0, "num_reviews": 3, "playtime_forever": 80, "playtime_last_two_weeks": 0, "playtime_at_review": 80, "last_played": 1732994584}, "language": "finnish", "review": "Good game, but this PC Port is so ass. I have VIIR already but wanted to try the original, but the game lags so much even on my beefy PC which has a RX 7900 GRE and being out of focus from the game window for a while will crash it (no this is not intended as I checked event viewer). Refunded it sadly.", "timestamp_created": 1735384153, "timestamp_updated": 1735384153, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 3006, "total_negative": 181, "total_reviews": 3187}, "cursors": {"AoJ48vXU3oQDfa7p5QM=": "Mon Jan 20 19:13:42 2025"}}
