{"reviews": {"184981009": {"recommendationid": "184981009", "author": {"steamid": "76561198102245045", "num_games_owned": 218, "num_reviews": 28, "playtime_forever": 2266, "playtime_last_two_weeks": 2114, "playtime_at_review": 152, "last_played": 1737325364}, "language": "brazilian", "review": "E Um game bom porem esta bem defasado e datado em relação a gameplay em uma boa promoção vale um pouco", "timestamp_created": 1736213212, "timestamp_updated": 1736213212, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184833348": {"recommendationid": "184833348", "author": {"steamid": "76561198254028134", "num_games_owned": 244, "num_reviews": 84, "playtime_forever": 127, "playtime_last_two_weeks": 0, "playtime_at_review": 127, "last_played": 1736081670}, "language": "spanish", "review": "Mi Opinion:\r\n\r\nLa verdad he escuchado que la historia de este juego esta muy muy bien(soy fan de Sao y me lo recomendaron muchos conocidos y amigos) pero el juego lo noto peor graficamente,,en rendimiento y controles(como dije anteriormente en otra reseña,el sao lost song) para mi tiene peores controles,,optimización y gráficos,,es una pena por que el juego la historia me hablaron de el y no esta nada nada mal,,pero es que entre que el juego que no he dicho que es un port muy mal optimizado,,los controles son un tema serio(y no te deja editarlos a tu gusto)graficamente me da igual realmente,,pero es que se ve peor que el juego que comente anteriormente (sao lost song) los movimientos de los personajes jugando se nota muy lento y pesado,,ademas que para rotar la camara pasa como otro juego (sao origin) que tienes que hacer click derecho y mover el raton,, pero si lo haces el personaje ataca a la nada(teniendo predefinido en el teclado atacar a la q y e) ,,es una pena por que el juego no tiene nada mal su historia,,pero no esta para nada bien conseguido,,si lo encuentras oferta y como dije anteriormente lo soportas,,disfrutaras de el,,yo no he podido", "timestamp_created": 1736082427, "timestamp_updated": 1736082427, "voted_up": false, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}, "184024516": {"recommendationid": "184024516", "author": {"steamid": "76561197967143985", "num_games_owned": 481, "num_reviews": 16, "playtime_forever": 11851, "playtime_last_two_weeks": 0, "playtime_at_review": 10697, "last_played": 1735870190}, "language": "english", "review": "Sooo... This is actually one of my favorite games. It's too bad they don't have a little more coop in it, BUT, unlike most of sword arts games you can actually adventure through the overworld (Not the main storyline, annoyingly), and the infinite dungeon together, as well as some boss runs.\n\nNow, the main drawback, are the super crappy controls. Anyone who made this, had clearly never played the port, and I don't even think the gamepad controls are all that good, either. I wish they'd start considering how awkward their games are to play a little, they haven't improved it much in the future, either.\n\nI do love all of the variety of characters, they almost all handle quite differently. For instance, you can turn yourself into a battle fortress with one character, run around as a jaguar with another, play as an archer, a mage, a terrible villain, a great buffer, a super bouncy crazy slashy something or another... And every character has a slightly different spec, so you can customize pretty well to your playstyle.\n\nTl;dr - If you can get past the horrible controls, and you like sword art, or even just a decent action rpg, it's worthwhile. Oh, and the crappy hints for where you need to go next, but go look for a walkthrough if you need one ;P", "timestamp_created": 1735416557, "timestamp_updated": 1735416557, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false, "primarily_steam_deck": false}}, "query_summary": {"num_reviews": 100, "review_score": 6, "review_score_desc": "Mostly Positive", "total_positive": 836, "total_negative": 292, "total_reviews": 1128}, "cursors": {"AoJ4jrS7gP0CfPXnhgM=": "Mon Jan 20 19:50:09 2025"}}
